
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>01 - まだ起動してもいないのに · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >01 - まだ起動してもいないのに</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="01---&#x307E;&#x3060;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3082;&#x3044;&#x306A;&#x3044;&#x306E;&#x306B;">01 - &#x307E;&#x3060;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3082;&#x3044;&#x306A;&#x3044;&#x306E;&#x306B;</h1>
<p>&#x77E5;&#x3089;&#x306A;&#x3044;&#x9CE5;&#x304C;&#x9CF4;&#x304F;&#x671D;&#x3002;&#x79C1;&#x306F;&#x96FB;&#x8A71;&#x3068;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x5165;&#x308C;&#xFF0C;LINE&#x306B;&#x8FD4;&#x4FE1;&#x3057;&#x7D42;&#x3048;&#x308B;&#x3068;&#x305D;&#x306E;&#x307E;&#x307E;&#x5E03;&#x56E3;&#x306B;&#x5165;&#x3063;&#x305F;&#x3002;&#x6795;&#x5143;&#x306B;&#x60A0;&#x7136;&#x3068;&#x7ACB;&#x3064;&#x30AD;&#x30F3;&#x30B0;&#x30DA;&#x30F3;&#x30AE;&#x30F3;&#x306E;&#x306C;&#x3044;&#x3050;&#x308B;&#x307F;&#x306F;&#xFF0C;&#x305D;&#x306E;&#x4E38;&#x3005;&#x3068;&#x592A;&#x3063;&#x305F;&#x767D;&#x3044;&#x8179;&#x3092;&#x898B;&#x305B;&#x3064;&#x3051;&#xFF0C;&#x79C1;&#x306E;&#x5FC3;&#x3092;&#x7A4F;&#x3084;&#x304B;&#x306B;&#x3055;&#x305B;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x304A;&#x304B;&#x3086;&#x3050;&#x3089;&#x3044;&#x98DF;&#x3079;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x305D;&#x308C;&#x307E;&#x3067;&#x30C1;&#x30EB;&#x30B9;&#x30C6;&#x30C3;&#x30D7;&#x306E;&#x8EFD;&#x3084;&#x304B;&#x306A;&#x30E1;&#x30ED;&#x30C7;&#x30A3;&#x30FC;&#x3092;&#x6D41;&#x3057;&#x3066;&#x3044;&#x305F;EeePC&#x304C;&#x79C1;&#x306B;&#x8A00;&#x3063;&#x305F;&#x3002;&#x300C;&#x8179;&#x304C;&#x7A7A;&#x3063;&#x307D;&#x3060;&#x3068;&#x85AC;&#x3082;&#x98F2;&#x3081;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p>EeePC&#x306F;&#x3078;&#x3063;&#x307D;&#x3053;&#x306A;&#x6027;&#x80FD;&#x3092;&#x5DE5;&#x592B;&#x3067;&#x88DC;&#x3046;&#x79C1;&#x306E;&#x30A2;&#x30B7;&#x30B9;&#x30BF;&#x30F3;&#x30C8;&#x3060;&#x3002;&#x3057;&#x3070;&#x3089;&#x304F;&#x4F11;&#x7720;&#x3057;&#x3066;&#x3044;&#x305F;&#x304C;&#x6700;&#x8FD1;&#x306B;&#x306A;&#x3063;&#x3066;&#x606F;&#x3092;&#x5439;&#x304D;&#x8FD4;&#x3057;&#xFF0C;&#x4ECA;&#x3082;&#x76F8;&#x68D2;&#x3068;&#x3057;&#x3066;&#x6D3B;&#x8E8D;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x305D;&#x306E;&#x83EF;&#x9E97; (&#xFF1F;) &#x306A;&#x5FA9;&#x6D3B;&#x5287;&#x306F;&#x300C;<a href="https://jamcha-aa.github.io/EeePC/" target="_blank">EeePC&#x3068;Emacs&#x3068;&#x25CB;&#x25CB;&#x3068;</a>&#x300D;&#x306B;&#x66F8;&#x3044;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x98DF;&#x3079;&#x305F;&#x304F;&#x306A;&#x3044;&#x300D;&#x3068;&#x79C1;&#x306F;&#x8FD4;&#x4E8B;&#x3092;&#x3057;&#x305F;&#x304C;&#xFF0C;&#x3053;&#x306E;&#x307E;&#x307E;&#x7720;&#x308B;&#x3068;&#x6B21;&#x306B;&#x8D77;&#x304D;&#x305F;&#x3068;&#x304D;&#x306B;&#x672C;&#x5F53;&#x306B;&#x52D5;&#x3051;&#x306A;&#x304F;&#x306A;&#x308A;&#x305D;&#x3046;&#x306A;&#x306E;&#x3067;&#xFF0C;&#x91CD;&#x3044;&#x8EAB;&#x4F53;&#xFF0C;&#x7269;&#x7406;&#x7684;&#x306B;&#x306F;&#x305F;&#x3076;&#x3093;&#x8EFD;&#x3044;&#xFF0C;&#x3092;&#x8D77;&#x3053;&#x3057;&#x3066;&#x51B7;&#x8535;&#x5EAB;&#x306B;&#x5411;&#x304B;&#x3063;&#x305F;&#x3002;&#x6628;&#x6669;&#x4F5C;&#x3063;&#x3066;&#x304A;&#x3044;&#x305F;&#x304A;&#x304B;&#x3086;&#x3002;&#x30EC;&#x30C8;&#x30EB;&#x30C8;&#x306E;&#x304A;&#x3067;&#x3093;&#x3002;&#x305D;&#x308C;&#x306B;&#x5B9F;&#x5BB6;&#x304B;&#x3089;&#x9001;&#x3063;&#x3066;&#x304F;&#x308B;&#x6885;&#x5E72;&#x3057;&#x3002;&#x7389;&#x5B50;&#x306F;&#x305F;&#x3076;&#x3093;&#x53E3;&#x306B;&#x5165;&#x308C;&#x3066;&#x3082;&#x623B;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046;&#x306E;&#x3067;&#xFF0C;&#x5927;&#x6839;&#x3068;&#x3058;&#x3083;&#x304C;&#x3044;&#x3082;&#xFF0C;&#x3053;&#x3093;&#x3076;&#x3068;&#x3053;&#x3093;&#x306B;&#x3083;&#x304F;&#x306B;&#x3064;&#x3086;&#x3092;&#x304B;&#x3051;&#xFF0C;&#x8336;&#x7897;&#x306E;&#x304A;&#x304B;&#x3086;&#x3068;&#x4E00;&#x7DD2;&#x306B;&#x30EC;&#x30F3;&#x30B8;&#x306B;&#x5165;&#x308C;&#x305F;&#x3002;  </p>
<p><br><br>&#x30B9;&#x30D4;&#x30FC;&#x30AB;&#x30FC;&#x304B;&#x3089;&#x6D41;&#x308C;&#x308B;&#x97F3;&#x697D;&#x306F;&#x72ED;&#x3044;&#x90E8;&#x5C4B;&#x3092;&#x3084;&#x308F;&#x3089;&#x304B;&#x304F;&#x5305;&#x3080;&#x3002;&#x5E73;&#x65E5;&#x306B;&#x306E;&#x3093;&#x3073;&#x308A;&#x3057;&#x305F;&#x98DF;&#x4E8B;&#x3002;&#x305D;&#x308C;&#x3092;&#x3068;&#x304D;&#x304A;&#x308A;&#x4E2D;&#x65AD;&#x3055;&#x305B;&#x308B;&#xFF0C;&#x30D8;&#x30BF;&#x306A;&#x5F26;&#x697D;&#x5668;&#x306E;&#x3088;&#x3046;&#x306A;&#x54B3;&#x8FBC;&#x3080;&#x58F0;&#x3002;&#x98DF;&#x4E8B;&#x3092;&#x6E08;&#x307E;&#x305B;&#x3066;&#x51E6;&#x65B9;&#x3055;&#x308C;&#x305F;&#x85AC;&#x3092;&#x98F2;&#x3080;&#x3002;&#x6B6F;&#x3092;&#x78E8;&#x304D;&#xFF0C;&#x6C57;&#x3092;&#x5438;&#x3063;&#x305F;&#x4E0B;&#x7740;&#x3092;&#x66FF;&#x3048;&#x305F;&#x79C1;&#x306F;&#x4E00;&#x4ED5;&#x4E8B;&#x7D42;&#x3048;&#x305F;&#x3088;&#x3046;&#x306B;&#x5E03;&#x56E3;&#x306B;&#x5165;&#x308B;&#x3002;&#x79C1;&#x306E;&#x5177;&#x5408;&#x3092;&#x5FC3;&#x914D;&#x3059;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;&#x5C4A;&#x304F;&#x3002;&#x76F8;&#x624B;&#x306B;&#x5FC3;&#x914D;&#x3055;&#x305B;&#x306A;&#x3044;&#x3088;&#x3046;&#x660E;&#x308B;&#x3044;&#x5185;&#x5BB9;&#x3067;&#x8FD4;&#x4E8B;&#x3092;&#x3057;&#xFF0C;&#x76EE;&#x3092;&#x9589;&#x3058;&#x305F;&#x3002;  </p>
<p>&#x76EE;&#x3092;&#x9589;&#x3058;&#x305F;&#x304C;&#x3002;  </p>
<p>&#x306A;&#x304B;&#x306A;&#x304B;&#x843D;&#x3061;&#x7740;&#x304B;&#x305A;&#xFF0C;&#x5BDD;&#x3064;&#x3051;&#x306A;&#x3044;&#x3002;&#x8EAB;&#x4F53;&#x306F;&#x3053;&#x3093;&#x306A;&#x306B;&#x82E6;&#x3057;&#x3044;&#x306E;&#x306B;&#x3002;&#x4F55;&#x304B;&#x306B;&#x8FFD;&#x308F;&#x308C;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#xFF0C;&#x30A4;&#x30E4;&#x306A;&#x7126;&#x308A;&#x3092;&#x611F;&#x3058;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x306D;&#x3048;&#x300D;&#x79C1;&#x306F;EeePC&#x3092;&#x547C;&#x3093;&#x3060;&#x3002;&#x300C;&#x4F55;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x6C17;&#x5206;&#x8EE2;&#x63DB;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x6C17;&#x5206;&#x8EE2;&#x63DB;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x304C;&#x7720;&#x304F;&#x306A;&#x308B;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x300D;&#x300C;&#x305D;&#x308C;&#x306A;&#x3089;&#x300D;&#x300C;&#x305F;&#x3060;&#x3057;&#x5B9F;&#x8DF5;&#x30ED;&#x30A4;&#x30E4;&#x30EB;&#x82F1;&#x6587;&#x6CD5;&#x306F;&#x4E0D;&#x53EF;&#x300D;&#x300C;&#x2026;&#x306A;&#x305C;&#x3060;&#x300D;&#x300C;&#x982D;&#x4F7F;&#x3048;&#x306A;&#x3044;&#x304B;&#x3089;&#x300D;&#x300C;&#x3058;&#x3083;&#x3042;&#x305D;&#x306E;&#x307E;&#x307E;&#x6A2A;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308C;&#x3070;&#x3044;&#x3044;&#x300D;&#x300C;&#x6C17;&#x5206;&#x3092;&#x7D1B;&#x3089;&#x308F;&#x305B;&#x305F;&#x3044;&#x3093;&#x3060;&#x3088;&#x3002;&#x308F;&#x304B;&#x308B;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x300D;&#x300C;&#x308F;&#x304B;&#x3089;&#x3093;&#x306A;&#x300D;  </p>
<p>&#x79C1;&#x306F;USB&#x30B1;&#x30FC;&#x30D6;&#x30EB;&#x3092;&#x629C;&#x304F;&#x3068;&#xFF0C;EeePC&#x3092;&#x8179;&#x306E;&#x4E0A;&#x306B;&#x4E57;&#x305B;&#x308B;&#x3002;&#x8CA0;&#x8377;&#x3092;&#x304B;&#x3051;&#x3066;&#x3044;&#x306A;&#x3044;&#x305B;&#x3044;&#x304B;&#xFF0C;&#x3055;&#x307B;&#x3069;&#x71B1;&#x304F;&#x306A;&#x3044;&#x3002;&#x300C;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x30AB;&#x30D0;&#x30FC;&#xFF0C;&#x30DC;&#x30E8;&#x30DC;&#x30E8;&#x3060;&#x306D;&#x300D;&#x300C;&#x30DC;&#x30E8;&#x30DC;&#x30E8;&#x3063;&#x3066;&#x306A;&#x3093;&#x3060;&#x300D;&#x300C;&#x3078;&#x306B;&#x3083;&#x3078;&#x306B;&#x3083;&#x306B;&#x306A;&#x3063;&#x3066;&#x308B;&#x3063;&#x3066;&#x3053;&#x3068;&#x300D;&#x300C;&#x4F59;&#x8A08;&#x308F;&#x304B;&#x3089;&#x3093;&#x300D;  </p>
<p>&#x982D;&#x304C;&#x3082;&#x3046;&#x308D;&#x3046;&#x3068;&#x3059;&#x308B;&#x306A;&#x304B;&#xFF0C;&#x79C1;&#x306F;Emacs&#x3067;&#x9069;&#x5F53;&#x306B;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3092;&#x53E9;&#x304D;&#xFF0C;&#x753B;&#x9762;&#x5206;&#x5272;&#x3057;&#x305F;&#x308A;&#xFF0C;eww&#x3092;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x308A;&#x3059;&#x308B;&#x3002;  </p>
<p>&#x305D;&#x308C;&#x306F;&#x5168;&#x304F;&#x306E;&#x5076;&#x7136;&#x3060;&#x3063;&#x305F;&#x3002;&#x300C;&#x306D;&#x3048;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3063;&#x3066;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x306E;&#xFF1F;&#x300D;  </p>
<p>&#x306A;&#x305C;&#x305D;&#x3093;&#x306A;&#x3053;&#x3068;&#x3092;&#x8A00;&#x3063;&#x305F;&#x306E;&#x304B;&#x3002;&#x307C;&#x3093;&#x3084;&#x308A;&#x3057;&#x305F;&#x982D;&#x304C;&#x5947;&#x5999;&#x306A;&#x56DE;&#x8DEF;&#x3092;&#x7D50;&#x3093;&#x3060;&#x306E;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x300C;C-h T&#x300D;EeePC&#x306F;&#x7406;&#x7531;&#x3082;&#x805E;&#x304B;&#x305A;&#xFF0C;&#x305F;&#x3060;&#x8FD4;&#x4E8B;&#x3092;&#x3059;&#x308B;&#x3002;&#x300C;T&#x3063;&#x3066;&#x8868;&#x793A;&#x3055;&#x308C;&#x305F;&#x3060;&#x3051;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3059;&#x307E;&#x3093;&#x3002;&#x8D77;&#x52D5;&#x753B;&#x9762;&#x3067;&#x3057;&#x304B;&#x901A;&#x7528;&#x3057;&#x306A;&#x3044;&#x65B9;&#x6CD5;&#x3060;&#x3063;&#x305F;&#x3002; &quot;F1 t&quot; &#x3060;&#x300D;  </p>
<p>&#x79C1;&#x306F;EeePC&#x3092;&#x304B;&#x305F;&#x3080;&#x3051;&#x3066;F1&#x30AD;&#x30FC;&#x3092;&#x63A2;&#x3057;&#xFF0C;F1&#x3068;T&#x3092;&#x62BC;&#x3057;&#x305F;&#x3002;  </p>
<pre><code>Emacs &#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;.  &#x672C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x8457;&#x4F5C;&#x6A29;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x6700;&#x5F8C;&#x3092;&#x5FA1;&#x89A7;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x79C1;&#x306F;&#x76EE;&#x3092;&#x4E38;&#x304F;&#x3057;&#x305F;&#x3002;&#x300C;&#x3042;&#x308C;&#xFF1F;&#x3069;&#x3046;&#x3057;&#x3066;&#x65E5;&#x672C;&#x8A9E;&#x306A;&#x306E;&#xFF1F;&#x300D;  </p>
<p>&#x300C;Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306B;&#x306F;&#x6614;&#x304B;&#x3089;&#x65E5;&#x672C;&#x8A9E;&#x7248;&#x3082;&#x3042;&#x308B;&#x300D;&#x300C;&#x82F1;&#x8A9E;&#x7248;&#x3057;&#x304B;&#x306A;&#x3044;&#x3068;&#x601D;&#x3063;&#x3066;&#x305F;&#x3002;&#x524D;&#x306B;&#x898B;&#x305F;&#x3068;&#x304D;&#x306F;&#x82F1;&#x8A9E;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x300D;&#x300C;&#x30ED;&#x30B1;&#x30FC;&#x30EB;&#x304C;&#x82F1;&#x8A9E;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x304B;&#x3082;&#x3057;&#x308C;&#x3093;&#x306A;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x3082;&#x3042;&#x308B;&#x306A;&#x3089;&#x3082;&#x3063;&#x3068;&#x65E9;&#x304F;&#x8A00;&#x3063;&#x3066;&#x3088;&#x300D;&#x300C;&#x4ECA;&#x307E;&#x3067;&#x541B;&#x304C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x6C17;&#x306B;&#x3057;&#x305F;&#x3053;&#x3068;&#x306A;&#x3093;&#x3066;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x305D;&#x3046;&#x3060;&#x3051;&#x3069;&#x3055;&#x3042;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x753B;&#x9762;&#x3092;&#x9069;&#x5F53;&#x306B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x308B;&#x3002;&#x300C;&#x3059;&#x3054;&#x3044;&#x3002;&#x8AAD;&#x3081;&#x308B;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x306A;&#x3093;&#x3060;&#x304B;&#x3089;&#x3042;&#x305F;&#x308A;&#x307E;&#x3048;&#x3060;&#x308D;&#x3046;&#x300D; &quot;My mother language is English.&quot; &quot;You&apos;re kidding. Don&apos;t you remember your TOEIC score?&quot; &quot;990.&quot; &quot;Whew!&quot;  </p>
<p>&#x300C;&#x2026;&#x5197;&#x8AC7;&#x306F;&#x3055;&#x3066;&#x304A;&#x304D;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x305B;&#x3063;&#x304B;&#x304F;&#x306E;&#x6A5F;&#x4F1A;&#x3060;&#x304B;&#x3089;&#x901A;&#x3057;&#x3066;&#x3084;&#x3063;&#x3066;&#x307F;&#x3088;&#x3046;&#x304B;&#x306A;&#x300D;&#x300C;&#x8EAB;&#x4F53;&#x306E;&#x307B;&#x3046;&#x306F;&#x5E73;&#x6C17;&#x306A;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x6A2A;&#x306B;&#x306A;&#x3063;&#x3066;&#x308C;&#x3070;&#x5927;&#x4E08;&#x592B;&#x3002;&#x75B2;&#x308C;&#x305F;&#x3089;&#x3084;&#x3081;&#x308B;&#x3057;&#x300D;&#x300C;&#x7121;&#x7406;&#x3059;&#x308B;&#x306A;&#x3088;&#x300D;&#x300C;&#x307F;&#x3093;&#x306A;&#x53E3;&#x3060;&#x3051;&#x306F;&#x540C;&#x3058;&#x3053;&#x3068;&#x8A00;&#x3046;&#x3088;&#x306D;&#x300D;&#x300C;&#x79C1;&#x306F;&#x672C;&#x6C17;&#x3060;&#x3002;&#x79C1;&#x3088;&#x308A;&#x5148;&#x306B;&#x541B;&#x304C;&#x58CA;&#x308C;&#x3066;&#x306F;&#x7D04;&#x675F;&#x304C;&#x5B88;&#x3089;&#x308C;&#x306A;&#x3044;&#x304B;&#x3089;&#x306A;&#x300D;&#x300C;&#x7D04;&#x675F;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x3092;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F7F;&#x3046;&#x3068;&#x8A00;&#x3063;&#x305F;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<blockquote>
<p>&#x300C;&#x3060;&#x304B;&#x3089;&#x79C1;&#x306F;&#x6C7A;&#x3081;&#x305F;&#x300D;&#x300C;&#x4F55;&#x3092;&#xFF1F;&#x300D;&#x300C;&#x541B;&#x3092;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F7F;&#x304A;&#x3046;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
</blockquote>
<p>&#x300C;&#x3046;&#x3093;&#x3002;&#x8A00;&#x3063;&#x305F;&#x300D;  </p>
<p>&#x300C;&#x3060;&#x304B;&#x3089;&#x79C1;&#x304C;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x306F;&#xFF0C;&#x541B;&#x304C;&#x7121;&#x4E8B;&#x3067;&#x3044;&#x3066;&#x304F;&#x308C;&#x306A;&#x304F;&#x3066;&#x306F;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x7121;&#x8A00;&#x3067;EeePC&#x3092;&#x673A;&#x306B;&#x7F6E;&#x304D;&#xFF0C;&#x5E03;&#x56E3;&#x3092;&#x304B;&#x3076;&#x3063;&#x305F;&#x3002;&#x300C;&#x3084;&#x3089;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x300D;  </p>
<p>&#x5E03;&#x56E3;&#x3067;&#x9854;&#x3092;&#x96A0;&#x3057;&#x305F;&#x307E;&#x307E;&#x79C1;&#x306F;&#x7B54;&#x3048;&#x305F;&#x3002;&#x300C;&#x3046;&#x3093;&#x3002;&#x3042;&#x308A;&#x304C;&#x3068;&#x3002;&#x8EAB;&#x4F53;&#x304C;&#x826F;&#x304F;&#x306A;&#x3063;&#x3066;&#x304B;&#x3089;&#x3084;&#x308B;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x300D;&#x300C;&#x305D;&#x3046;&#x304B;&#x300D;&#x300C;&#x3042;&#x3068;&#x300D;&#x300C;&#x3042;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#xFF0C;&#x541B;&#x304C;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#xFF0C;&#x5143;&#x6C17;&#x3067;&#x3044;&#x308B;&#x304B;&#x3089;&#x3002;&#x7D04;&#x675F;&#x3059;&#x308B;&#x3002;&#x3060;&#x304B;&#x3089;&#x541B;&#x3082;&#x58CA;&#x308C;&#x306A;&#x3044;&#x3088;&#x3046;&#x9811;&#x5F35;&#x3063;&#x3066;&#x300D;  </p>
<p>EeePC&#x306F;&#x5C11;&#x3057;&#x6642;&#x9593;&#x3092;&#x304A;&#x3044;&#x3066;&#x7B54;&#x3048;&#x305F;&#x3002;&#x300C;&#x79C1;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;OS&#x304C;&#x5148;&#x306B;&#x306A;&#x304F;&#x306A;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x3093;&#x306A;&#x300D;&#x79C1;&#x306F;&#x5E03;&#x56E3;&#x304B;&#x3089;&#x9854;&#x3092;&#x51FA;&#x3059;&#x3002;&#x300C;&#x30CD;&#x30C3;&#x30C8;&#x306B;&#x3064;&#x306A;&#x304C;&#x306A;&#x3051;&#x308C;&#x3070;&#x5E73;&#x6C17;&#x3067;&#x3057;&#x3087;&#x3002;&#x73FE;&#x5F79;&#x306E;&#x30B3;&#x30E2;&#x30C9;&#x30FC;&#x30EB;64&#x3068;&#x304B;&#xFF0C;&#x3042;&#x3068;Apple&#x306E;Lisa&#x3068;&#x304B;&#x3042;&#x308B;&#x304F;&#x3089;&#x3044;&#x3060;&#x3057;&#x300D;&#x300C;&#x5E74;&#x5BC4;&#x308A;&#x3082;&#x3044;&#x3044;&#x3068;&#x3053;&#x308D;&#x3060;&#x300D;&#x300C;&#x307E;&#x305A;&#x306F;10&#x5E74;&#x751F;&#x304D;&#x306E;&#x3073;&#x305F;&#x3053;&#x3068;&#x3060;&#x3057;&#xFF0C;&#x6B21;&#x306E;10&#x5E74;&#x3092;&#x76EE;&#x6307;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x300D;&#x300C;&#x5584;&#x51E6;&#x3057;&#x3088;&#x3046;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x304B;&#x3089;&#x3044;&#x3064;&#x3082;&#x306E;&#x3088;&#x3046;&#x306B;EeePC&#x306E;&#x96FB;&#x6E90;&#x3092;&#x3064;&#x3051;&#x3063;&#x3071;&#x306A;&#x3057;&#x306B;&#x3057;&#x305F;&#x307E;&#x307E;&#x79C1;&#x306F;&#x76EE;&#x3092;&#x9589;&#x3058;&#x305F;&#x3002;&#x305D;&#x3046;&#x3057;&#x3066;&#x7A4F;&#x3084;&#x304B;&#x306A;&#x6C17;&#x6301;&#x3061;&#x306E;&#x307E;&#x307E;&#xFF0C;&#x5922;&#x306E;&#x4E2D;&#x3078;&#x8EAB;&#x4F53;&#x3092;&#x6EB6;&#x304B;&#x3057;&#x3066;&#x3044;&#x3063;&#x305F;&#x3002;  </p>
<p><br><br><br><br>&#x53C2;&#x8003;1: <a href="https://sploid.gizmodo.com/this-old-ass-commodore-64-is-still-being-used-to-run-an-1787196319" target="_blank">2016&#x5E74;&#x6642;&#x70B9;&#x3067;&#x73FE;&#x5F79;&#x306E;&#x30B3;&#x30E2;&#x30C9;&#x30FC;&#x30EB;64</a>  </p>
<p>&#x53C2;&#x8003;2: <a href="http://lisa2.com/" target="_blank">2018&#x5E74;&#x73FE;&#x5728;&#x3082;Apple&#x306E;Lisa&#x3067;&#x904B;&#x55B6;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;Web&#x30B5;&#x30A4;&#x30C8;</a>  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Emacsのチュートリアルをプレイ。">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: 02 - 監獄からの脱出">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"01 - まだ起動してもいないのに","level":"2.1","depth":1,"next":{"title":"02 - 監獄からの脱出","level":"2.2","depth":1,"path":"02.md","ref":"02.md","articles":[]},"previous":{"title":"Emacsのチュートリアルをプレイ。","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01.md","mtime":"2018-08-14T11:00:22.029Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-16T13:31:54.440Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

