
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>02 - 監獄からの脱出 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03.html" />
    
    
    <link rel="prev" href="01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >02 - 監獄からの脱出</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="02---&#x76E3;&#x7344;&#x304B;&#x3089;&#x306E;&#x8131;&#x51FA;">02 - &#x76E3;&#x7344;&#x304B;&#x3089;&#x306E;&#x8131;&#x51FA;</h1>
<p>&#x300C;&#x5922;&#x306E;&#x4E2D;&#x3067;&#x3055;&#x3042;&#xFF0C;&#x300D;&#x4F53;&#x8ABF;&#x3092;&#x53D6;&#x308A;&#x623B;&#x3057;&#x305F;&#x79C1;&#x304C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x4E0B;&#x8AAD;&#x307F;&#x3092;&#x3057;&#x306A;&#x304C;&#x3089;&#x8A00;&#x3046;&#x3002;&#x300C;&#x753A;&#x7530;&#x5EB7;&#x5148;&#x751F;&#x304C;&#x300E;&#x3075;&#x308A;&#x304C;&#x306A;&#x304C;&#x7121;&#x304F;&#x3066;&#x3082;&#x8AAD;&#x3081;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x308D;&#x300F;&#x3063;&#x3066;&#x8A00;&#x3063;&#x3066;&#x305F;&#x3093;&#x3060;&#x3088;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x3092;&#x805E;&#x3044;&#x305F;EeePC&#x304C;&#x554F;&#x3046;&#x3002;&#x300C;&#x5922;&#x306E;&#x4E2D;&#x3067;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x5922;&#x306E;&#x4E2D;&#x3067;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x300D;&#x300C;&#x5922;&#x306E;&#x4E2D;&#x3067;&#x304B;&#x2026;&#x300D;&#x300C;&#x306A;&#x306B;&#xFF1F;&#x306A;&#x3093;&#x306A;&#x306E;&#xFF1F;&#x300D;  </p>
<p>&#x3042;&#x307E;&#x308A;&#x306B;&#x304F;&#x3060;&#x3089;&#x306A;&#x3044;&#x306E;&#x3067;EeePC&#x304C;&#x3042;&#x304D;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x5922;&#x306E;&#x4E2D;&#x306E;&#x753A;&#x7530;&#x5EB7;&#x5148;&#x751F;&#x306F;&#x3069;&#x3046;&#x3057;&#x3066;&#x305D;&#x3046;&#x8A00;&#x3063;&#x3066;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x308F;&#x304B;&#x3093;&#x306A;&#x3044;&#x3088;&#xFF0C;&#x5922;&#x3060;&#x3082;&#x3093;&#x300D;&#x300C;&#x2026;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;&#x300C;&#x308F;&#x304B;&#x308A;&#x3084;&#x3059;&#x3044;&#x6587;&#x7AE0;&#x3092;&#x5E38;&#x306B;&#x5FC3;&#x304C;&#x3051;&#x308D;&#x3063;&#x3066;&#x3053;&#x3068;&#x304B;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x77E5;&#x308B;&#x304B;&#x300D;  </p>
<p><br><br>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x541B;&#x306F;&#x8AAD;&#x8005;&#x306B;&#x304A;&#x8A6B;&#x3073;&#x3059;&#x308B;&#x3079;&#x304D;&#x3060;&#x3068;&#x601D;&#x3046;&#x3093;&#x3060;&#x304C;&#x300D;EeePC&#x304C;&#x8A00;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x4F55;&#x3092;&#x300D;&#x300C;&#x541B;&#x306F;&#x524D;&#x56DE;&#x306E;&#x6700;&#x5F8C;&#x3067;&#x5BDD;&#x305F;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x4ECA;&#x56DE;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x76E3;&#x7344;&#x304B;&#x3089;&#x306E;&#x8131;&#x51FA;&#x300D;&#x300C;&#x3075;&#x3064;&#x3046;&#x306E;&#x8AAD;&#x8005;&#x306A;&#x3089;&#x305D;&#x3053;&#x3067;&#x7570;&#x4E16;&#x754C;&#x306B;&#x3060;&#x306A;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x5E2D;&#x304B;&#x3089;&#x8EAB;&#x4F53;&#x3092;&#x96E2;&#x3059;&#x3002;&#x300C;&#x3042;&#x30FC;&#xFF0C;&#x3046;&#x3061;&#x305D;&#x3046;&#x3044;&#x3046;&#x306E;&#x3084;&#x3063;&#x3066;&#x306A;&#x3044;&#x3093;&#x3067;&#x3059;&#x3088;&#x300D;&#x300C;&#x306E;&#x308C;&#x3093;&#x306B;&#x507D;&#x308A;&#x3042;&#x308A;&#x3060;&#x300D;&#x300C;&#x306F;&#x3044;&#xFF0C;&#x307B;&#x3093;&#x3068;&#x3046;&#x306B;Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x30D7;&#x30EC;&#x30A4;&#x3059;&#x308B;&#x3060;&#x3051;&#x306A;&#x306E;&#x3067;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x306A;&#x306E;&#x306B;&#x3069;&#x3046;&#x3057;&#x3066;&#x76E3;&#x7344;&#x304B;&#x3089;&#x306E;&#x8131;&#x51FA;&#x306A;&#x3093;&#x3066;&#x4EF0;&#x3005;&#x3057;&#x3044;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306B;&#x3057;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x5148;&#x751F;&#x304C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x304D;&#x306A;&#x3044;&#x306E;&#x306F;&#x4E21;&#x624B;&#x3092;&#x7E1B;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x3063;&#x3066;&#x8A00;&#x3063;&#x3066;&#x305F;&#x304B;&#x3089;&#x300D;&#x300C;&#x304A;&#xFF0C;&#x304A;&#x3046;&#x2026;&#x610F;&#x5916;&#x3068;&#x3061;&#x3083;&#x3093;&#x3068;&#x3057;&#x3066;&#x308B;&#x306E;&#x3060;&#x306A;&#x300D;&#x300C;&#x3067;&#x3082;&#x3053;&#x308C;&#x3092;&#x8AAD;&#x3093;&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x304C;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x308F;&#x3051;&#x3067;&#x3082;&#x306A;&#x3044;&#x3067;&#x3059;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;  </p>
<p><br><br>&#x79C1;&#x304C;&#x6E96;&#x5099;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#xFF0C;EeePC&#x304C;&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x541B;&#x306F;&#x3044;&#x304D;&#x306A;&#x308A;Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x304B;&#x3089;&#x59CB;&#x3081;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x3068;&#x53E3;&#x3092;&#x306F;&#x3055;&#x3093;&#x3060;&#x3002;&#x300C;&#x3069;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3068;&#x3044;&#x3046;&#x304B;&#x3089;&#x306B;&#x306F;&#xFF0C;Emacs&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x65B9;&#x6CD5;&#x304F;&#x3089;&#x3044;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x3079;&#x304D;&#x3060;&#x3068;&#x601D;&#x3046;&#x304C;&#x300D;  </p>
<p>&#x300C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x304B;&#x2026;&#x300D;&#x79C1;&#x306F;&#x9854;&#x3092;&#x4E0A;&#x3052;&#xFF0C;&#x9060;&#x304F;&#x3092;&#x898B;&#x308B;&#x3002;EeePC&#x304C;&#x4F55;&#x5EA6;&#x304B;&#x547C;&#x3073;&#x304B;&#x3051;&#x308B;&#x304C;&#xFF0C;&#x307E;&#x308B;&#x3067;&#x805E;&#x3044;&#x3066;&#x3044;&#x306A;&#x3044;&#x3002;&#x300C;&#x2026;&#x300D;  </p>
<pre><code>Emacs &#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x4E00;&#x822C;&#x306B;&#x30B3;
</code></pre><p>&#x300C;&#x304A;&#x3044;&#xFF0C;&#x8A71;&#x3092;&#x805E;&#x3051;&#x300D;  </p>
<p>&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x9032;&#x3081;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x79C1;&#x3092;EeePC&#x304C;&#x3042;&#x308F;&#x3066;&#x3066;&#x6B62;&#x3081;&#x308B;&#x3002;&#x300C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x65B9;&#x6CD5;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x308D;&#x3068;&#x8A00;&#x3063;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x53E3;&#x3092;&#x53F0;&#x5F62;&#x306B;&#x3057;&#xFF0C;&#x5ACC;&#x60AA;&#x306E;&#x611F;&#x60C5;&#x3092;&#x8FBC;&#x3081;&#x305F;&#x76EE;&#x3067;EeePC&#x3092;&#x898B;&#x308B;&#x3002;&#x300C;&#x306A;&#x3093;&#x3060;&#x305D;&#x306E;&#x76EE;&#x306F;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x307E;&#x305F;&#x3081;&#x3093;&#x3069;&#x304F;&#x3055;&#x3044;&#x3068;&#x304B;&#x8A00;&#x3046;&#x3064;&#x3082;&#x308A;&#x304B;&#x300D;&#x300C;&#x8A00;&#x3063;&#x3066;&#x307E;&#x305B;&#x3093;&#x300D;&#x300C;&#x76EE;&#x3067;&#x8A00;&#x3063;&#x3066;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;&#x307E;&#x3063;&#x305F;&#x304F;&#x3002;&#x5ACC;&#x304C;&#x3063;&#x3066;&#x3082;&#x3060;&#x3081;&#x3060;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x96F0;&#x56F2;&#x6C17;&#x3060;&#x3051;&#x3067;&#x3082;&#x5165;&#x9580;&#x3089;&#x3057;&#x304F;&#xFF0C;&#x305D;&#x308C;&#x304C;&#x793C;&#x5100;&#x3060;&#x3002;&#x308F;&#x304B;&#x308B;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306E;&#x76EE;&#x304C;&#x6F64;&#x307F;&#xFF0C;EeePC&#x304C;&#x3046;&#x308D;&#x305F;&#x3048;&#x308B;&#x3002;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x305D;&#x3093;&#x306A;&#x306B;&#x5ACC;&#x306A;&#x306E;&#x304B;&#x300D;&#x79C1;&#x304C;&#x4F55;&#x5EA6;&#x3082;&#x3046;&#x306A;&#x305A;&#x304F;&#x3002;&#x300C;&#x3046;&#x30FC;&#x3080;&#x3002;&#x3057;&#x3087;&#x3046;&#x304C;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;!&#x300D;&#x300C;&#x753B;&#x50CF;&#x306F;&#x7528;&#x610F;&#x3057;&#x306A;&#x304F;&#x3066;&#x3082;&#x3044;&#x3044;&#x304B;&#x3089;&#xFF0C;&#x3067;&#x304D;&#x308B;&#x7BC4;&#x56F2;&#x3067;&#x8AAC;&#x660E;&#x3057;&#x308D;&#x3002;&#x3044;&#x3044;&#x306A;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x306F;&#x3041;!&#xFF1F;&#x300D;&#x601D;&#x308F;&#x305A;&#x5927;&#x58F0;&#x304C;&#x51FA;&#x308B;&#x3002;&#x300C;&#x5F53;&#x305F;&#x308A;&#x524D;&#x3060;&#x308D;&#x3046;&#x3002;&#x7701;&#x7565;&#x3067;&#x304D;&#x308B;&#x3068;&#x3067;&#x3082;&#x601D;&#x3063;&#x305F;&#x304B;&#x300D;&#x300C;&#x2026;&#x541B;&#x3068;&#x4E00;&#x7DD2;&#x306B;&#x6D77;&#x306B;&#x5165;&#x308D;&#x3046;&#x304B;&#x300D;&#x300C;&#x8003;&#x3048;&#x304C;&#x6975;&#x7AEF;&#x3059;&#x304E;&#x308B;&#x305E;&#x3002;&#x306F;&#x3058;&#x3081;&#x306F;&#x591A;&#x5C11;&#x96D1;&#x3067;&#x3082;&#xFF0C;&#x5F8C;&#x304B;&#x3089;&#x76F4;&#x305B;&#x308B;&#x3093;&#x3060;&#x304B;&#x3089;&#x3002;&#x3055;&#x3042;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x300D;&#x3057;&#x3076;&#x3057;&#x3076;&#x79C1;&#x306F;EeePC&#x306B;&#x5F93;&#x3044;&#xFF0C;&#x753B;&#x9762;&#x306B;&#x5411;&#x304B;&#x3063;&#x305F;&#x3002;  </p>
<h2 id="1-&#x305F;&#x304F;&#x3055;&#x3093;&#x5931;&#x6557;&#x3059;&#x308B;">1. &#x305F;&#x304F;&#x3055;&#x3093;&#x5931;&#x6557;&#x3059;&#x308B;</h2>
<p>&#x79C1;&#x306F;Emacs&#x306E;scratch&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3067;&#x6B21;&#x306E;&#x6587;&#x5B57;&#x3092;&#x5165;&#x529B;&#x3057;&#x305F;&#x3002;  </p>
<pre><code>(1 1 +)
</code></pre><p>C-j &#x3067;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x5373;&#x5EA7;&#x306B;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;  </p>
<pre><code>Debugger entered--Lisp error: (invalid-function 1)
(1 1 +)
eval((1 1 +) nil)
elisp--eval-last-sexp(t)
eval-last-sexp(t)
eval-print-last-sexp(nil)
funcall-interactively(eval-print-last-sexp nil)
call-interactively(eval-print-last-sexp nil nil)
command-execute(eval-print-last-sexp)
</code></pre><p>&#x300C;&#x306A;&#x3093;&#x3060;&#x3053;&#x308C;&#x306F;&#x300D;EeePC&#x304C;&#x305F;&#x305A;&#x306D;&#x308B;&#x3002;&#x300C;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x3066;&#x308B;&#x300D;&#x300C;&#x305D;&#x308C;&#x3050;&#x3089;&#x3044;&#x898B;&#x308C;&#x3070;&#x308F;&#x304B;&#x308B;&#x3002;&#x3069;&#x3046;&#x3057;&#x3066;&#x305D;&#x3093;&#x306A;&#x3053;&#x3068;&#x3092;&#xFF1F;&#x300D;  </p>
<p>&#x79C1;&#x306F;eww&#x3067;&#x691C;&#x7D22;&#x3092;&#x3057;&#x306A;&#x304C;&#x3089;&#x7D9A;&#x3051;&#x308B;&#x3002;&#x300C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x304C;&#x51FA;&#x3059;&#x30A8;&#x30E9;&#x30FC;&#x3092;&#x3053;&#x308F;&#x304C;&#x308B;&#x4EBA;&#x304C;&#x7D50;&#x69CB;&#x3044;&#x308B;&#x304B;&#x3089;&#x300D;&#x300C;&#x305D;&#x308C;&#x3068;&#x5165;&#x9580;&#x306B;&#x4F55;&#x306E;&#x95A2;&#x4FC2;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;&#x308F;&#x304B;&#x3089;&#x3093;&#x306E;&#x3060;&#x304C;&#x300D;&#x300C;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x308B;&#x306E;&#x304C;&#x666E;&#x901A;&#xFF0C;&#x3063;&#x3066;&#x304F;&#x3089;&#x3044;&#x306B;&#x6C17;&#x697D;&#x306B;&#x601D;&#x3063;&#x3066;&#x3044;&#x3066;&#x307B;&#x3057;&#x3044;&#x3093;&#x3060;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x305D;&#x3046;&#x3057;&#x306A;&#x3044;&#x3068;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3060;&#x3051;&#x3067;&#x529B;&#x3064;&#x304D;&#x308B;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x518D;&#x3073;scratch&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x5165;&#x529B;&#x3059;&#x308B;&#x3002;  </p>
<pre><code>(+ 1 1)
2
</code></pre><p>&#x300C;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;&#x8A08;&#x7B97;&#x306E;&#x9806;&#x756A;&#x5909;&#x3048;&#x305F;&#x304B;&#x3089;&#x306D;&#x300D;&#x300C;&#x9806;&#x756A;&#xFF1F;&#x300D;&#x300C;Emacs&#x306E;&#x96FB;&#x5353; (<code>M-x calc</code>) &#x3068;Emacs&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x7B26;&#x53F7;&#x306E;&#x5834;&#x6240;&#x304C;&#x9055;&#x3046;&#x3093;&#x3060;&#x3002;&#x79C1;&#x306F;&#x6700;&#x521D;&#xFF0C;&#x96FB;&#x5353;&#x306E;&#x6C17;&#x5206;&#x3067;&#x5165;&#x529B;&#x3057;&#x305F;&#x304B;&#x3089;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x305F;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x3066;&#x3082;&#x6545;&#x969C;&#x3059;&#x308B;&#x308F;&#x3051;&#x3058;&#x3083;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x5931;&#x6557;&#x3057;&#x3066;&#x3082;&#x5E73;&#x6C17;&#x306A;&#x306E;&#x304C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3067;&#x904A;&#x3076;&#x826F;&#x3044;&#x3068;&#x3053;&#x308D;&#x3060;&#x3068;&#x601D;&#x3046;&#x304B;&#x3089;&#x300D;&#x300C;<a href="https://www.google.com/about/appsecurity/play-rewards/" target="_blank">&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x30DF;&#x30B9;&#x3092;&#x898B;&#x3064;&#x3051;&#x308B;&#x3068;&#x8CDE;&#x91D1;&#x3092;&#x304F;&#x308C;&#x308B;&#x4F1A;&#x793E;</a>&#x3082;&#x3042;&#x308B;&#x304F;&#x3089;&#x3044;&#x3060;&#x3057;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;&#x3060;&#x304B;&#x3089;&#x3069;&#x3093;&#x3069;&#x3093;&#x5931;&#x6557;&#x3057;&#x3088;&#x3046;&#x300D;  </p>
<h2 id="2-windows">2. Windows</h2>
<p>&#x300C;<a href="https://ftp.gnu.org/gnu/emacs/windows/emacs-26/" target="_blank">&#x516C;&#x5F0F;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x3082;&#x914D;&#x5E03;&#x3057;&#x3066;&#x308B;</a>&#x3051;&#x3069;&#xFF0C;&#x65E5;&#x672C;&#x8A9E;&#x304C;&#x3046;&#x307E;&#x304F;&#x6253;&#x3066;&#x306A;&#x304B;&#x3063;&#x305F;&#x3088;&#x3046;&#x306A;&#x6C17;&#x304C;&#x3059;&#x308B;&#x300D;&#x300C;&#x6700;&#x521D;&#x304B;&#x3089;&#x30B2;&#x30FC;&#x30E0;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x5E78;&#x3044;&#x306A;&#x3053;&#x3068;&#x306B;&#x65E5;&#x672C;&#x8A9E;&#x3092;&#x6253;&#x3066;&#x308B;&#x3088;&#x3046;&#x4FEE;&#x6B63;&#x3057;&#x3066;&#x914D;&#x5E03;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x65B9;&#x304C;&#x304A;&#x3089;&#x308C;&#x307E;&#x3059; (&#x2192; <a href="https://ja.osdn.net/projects/gnupack/" target="_blank">gnupack</a>)&#x300D;&#x300C;&#x3042;&#x308A;&#x304C;&#x305F;&#x3044;&#x3053;&#x3068;&#x3060;&#x300D;&#x300C;<a href="https://ja.osdn.net/projects/gnupack/" target="_blank">gnupack</a> &#x3068; <a href="https://www.yatex.org/" target="_blank">yatex</a> &#x3068; <a href="https://www.ms.u-tokyo.ac.jp/~abenori/soft/abtexinst.html" target="_blank">TeX&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30E9;</a> &#x306B;&#x304A;&#x4E16;&#x8A71;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x65B9;&#x3082;&#x591A;&#x3044;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x541B;&#x306E;&#x5834;&#x5408;&#x306F;&#x3069;&#x3046;&#x306A;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;<a href="http://www.msys2.org/" target="_blank">MSYS2</a>&#x3067;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3066;&#x307E;&#x3059;&#x300D;&#x300C;&#x624B;&#x9593;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#x306A;&#x3093;&#x304B;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x3058;&#x3083;&#x3093;&#x300D;&#x300C;&#x2026;&#x541B;&#x306F;&#x524D;&#x304B;&#x3089;&#x305D;&#x3046;&#x3044;&#x3046;&#x3084;&#x3064;&#x3060;&#x3063;&#x305F;&#x306A;&#x300D;  </p>
<h2 id="3-mac">3. Mac</h2>
<p>&#x300C;&#x79C1;&#x306F;Mac&#x3067;Emacs&#x4F7F;&#x3063;&#x3066;&#x306A;&#x3044;&#x300D;&#x300C;&#x6700;&#x521D;&#x304B;&#x3089;&#x30B2;&#x30FC;&#x30E0;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x3053;&#x3063;&#x3061;&#x3082;brew&#x3067;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3067;&#x304D;&#x308B;&#x3084;&#x3064;&#x306B;&#x306F;&#x3044;&#x304F;&#x3064;&#x304B;&#x554F;&#x984C;&#x304C;&#x3042;&#x3063;&#x305F;&#x3088;&#x3046;&#x306A;&#x300D;&#x300C;&#x5384;&#x4ECB;&#x3060;&#x306A;&#x300D;&#x300C;&#x5E78;&#x3044;&#x306A;&#x3053;&#x3068;&#x306B;&#x554F;&#x984C;&#x3092;&#x4FEE;&#x6B63;&#x3057;&#x3066;&#x914D;&#x5E03;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x65B9;&#x304C;&#x304A;&#x3089;&#x308C;&#x307E;&#x3059; (&#x2192; <a href="https://github.com/railwaycat/homebrew-emacsmacport" target="_blank">Emacs Mac Port</a>)&#x300D;&#x300C;&#x3042;&#x308A;&#x304C;&#x305F;&#x3044;&#x3053;&#x3068;&#x3060;&#x300D;&#x300C;<a href="http://tug.org/mactex/" target="_blank">MacTeX</a>&#x306B;&#x304A;&#x4E16;&#x8A71;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x65B9;&#x3082;&#x591A;&#x3044;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x541B;&#x306F;Mac&#x3067;&#x4F55;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;<a href="https://www.mimikaki.net/" target="_blank">mi</a>&#x3068;&#x304B;IDE&#x306B;&#x5165;&#x3063;&#x3066;&#x308B;&#x3084;&#x3064;&#x3068;&#x304B;&#x300D;&#x300C;Emacs&#x306F;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x306E;&#x90AA;&#x6C17;&#x306B;&#x6C5A;&#x67D3;&#x3055;&#x308C;&#x308B;&#x304B;&#x3089;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x90AA;&#x6C17;&#x304B;&#x300D;&#x300C;&#x7634;&#x6C17;&#x3068;&#x3044;&#x3063;&#x3066;&#x3082;&#x3044;&#x3044;&#x300D;&#x300C;&#x304A;&#x3063;&#x304B;&#x306A;&#x3044;&#x3002;&#x541B;&#x306B;&#x306F;&#x4ECA;&#x5F8C;&#x85A6;&#x3081;&#x308B;&#x306E;&#x306F;&#x3088;&#x305D;&#x3046;&#x300D;  </p>
<h2 id="4-linux">4. Linux</h2>
<p>&#x300C;Linux&#x3067;&#x306F;&#x5927;&#x62B5;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x4E00;&#x767A;&#x3067;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059; (<code>$ sudo apt install emacs</code> &#x7B49;)&#x300D;&#x300C;&#x6700;&#x521D;&#x304B;&#x3089;&#x30B2;&#x30FC;&#x30E0;&#x30AF;&#x30EA;&#x30A2;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;emacs-mozc&#x3092;&#x5165;&#x308C;&#x308B;&#x3068;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x306E;&#x554F;&#x984C;&#x3082;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x300D;&#x300C;&#x3042;&#x308A;&#x304C;&#x305F;&#x3044;&#x3053;&#x3068;&#x3060;&#x300D;&#x300C;&#x3082;&#x3057;Emacs&#x306B;&#x8208;&#x5473;&#x3092;&#x6301;&#x3063;&#x305F;&#x3089;&#xFF0C;VirtualBox&#x3068;&#x304B;&#x306B;Ubuntu&#x5165;&#x308C;&#x3066;&#x904A;&#x3093;&#x3067;&#x307F;&#x3066;&#x304B;&#x3089;&#x3067;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
<h2 id="&#x3068;&#x3053;&#x308D;&#x3067;">&#x3068;&#x3053;&#x308D;&#x3067;</h2>
<p>&#x3072;&#x3068;&#x3068;&#x304A;&#x308A;&#x8AAC;&#x660E;&#x304C;&#x6E08;&#x3093;&#x3060;&#x3068;&#x3053;&#x308D;&#x3067;EeePC&#x304C;&#x8A00;&#x3063;&#x305F;&#x3002;&#x300C;&#x307E;&#x3060;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x4E00;&#x884C;&#x3082;&#x9032;&#x3093;&#x3067;&#x306A;&#x3044;&#x306A;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x305D;&#x306E;&#x8A00;&#x3044;&#x69D8;&#x306B;&#x30AB;&#x30C3;&#x3068;&#x306A;&#x3063;&#x3066;&#x53EB;&#x3076;&#x3002;&#x300C;&#x3060;&#x3063;&#xFF0C;&#x8AB0;&#x306E;&#x305B;&#x3044;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x3088;!&#x300D;&#x300C;&#x3059;&#x307E;&#x3093;&#x3002;&#x3060;&#x304C;&#x3053;&#x308C;&#x304F;&#x3089;&#x3044;&#x52A9;&#x8D70;&#x3092;&#x3064;&#x3051;&#x3066;&#x3044;&#x308C;&#x3070;&#x3059;&#x3093;&#x306A;&#x308A;&#x3068;&#x672C;&#x4E38;&#x306B;&#x5165;&#x3063;&#x3066;&#x3044;&#x3051;&#x308B;&#x3068;&#x601D;&#x3063;&#x3066;&#x306A;&#x300D;&#x300C;&#x2026;&#x300D;&#x79C1;&#x306F;&#x6B6F;&#x3092;&#x304B;&#x307F;&#x3057;&#x3081;&#xFF0C;EeePC&#x3092;&#x306B;&#x3089;&#x307F;&#x3064;&#x3051;&#x308B;&#x3002;EeePC&#x306F;&#x7D9A;&#x3051;&#x308B;&#x3002;&#x300C;&#x9000;&#x5C48;&#x306B;&#x306A;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x8EFD;&#x3044;&#x6C17;&#x6301;&#x3061;&#x3067;&#x541B;&#x3082;&#x9032;&#x3081;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x2026;&#x305D;&#x308A;&#x3083;&#x3042;&#xFF0C;&#x305D;&#x3046;&#x3060;&#x3051;&#x3069;&#x3055;&#x300D;&#x300C;&#x79C1;&#x306F;&#x75B2;&#x308C;&#x306A;&#x3044;&#x306E;&#x304C;&#x3068;&#x308A;&#x3048;&#x3060;&#x3002;&#x3053;&#x308C;&#x304B;&#x3089;&#x306F;&#x541B;&#x306E;&#x601D;&#x3046;&#x3088;&#x3046;&#x306B;&#x9032;&#x3081;&#x3066;&#x304B;&#x307E;&#x308F;&#x306A;&#x3044;&#x3002;&#x3044;&#x3064;&#x3067;&#x3082;&#x3044;&#x3044;&#x3002;&#x6700;&#x5F8C;&#x307E;&#x3067;&#x4ED8;&#x304D;&#x5408;&#x304A;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x307B;&#x3093;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x305D;&#x306E;&#x8A00;&#x8449;&#x306B;&#x79C1;&#x306F;&#x5B09;&#x3005;&#x3068;&#x3057;&#x3066;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3092;&#x53E9;&#x304F;&#x3002;  </p>
<pre><code>      &#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306E;&#x65B9;&#x3005;&#x306B;&#x6DF1;&#x304F;&#x611F;&#x8B1D;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3044;&#x304D;&#x306A;&#x308A;&#x6700;&#x5F8C;&#x307E;&#x3067;&#x98DB;&#x3070;&#x3059;&#x306A;!&#x300D;EeePC&#x304C;&#x5420;&#x3048;&#x305F;&#x3002;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01.html" class="navigation navigation-prev " aria-label="Previous page: 01 - まだ起動してもいないのに">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="03.html" class="navigation navigation-next " aria-label="Next page: 03 - 偽装テキスト">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"02 - 監獄からの脱出","level":"2.2","depth":1,"next":{"title":"03 - 偽装テキスト","level":"3.1","depth":1,"path":"03.md","ref":"03.md","articles":[]},"previous":{"title":"01 - まだ起動してもいないのに","level":"2.1","depth":1,"path":"01.md","ref":"01.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"02.md","mtime":"2018-08-12T05:33:23.460Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-12T09:10:00.080Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

