
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>03 - 偽装テキスト · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="04.html" />
    
    
    <link rel="prev" href="02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter active" data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >03 - 偽装テキスト</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="03---&#x507D;&#x88C5;&#x30C6;&#x30AD;&#x30B9;&#x30C8;">03 - &#x507D;&#x88C5;&#x30C6;&#x30AD;&#x30B9;&#x30C8;</h1>
<p>&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x8D77;&#x52D5;&#x65B9;&#x6CD5;&#x306F;&#x899A;&#x3048;&#x3066;&#x308B;&#x306A;&#xFF1F;&#x300D;EeePC&#x304C;&#x805E;&#x304F;&#x3002;&#x300C;F1 t&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x300D;  </p>
<p>&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3068;&#xFF0C;2&#x884C;&#x76EE;&#x306B;&#x3044;&#x304D;&#x306A;&#x308A;&#x82F1;&#x8A9E;&#x304C;&#x8868;&#x308C;&#x308B;&#x3002;  </p>
<pre><code>NOTICE: The main purpose of the Emacs tutorial is to teach you
the most important standard Emacs commands (key bindings).
However, your Emacs has been customized by changing some of
these basic editing commands, so it doesn&apos;t correspond to the
tutorial.  We have inserted colored notices where the altered
commands have been introduced. [More]
</code></pre><p>&#x300C;&#x540C;&#x3058;&#x6A5F;&#x80FD;&#x3067;&#x3082;&#x30B7;&#x30E7;&#x30FC;&#x30C8;&#x30AB;&#x30C3;&#x30C8;&#x306E;&#x7A2E;&#x985E;&#x304C;&#x3044;&#x304F;&#x3064;&#x304B;&#x3042;&#x308B;&#x3088;&#xFF0C;&#x3063;&#x3066;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x300D;&#x300C;&#x6DF7;&#x4E71;&#x3057;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x4F7F;&#x3048;&#x308B;&#x3084;&#x3064;&#x4E00;&#x7A2E;&#x985E;&#x899A;&#x3048;&#x3066;&#x304A;&#x3051;&#x3070;&#x3044;&#x3044;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;  </p>
<pre><code>Emacs &#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x4E00;&#x822C;&#x306B;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#xFF08;&#x30AD;&#x30FC;&#x30C8;&#x30C3;&#x30D7;&#x306B;
CONTROL &#x3068;&#x304B; CTRL &#x3068;&#x304B; CTL &#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#xFF09;&#x3084;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#xFF08;&#x30AD;&#x30FC;&#x30C8;&#x30C3;&#x30D7;&#x306B; META
&#x3068;&#x304B; ALT &#x3068;&#x304B; EDIT &#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#xFF09;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x3053;&#x3067;&#x3001;CONTROL &#x3068;&#x304B; META
&#x3068;&#x304B;&#x3092;&#x66F8;&#x304F;&#x4EE3;&#x308F;&#x308A;&#x306B;&#x3001;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306A;&#x8A18;&#x6CD5;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3055;&#x3089;&#x3063;&#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x3051;&#x3069;Emacs&#x306F;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3068;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x3092;&#x30B9;&#x30DE;&#x30DB;&#x306E;&#x89AA;&#x6307;&#x304F;&#x3089;&#x3044;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x300D;&#x300C;&#x5168;&#x90E8;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x307B;&#x3093;&#x3068;&#x306B;&#x305D;&#x308C;&#x304F;&#x3089;&#x3044;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x300D;  </p>
<p><br>  </p>
<pre><code>C-&lt;&#x6587;&#x5B57;&gt;   &#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x305F;&#x307E;&#x307E;&#x3001;&lt;&#x6587;&#x5B57;&gt;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;
          C-f &#x306F;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089; f &#x306E;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3059;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;
M-&lt;&#x6587;&#x5B57;&gt;   &#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x305F;&#x307E;&#x307E;&#x3001;&lt;&#x6587;&#x5B57;&gt;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x304C;&#x306A;
          &#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x30A8;&#x30B9;&#x30B1;&#x30FC;&#x30D7;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x3066;&#x304B;&#x3089;&#x96E2;&#x3057;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089;&lt;&#x6587;&#x5B57;&gt;&#x30AD;&#x30FC;
          &#x3092;&#x62BC;&#x3057;&#x307E;&#x3059;&#x3002;&#x4EE5;&#x964D;&#x30A8;&#x30B9;&#x30B1;&#x30FC;&#x30D7;&#x30AD;&#x30FC;&#x306E;&#x3053;&#x3068;&#x3092; &lt;ESC&gt; &#x3068;&#x66F8;&#x304D;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x6065;&#x305A;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x306F;&#x305A;&#x3063;&#x3068;Esc&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x304A;&#x308A;&#x307E;&#x3057;&#x305F;&#x300D;&#x300C;&#x672C;&#x5F53;&#x306B;&#x6065;&#x305A;&#x304B;&#x3057;&#x3044;&#x306A;&#x3002;&#x4E0D;&#x4FBF;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x5909;&#x63DB;&#x30AD;&#x30FC;&#x306B;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3066;&#x305F;&#x304B;&#x3089;&#x2026;&#x300D;&#x300C;&#x5272;&#x308A;&#x5F53;&#x3066;&#x308B;&#x300D;&#x300C;&#x5909;&#x63DB;&#x30AD;&#x30FC;&#x3092;Esc&#x30AD;&#x30FC;&#x306B;&#x3057;&#x3066;&#x4F7F;&#x3063;&#x3066;&#x305F;&#x3063;&#x3066;&#x3053;&#x3068;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;  </p>
<p><strong>C-f &#x306F;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089; f &#x306E;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3059;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;</strong>  </p>
<p>&#x300C;&#x307F;&#x3093;&#x306A;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x62BC;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#x306D;&#x3048;&#x300D;&#x300C;&#x541B;&#x306F;&#x3069;&#x3046;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x4ECA;&#x306F;&#x7121;&#x5909;&#x63DB;&#x30AD;&#x30FC;&#x306B;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3066;&#x307E;&#x3059;&#x300D;&#x300C;&#x3055;&#x3063;&#x304D;&#x306E;Esc&#x30AD;&#x30FC;&#x307F;&#x305F;&#x3044;&#x306B;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x300D;&#x300C;&#x305D;&#x3046;&#x3044;&#x3046;&#x30BD;&#x30D5;&#x30C8;&#x304C;&#x3042;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x6614;&#x306F;xmodmap&#x4F7F;&#x3063;&#x3066;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x4ECA;&#x306F;<a href="https://wiki.archlinux.jp/index.php/X_KeyBoard_extension" target="_blank">xkb</a>&#x304C;&#x3044;&#x3044;&#x307F;&#x305F;&#x3044;&#x3002;Windows&#x306F;ChgKey&#x3068;&#x304B;yamy&#x3068;&#x304B;&#x300D;  </p>
<p><br><br>&#x300C;&#x305D;&#x308C;&#x3058;&#x3083;&#x3042;M-x&#x3082;&#x5B66;&#x3093;&#x3060;&#x3053;&#x3068;&#x3060;&#x3057;&#x5C11;&#x3057;&#x5FDC;&#x7528;&#x3057;&#x3066;&#x307F;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;  </p>
<pre><code>M-x help-with-tutorial-spec-language
</code></pre><p>&#x300C;M-x&#x306E;&#x3042;&#x3068;&#x306F;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x7A7A;&#x767D;&#x304C;&#x3067;&#x304D;&#x308B;&#x304B;&#x3089;&#x6587;&#x5B57;&#x3060;&#x3051;&#x5165;&#x308C;&#x308C;&#x3070;&#x3044;&#x3044;&#x3088;&#x300D;&#x300C;C-f&#x306B;&#x6BD4;&#x3079;&#x308B;&#x3068;&#x968F;&#x5206;&#x9577;&#x3044;&#x306A;&#x300D;&#x300C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x6B63;&#x5F0F;&#x540D;&#x79F0;&#x307F;&#x305F;&#x3044;&#x306A;&#x3082;&#x306E;&#x3060;&#x306D;&#x3002;&#x5730;&#x56F3;&#x30A2;&#x30D7;&#x30EA;&#x3067;&#x4F4F;&#x6240;&#x304B;&#x3089;&#x63A2;&#x3059;&#x611F;&#x3058;&#x300D;  </p>
<blockquote>
<p>English<br>Thai<br>Korean<br>Japanese<br>Hebrew<br>Romanian<br>Slovak<br>Czech<br>Brazilian Portuguese<br>Swedish<br>Polish<br>Spanish<br>Slovenian<br>Italian<br>French<br>German<br>Dutch<br>Esperanto<br>ASCII<br>Russian<br>Chinese-GB18030<br>Chinese-GBK<br>Chinese-BIG5<br>Chinese-GB  </p>
</blockquote>
<p>&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x5404;&#x8A00;&#x8A9E;&#x7248;&#x4E00;&#x89A7;&#x3067;&#x3059;&#x300D;&#x300C;&#x30A8;&#x30B9;&#x30DA;&#x30E9;&#x30F3;&#x30C8;&#x7248;&#x307E;&#x3067;&#x3042;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x3059;&#x3054;&#x3044;&#x3088;&#x306D;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x304C;&#x56DB;&#x7A2E;&#x985E;&#x3042;&#x308B;&#x304C;&#x300D;&#x300C;&#x53F0;&#x6E7E;&#x306F;&#x7E41;&#x4F53;&#x5B57;&#x3060;&#x304B;&#x3089;BIG5&#x3067;&#x7C21;&#x4F53;&#x5B57;&#x306F;GB&#x3067;&#x59CB;&#x307E;&#x308B;&#x3084;&#x3064;&#x3002;&#x305F;&#x3057;&#x304B;GB18030&#x304C;&#x4E00;&#x756A;&#x65B0;&#x3057;&#x3044;&#x898F;&#x683C;&#x3060;&#x3063;&#x305F;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x8A73;&#x3057;&#x3044;&#x306A;&#x300D;&#x300C;&#x8ABF;&#x3079;&#x305F;&#x304B;&#x3089;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#xFF01;&#x91CD;&#x8981;&#xFF01;: Emacs&#x3092;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;C-x C-c &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x7248;&#x3060;&#x3068;&#x3053;&#x308C;&#x3060;&#x3051;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x82F1;&#x8A9E;&#x7248;&#x3060;&#x3068;&#x3053;&#x308C;&#x4EE5;&#x964D;&#x3082;&#x306A;&#x3093;&#x304B;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x300D;  </p>
<pre><code>To quit a partially entered command, type C-g.
To stop the tutorial, type C-x k, then &lt;Return&gt; at the prompt.
</code></pre><blockquote>
<p>&#x300C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x5165;&#x529B;&#x3092;&#x3084;&#x3081;&#x308B;&#x3068;&#x304D;&#x306F; C-g &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x4E2D;&#x65AD;&#x3059;&#x308B;&#x306B;&#x306F; C-x k &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#xFF0C;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x307E;&#x3059;&#x300D;  </p>
</blockquote>
<p>&#x300C;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x3068;&#x306F;&#x300D;&#x300C;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x53F3;&#x306B;&#x3042;&#x308B;&#x6298;&#x308C;&#x66F2;&#x304C;&#x3063;&#x305F;&#x77E2;&#x5370;&#x304C;&#x3064;&#x3044;&#x3066;&#x305F;&#x308A;&#x3059;&#x308B;&#x3067;&#x304B;&#x3044;&#x30AD;&#x30FC;&#x306E;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;Enter&#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x5834;&#x5408;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x30C3;&#x30BF;&#x30FC;&#x30F3;!&#x2026;&#x3067;&#x618E;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x30AD;&#x30FC;&#x3060;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x300D;&#x300C;&#x541B;&#x306F;&#x307B;&#x3068;&#x3093;&#x3069;&#x62BC;&#x3055;&#x306A;&#x3044;&#x3088;&#x3046;&#x3060;&#x304C;&#x300D;&#x300C;Emacs&#x3060;&#x3068;C-m&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x300D;&#x300C;&#x3080;&#x3057;&#x308D;&#x4E0D;&#x4FBF;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x7247;&#x624B;&#x3057;&#x304B;&#x4F7F;&#x3048;&#x306A;&#x3044;&#x3068;&#x304D;&#x3063;&#x3066;&#x3054;&#x306F;&#x3093;&#x98DF;&#x3079;&#x308B;&#x3068;&#x304D;&#x304F;&#x3089;&#x3044;&#x3057;&#x304B;&#x306A;&#x3044;&#x3057;&#x2026;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x3067;&#x3082;&#x4F7F;&#x3046;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;SKK&#x306F;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x306E;&#x304B;&#x308F;&#x308A;&#x306B;C-j&#x3092;&#x4F7F;&#x3046;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;&#x305D;&#x3053;&#x307E;&#x3067;&#x6392;&#x9664;&#x3057;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x7981;&#x6B62;&#x3063;&#x3066;&#x306A;&#x3093;&#x304B;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x3058;&#x3083;&#x3093;&#x300D;&#x300C;&#x2026;&#x541B;&#x306F;&#x524D;&#x304B;&#x3089;&#x305D;&#x3046;&#x3044;&#x3046;&#x3084;&#x3064;&#x3060;&#x3063;&#x305F;&#x306A;&#x300D;  </p>
<p><br>  </p>
<pre><code>&quot;&gt;&gt;&quot; &#x3067;&#x59CB;&#x307E;&#x308B;&#x884C;&#x306F;&#x3001;&#x305D;&#x306E;&#x6642;&#x4F55;&#x3092;&#x3059;&#x3079;&#x304D;&#x304B;&#x3092;&#x6307;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;




[&#x3053;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306E;&#x9014;&#x4E2D;&#x306E;&#x7A7A;&#x767D;&#x884C;&#x306F;&#x308F;&#x3056;&#x3068;&#x5165;&#x308C;&#x3066;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30AC;&#x30A4;&#x30C9;&#x306F;&#x4E0B;&#x306B;&#x7D9A;&#x304D;&#x307E;&#x3059;&#x3002;]




&gt;&gt;  &#x3067;&#x306F; C-v &#xFF08;&#x6B21;&#x306E;&#x753B;&#x9762;&#x3092;&#x898B;&#x308B;&#xFF09;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x6B21;&#x306E;&#x753B;&#x9762;&#x306B;&#x9032;&#x3093;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;
      &#xFF08;&#x3055;&#x3042;&#x3001;&#x3084;&#x3063;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089; v &#x3067;&#x3059;&#xFF09;
      &#x4EE5;&#x964D;&#x3001;&#x4E00;&#x753B;&#x9762;&#x3092;&#x8AAD;&#x307F;&#x7D42;&#x3048;&#x308B;&#x305F;&#x3073;&#x306B;&#x540C;&#x69D8;&#x306B;&#x3057;&#x3066;&#x6B21;&#x306E;&#x753B;&#x9762;&#x306B;&#x8AAD;&#x307F;&#x9032;&#x3093;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;

&#x524D;&#x306E;&#x753B;&#x9762;&#x3068;&#x6B21;&#x306E;&#x753B;&#x9762;&#x3068;&#x3067;&#x306F;&#x3001;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x5185;&#x5BB9;&#x306B;&#x4F55;&#x884C;&#x304B;&#x306E;&#x91CD;&#x306A;&#x308A;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;
&#x308C;&#x306F;&#x3001;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5185;&#x5BB9;&#x304C;&#x9023;&#x7D9A;&#x3057;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304C;&#x3059;&#x3050;&#x5224;&#x308B;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3053;&#x308C;&#x6700;&#x521D;&#x898B;&#x305F;&#x3068;&#x304D;&#x3073;&#x3063;&#x304F;&#x308A;&#x3057;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x3068;&#x304D;&#xFF0C;&#x7A7A;&#x767D;&#x884C;&#x306E;&#x9577;&#x3055;&#x304C;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x9AD8;&#x3055;&#x3067;&#x5909;&#x308F;&#x308B;&#x306E;&#x300D;  </p>
<p>&#x6CE8;: &#x3053;&#x306E;&#x5C0F;&#x8AAC;&#x3067;&#x306F;&#x5909;&#x308F;&#x308A;&#x307E;&#x305B;&#x3093;  </p>
<p>&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x3053;&#x308C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x898B;&#x305B;&#x304B;&#x3051;&#x305F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306A;&#x306E;&#x304B;&#x306A;&#x3002;&#x6016;&#x3044;&#x300D;&#x300C;&#x6016;&#x3044;&#xFF1F;&#x4F55;&#x304C;&#x300D;&#x300C;&#x8AAD;&#x3093;&#x3067;&#x308B;&#x9014;&#x4E2D;&#x3067;&#x300D;  </p>
<p><br><br><span style="font-size: 200%;">&#x6016;&#x3044;&#x753B;&#x50CF;</span>  </p>
<p><br><br>&#x300C;&#x3068;&#x304B;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x5ACC;&#x3060;&#x306A;&#x300D;  </p>
<p>&#x6CE8;: Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306F;&#x753B;&#x9762;&#x306B;&#x3042;&#x308F;&#x305B;&#x8ABF;&#x6574;&#x3055;&#x308C;&#x305F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3067;&#x3059;&#x3002;&#x5B89;&#x5FC3;&#x3057;&#x3066;&#x3054;&#x89A7;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;  </p>
<p><br>  </p>
<pre><code>This is a copy of the Emacs tutorial text, customized slightly for
you.  Later on we will instruct you to try various commands to alter
this text.  Don&apos;t worry if you change this text before we tell you to;
that is called &quot;editing&quot; and that&apos;s what Emacs is for.
</code></pre><blockquote>
<p>&#x3053;&#x308C;&#x306F;Emacs&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#xFF0C;&#x3042;&#x306A;&#x305F;&#x5411;&#x3051;&#x306B;&#x5C11;&#x3057;&#x8ABF;&#x6574;&#x3057;&#x305F;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x5F8C;&#x3067;&#xFF0C;&#x3053;&#x306E;&#x672C;&#x6587;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x69D8;&#x3005;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x8A66;&#x3059;&#x3088;&#x3046;&#x6307;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x304C;&#xFF0C;&#x305D;&#x306E;&#x524D;&#x306B;&#x672C;&#x6587;&#x3092;&#x5909;&#x3048;&#x3066;&#x3057;&#x307E;&#x3063;&#x3066;&#x3082;&#x69CB;&#x3044;&#x307E;&#x305B;&#x3093;&#x3002;&#x305D;&#x308C;&#x306F;&#x300C;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x300D;&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308A;&#xFF0C;Emacs&#x306F;&#x305D;&#x306E;&#x305F;&#x3081;&#x306B;&#x3042;&#x308B;&#x306E;&#x3067;&#x3059;  </p>
</blockquote>
<p><br>  </p>
<pre><code>&#x307E;&#x305A;&#x306F;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x4E2D;&#x3092;&#x79FB;&#x52D5;&#x3057;&#x3066;&#x884C;&#x304F;&#x65B9;&#x6CD5;&#x3092;&#x77E5;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;C-v &#x306B;&#x3088;&#x3063;
&#x3066;&#x6B21;&#x306E;&#x753B;&#x9762;&#x306B;&#x9032;&#x3080;&#x3053;&#x3068;&#x306F;&#x3082;&#x3046;&#x5224;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x524D;&#x306E;&#x753B;&#x9762;&#x306B;&#x623B;&#x308B;&#x306B;&#x306F;&#x3001;M-v &#xFF08;&#x30E1;&#x30BF;&#x30AD;&#x30FC;
&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089; v&#x3001;&#x3082;&#x3057;&#x304F;&#x306F; &lt;ESC&gt; &#x3092;&#x62BC;&#x3057;&#x3066;&#x96E2;&#x3057;&#x3066; v&#xFF09;&#x3067;&#x3059;&#x3002;

&gt;&gt; &#x4F55;&#x5EA6;&#x304B; M-v &#x3068; C-v &#x3092;&#x8A66;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;C-v&#x306F;&#x3057;&#x3087;&#x3063;&#x3061;&#x3085;&#x3046;&#x4F7F;&#x3046;&#x3051;&#x3069;M-v&#x306F;&#x307B;&#x3068;&#x3093;&#x3069;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x306A;&#x305C;&#x3060;&#x300D;&#x300C;Esc&#x3092;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x306B;&#x3057;&#x3066;&#x305F;&#x305B;&#x3044;&#x3067;&#x3044;&#x3061;&#x3044;&#x3061;&#x753B;&#x9762;&#x623B;&#x3059;&#x306E;&#x306B;&#x4E8C;&#x500B;&#x306E;&#x30AD;&#x30FC;&#x9806;&#x756A;&#x306B;&#x62BC;&#x3059;&#x306E;&#x304C;&#x9762;&#x5012;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x300D;&#x300C;&#x2026;Alt&#x304C;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x306A;&#x306E;&#x3092;&#x77E5;&#x3063;&#x3066;&#x3044;&#x305F;&#x3089;&#x826F;&#x304B;&#x3063;&#x305F;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x3053;&#x308C;&#x304B;&#x3089;&#x4F7F;&#x3046;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x982D;&#x306E;&#x56DE;&#x8DEF;&#x304C;&#x5909;&#x308F;&#x308B;&#x304F;&#x3089;&#x3044;&#x4F7F;&#x3048;&#x3070;&#x3044;&#x305A;&#x308C;&#x306F;&#x300D;&#x300C;&#x65E9;&#x304F;&#x305D;&#x3046;&#x306A;&#x308B;&#x3068;&#x3044;&#x3044;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;  </p>
<p><br>  </p>
<pre><code>It is ok to scroll this text in other ways, if you know how.
</code></pre><blockquote>
<p>&#x3053;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x9032;&#x3081;&#x308B;&#x4ED6;&#x306E;&#x65B9;&#x6CD5;&#x3092;&#x77E5;&#x3063;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x3082;&#x3044;&#x3044;&#x3067;&#x3059;&#x3088;  </p>
</blockquote>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="02.html" class="navigation navigation-prev " aria-label="Previous page: 02 - 監獄からの脱出">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="04.html" class="navigation navigation-next " aria-label="Next page: 04 - Go! Go! Go!">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"03 - 偽装テキスト","level":"3.1","depth":1,"next":{"title":"04 - Go! Go! Go!","level":"3.2","depth":1,"path":"04.md","ref":"04.md","articles":[]},"previous":{"title":"02 - 監獄からの脱出","level":"2.2","depth":1,"path":"02.md","ref":"02.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"03.md","mtime":"2018-08-14T11:00:36.929Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-16T08:40:07.592Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

