
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>04 - Go! Go! Go! · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05.html" />
    
    
    <link rel="prev" href="03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >04 - Go! Go! Go!</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="04---go-go-go">04 - Go! Go! Go!</h1>
<pre><code>&#xFF0A;&#x3053;&#x3053;&#x307E;&#x3067;&#x306E;&#x8981;&#x7D04;
================

   &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x753B;&#x9762;&#x6BCE;&#x306B;&#x898B;&#x3066;&#x884C;&#x304F;&#x306B;&#x306F;&#x3001;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;

   C-v     &#x6B21;&#x306E;&#x753B;&#x9762;&#x306B;&#x9032;&#x3080;
   M-v     &#x524D;&#x306E;&#x753B;&#x9762;&#x306B;&#x623B;&#x308B;
   C-l     &#x753B;&#x9762;&#x3092;&#x66F8;&#x304D;&#x76F4;&#x3059;&#x3002;&#x3053;&#x306E;&#x3068;&#x304D;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306E;&#x3042;&#x308B;&#x884C;&#x304C;&#x753B;&#x9762;&#x306E;&#x4E2D;&#x592E;&#x306B;
           &#x304F;&#x308B;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3002;&#xFF08;C-1 &#x3058;&#x3083;&#x306A;&#x304F;&#x3063;&#x3066; C-L &#x3067;&#x3059;&#x3088;&#xFF01;&#xFF09;

&gt;&gt; &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x898B;&#x3064;&#x3051;&#x3001;&#x305D;&#x306E;&#x8FD1;&#x304F;&#x306B;&#x3069;&#x3093;&#x306A;&#x6587;&#x7AE0;&#x304C;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x304B;&#x3092;&#x899A;&#x3048;&#x3001;
   &#x305D;&#x308C;&#x304B;&#x3089; C-l &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x3069;&#x3053;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x305F;&#x304B;&#x3001;&#x305D;&#x306E;&#x8FD1;&#x304F;&#x306E;&#x6587;&#x7AE0;&#x306F;&#x3069;&#x3046;&#x306A;&#x3063;&#x305F;&#x304B;&#x3092;&#x8ABF;&#x3079;
   &#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   &#x3082;&#x3046;&#x4E00;&#x5EA6; C-l &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x4ECA;&#x898B;&#x3066;&#x3044;&#x305F;&#x6587;&#x7AE0;&#x306F;&#x753B;&#x9762;&#x306E;&#x4E0A;&#x7AEF;&#x306B;&#x79FB;
   &#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;
   &#x305D;&#x3057;&#x3066;&#x3001;&#x3082;&#x3046;&#x4E00;&#x5EA6; C-l &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x4ECA;&#x5EA6;&#x306F;&#x305D;&#x306E;&#x6587;&#x7AE0;&#x304C;&#x753B;&#x9762;&#x306E;
   &#x4E0B;&#x7AEF;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;

&#x3082;&#x3057;&#x3042;&#x306A;&#x305F;&#x306E;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306B; PageUp &#x3084; PageDn &#x30AD;&#x30FC;&#x304C;&#x3042;&#x308B;&#x306A;&#x3089;&#x3001;&#x305D;&#x308C;&#x3089;&#x3082;&#x753B;&#x9762;
&#x3092;&#x79FB;&#x52D5;&#x3059;&#x308B;&#x306E;&#x306B;&#x4F7F;&#x3048;&#x307E;&#x3059;&#x3002;&#x3067;&#x3082;&#x3001;C-v &#x3084; M-v &#x3092;&#x4F7F;&#x3046;&#x65B9;&#x304C;&#x52B9;&#x7387;&#x7684;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&quot;&gt;&gt;&quot; &#x306E;&#x8A18;&#x53F7;&#x304C;&#x3042;&#x308B;&#x3068;&#x304D;&#x306F;&#x300E;&#x3084;&#x3063;&#x3066;&#x307F;&#x3088;&#x3046;&#x300F;&#x306E;&#x5408;&#x56F3;&#x306D;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x3075;&#x3064;&#x3046;&#x306F;C-l&#x3092;&#x62BC;&#x3059;&#x3068;&#x300E;&#x753B;&#x9762;&#x4E2D;&#x592E;&#x2192;&#x4E0A;&#x2192;&#x4E0B;&#x300F;&#x306B;&#x3046;&#x3064;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;gnupack&#x3060;&#x3068;&#x78BA;&#x304B;&#x4E0A;&#x4E0B;&#x306B;&#x3046;&#x3064;&#x308B;&#x3088;&#x3046;&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x307E;&#x3059;&#x300D;  </p>
<blockquote>
<p>C-1 &#x3058;&#x3083;&#x306A;&#x304F;&#x3063;&#x3066; C-L &#x3067;&#x3059;&#x3088;&#xFF01;  </p>
</blockquote>
<p>&#x300C;&#x3075;&#x3080;&#x3002;&#x3068;&#x3053;&#x308D;&#x3067;&#x306A;&#x305C;&#x3044;&#x304D;&#x306A;&#x308A;&#x524D;&#x56DE;&#x306E;&#x8981;&#x7D04;&#x306A;&#x3093;&#x3060;&#xFF1F;&#x305D;&#x3046;&#x3044;&#x3046;&#x306E;&#x306F;&#x524D;&#x56DE;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x3084;&#x308B;&#x3079;&#x304D;&#x3060;&#x3068;&#x601D;&#x3046;&#x3093;&#x3060;&#x304C;&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3063;&#x300D;&#x79C1;&#x306F;&#x52DD;&#x3061;&#x8A87;&#x3063;&#x305F;&#x9854;&#x3092;&#x3057;&#x305F;&#x3002;&#x300C;&#x541B;&#x306F;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3060;&#x304B;&#x3089;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x3068;&#x601D;&#x3046;&#x3051;&#x3069;&#xFF0C;&#x4EBA;&#x9593;&#x306F;&#x5FD8;&#x308C;&#x3084;&#x3059;&#x3044;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x65B0;&#x3057;&#x3044;&#x3053;&#x3068;&#x52C9;&#x5F37;&#x3059;&#x308B;&#x524D;&#x306B;&#x5FA9;&#x7FD2;&#x3057;&#x306A;&#x3044;&#x3068;&#x5FD8;&#x308C;&#x3061;&#x3083;&#x3046;&#x306E;&#x3002;&#x5FA9;&#x7FD2;&#x5927;&#x4E8B;&#x3002;&#x308F;&#x304B;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x308F;&#x304B;&#x3063;&#x305F;&#x3053;&#x3068;&#x306B;&#x3057;&#x3066;&#x304A;&#x3053;&#x3046;&#x300D;&#x300C;&#x65AD;&#x3058;&#x3066;&#x524D;&#x306E;&#x5206;&#x91CF;&#x304C;&#x591A;&#x3044;&#x304B;&#x3089;&#x6301;&#x3061;&#x8D8A;&#x3057;&#x305F;&#x308F;&#x3051;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3089;&#x306D;&#x300D;&#x300C;&#x5999;&#x306B;&#x8A00;&#x3044;&#x8A33;&#x304C;&#x307E;&#x3057;&#x304F;&#x805E;&#x3053;&#x3048;&#x308B;&#x304C;&#x3002;&#x307E;&#x3042;&#x3044;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#xFF0C;&#x8981;&#x7D04;&#x3063;&#x3066;summary&#x306E;&#x8A33;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#x3055;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x898B;&#x3066;&#x305F;&#x3089;&#xFF0C;&#x8981;&#x7D04;&#x306E;&#x3053;&#x3068;&#x5C0F;&#x7D50; (&#x5C0F;&#x7ED3;) &#x3063;&#x3066;&#x3044;&#x3046;&#x3093;&#x3060;&#x3063;&#x3066;&#x3002;&#x9762;&#x767D;&#x3044;&#x306D;&#x300D;&#x300C;&#x2026;&#x305D;&#x308C;&#x4ECA;&#x5FC5;&#x8981;&#x306A;&#x3053;&#x3068;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x9762;&#x767D;&#x3044;&#x306D;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x4ECA;&#x5FC5;&#x8981;&#x306A;&#x300D;&#x300C;&#x4ECA;&#x7D0D;&#x5F97;&#x3057;&#x3066;&#x304F;&#x308C;&#x306A;&#x3044;&#x3068;&#x3053;&#x308C;&#x304B;&#x3089;&#x4E8B;&#x3042;&#x308B;&#x3054;&#x3068;&#x306B;summary&#x306F;&#x5C0F;&#x7D50;&#x306A;&#x3093;&#x3060;&#x3063;&#x3066;&#x8A00;&#x3046;&#x3088;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x305D;&#x308C;&#x3067;&#x3082;&#x3044;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x304D;&#xFF0C;&#x8208;&#x5473;&#x6DF1;&#x3044;&#x3053;&#x3068;&#x3060;&#x306A;&#x3002;&#x5B9F;&#x306B;&#x300D;&#x300C;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x306E;&#x57FA;&#x672C;
========================

&#x753B;&#x9762;&#x6BCE;&#x306E;&#x79FB;&#x52D5;&#x306F;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x4ECA;&#x5EA6;&#x306F;&#x3001;&#x753B;&#x9762;&#x306E;&#x4E2D;&#x3067;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x5834;&#x6240;&#x306B;
&#x79FB;&#x52D5;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x65B9;&#x6CD5;&#x3092;&#x61B6;&#x3048;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;&#x3088;&#x3046;&#x3084;&#x304F;&#x79FB;&#x52D5;&#x304B;&#x300D;EeePC&#x304C;&#x6E9C;&#x3081;&#x606F;&#x3092;&#x3064;&#x304F;&#x3088;&#x3046;&#x306B;&#x8A00;&#x3046;&#x3002;&#x300C;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30E9;&#x306E;&#x6E96;&#x5099;&#x306F;&#x3044;&#x3044;&#xFF1F;&#x300D;&#x6C17;&#x5408;&#x3092;&#x5165;&#x308C;&#x308B;&#x79C1;&#x3002;&#x300C;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30E9;&#xFF1F;&#x300D;&#x300C;&#x30AA;&#x30FC;&#x30D7;&#x30CB;&#x30F3;&#x30B0;&#x30E0;&#x30FC;&#x30D3;&#x30FC;&#x7D42;&#x308F;&#x3063;&#x3066;&#x3053;&#x308C;&#x304B;&#x3089;&#x5192;&#x967A;&#x304C;&#x306F;&#x3058;&#x307E;&#x308B;&#x3068;&#x3053;&#x308D;&#x3060;&#x3088;!&#x300D;&#x300C;&#x2026;&#x304A;&#xFF0C;&#x304A;&#x3046;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x3053;&#x308C;&#x306B;&#x306F;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x3084;&#x308A;&#x65B9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x3001;&#x624B;
    &#x3092;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x4E0A;&#x306E;&#x6A19;&#x6E96;&#x4F4D;&#x7F6E;&#x304B;&#x3089;&#x5927;&#x304D;&#x304F;&#x52D5;&#x304B;&#x3055;&#x305A;&#x306B;&#x3001; C-p&#x3001;C-b&#x3001;C-f&#x3001;C-n &#x3092;&#x4F7F;
    &#x3046;&#x65B9;&#x304C;&#x52B9;&#x7387;&#x7684;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306F;&#xFF14;&#x3064;&#x306E;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3068;&#x540C;&#x3058;&#x50CD;&#x304D;&#x3092;&#x3057;&#x307E;&#x3059;&#x3002;&#x56F3;&#x3067;&#x66F8;&#x3051;&#x3070;&#x3001;
    &#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;
</code></pre><p><br><br><img src="images/dcursor.png" alt="diamond cursor">  </p>
<p>&#x300C;&#x610F;&#x6C17;&#x63DA;&#x3005;&#x3068;&#x306E;&#x308A;&#x3053;&#x3093;&#x3060;&#x7D50;&#x679C;&#x304C;&#x3053;&#x308C;&#x3067;&#x3059;&#x300D;&#x300C;&#x304A;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x3053;&#x308C;&#x521D;&#x3081;&#x3066;&#x898B;&#x305F;&#x3068;&#x304D;&#x306B;&#x300E;&#x3046;&#x308F;&#x3041;&#x2026;&#x3081;&#x3093;&#x3069;&#x304F;&#x305B;&#x3047;&#x2026;&#x300F;&#x3063;&#x3066;&#x601D;&#x308F;&#x306A;&#x3044;&#x4EBA;&#x304C;&#x3044;&#x305F;&#x3089;&#x3059;&#x3054;&#x3044;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x305D;&#x3046;&#x304B;&#x300D;&#x300C;&#x79C1;&#x304C;&#x3044;&#x307E;&#x898B;&#x3066;&#x3082;&#x601D;&#x3046;&#x3082;&#x3093;&#x300D;&#x300C;&#x305D;&#x3093;&#x306A;&#x6163;&#x308C;&#x306A;&#x3044;&#x3082;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x8EAB;&#x4F53;&#x306E;&#x52D5;&#x304B;&#x3057;&#x65B9;&#x3092;&#x6587;&#x7AE0;&#x3067;&#x8AAC;&#x660E;&#x3055;&#x308C;&#x3066;&#x308B;&#x611F;&#x3058;&#x3002;&#x3075;&#x3060;&#x3093;&#x610F;&#x8B58;&#x3057;&#x3066;&#x306A;&#x3044;&#x3076;&#x3093;&#x5FD8;&#x308C;&#x308B;&#x3068;&#x5168;&#x7136;&#x3067;&#x304D;&#x306A;&#x304F;&#x306A;&#x308B;&#x300D;&#x300C;&#x305F;&#x3068;&#x3048;&#x3070;&#xFF1F;&#x300D;&#x300C;&#x58F0;&#x306E;&#x51FA;&#x3057;&#x65B9;&#x3068;&#x304B;&#x3002;&#x3072;&#x3069;&#x3044;&#x3081;&#x306B;&#x3042;&#x3063;&#x305F;&#x30B7;&#x30E7;&#x30C3;&#x30AF;&#x3067;&#x5FD8;&#x308C;&#x3061;&#x3083;&#x3046;&#x306E;&#x300D;  </p>
<p>&#x300C;&#x5FC3;&#x914D;&#x3059;&#x308B;&#x306A;&#x300D;&#x300C;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308C;&#x3092;&#x52A9;&#x3051;&#x308B;&#x305F;&#x3081;&#x306B;&#x79C1;&#x305F;&#x3061;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x304C;&#x3044;&#x308B;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x56F0;&#x3063;&#x305F;&#x3068;&#x304D;&#x306B;&#x306F;&#x3044;&#x3064;&#x3067;&#x3082;&#x547C;&#x3093;&#x3067;&#x304F;&#x308C;&#x3002;&#x3067;&#x304D;&#x308B;&#x304B;&#x304E;&#x308A;&#x541B;&#x3092;&#x52A9;&#x3051;&#x3088;&#x3046;&#x300D;&#x300C;&#x2026;&#x3042;&#x308A;&#x304C;&#x3068;&#x300D;  </p>
<p>&#x6CE8;: Emacs&#x306B;&#x306F;<a href="http://git.savannah.gnu.org/cgit/emacs.git/tree/lisp/play/doctor.el" target="_blank">30&#x5E74;&#x4EE5;&#x4E0A;&#x306E;&#x30AD;&#x30E3;&#x30EA;&#x30A2;</a> (?) &#x3092;&#x3082;&#x3064;<a href="https://ja.wikipedia.org/wiki/ELIZA" target="_blank">&#x30C9;&#x30AF;&#x30BF;&#x30FC;</a>&#x304C;&#x5E38;&#x52E4;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002; <code>M-x doctor</code> &#x3067;&#x3044;&#x3064;&#x3067;&#x3082;&#x547C;&#x3073;&#x51FA;&#x305B;&#x307E;&#x3059;&#x304C;&#xFF0C;&#x30C9;&#x30AF;&#x30BF;&#x30FC;&#x306F;&#x82F1;&#x8A9E;&#x3057;&#x304B;&#x8A71;&#x305B;&#x307E;&#x305B;&#x3093;&#x3002;&#x3054;&#x6CE8;&#x610F;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;  </p>
<p><br>  </p>
<pre><code>&gt;&gt; C-n &#x3068; C-p &#x3067;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x4E0A;&#x56F3;&#x306E;&#x771F;&#x4E2D;&#x306E;&#x884C;&#x306B;&#x52D5;&#x304B;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x305D;&#x308C;&#x304B;&#x3089; C-l
   &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x56F3;&#x306E;&#x5168;&#x4F53;&#x304C;&#x753B;&#x9762;&#x4E2D;&#x592E;&#x306B;&#x304F;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

&#x3053;&#x308C;&#x3089;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x3001;Previous, Next, Backward, Forward &#x306E;&#x982D;&#x6587;&#x5B57;
&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;&#x61B6;&#x3048;&#x3084;&#x3059;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x3053;&#x308C;&#x3089;&#x306F;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x306E;&#x57FA;&#x672C;&#x30B3;&#x30DE;
&#x30F3;&#x30C9;&#x3067;&#x3042;&#x308A;&#x3001;&#x983B;&#x7E41;&#x306B;&#x4F7F;&#x3046;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;

&gt;&gt; C-n &#x3092;&#x4F55;&#x56DE;&#x304B;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3001;&#x3053;&#x306E;&#x884C;&#x307E;&#x3067;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;C-n C-p&#x306F;&#x79C1;&#x3082;&#x3059;&#x3054;&#x304F;&#x4F7F;&#x3046;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x6A2A;&#x66F8;&#x304D;&#x306E;&#x6587;&#x7AE0;&#x306F;&#x753B;&#x9762;&#x304C;&#x4E0A;&#x4E0B;&#x306B;&#x9032;&#x3080;&#x304B;&#x3089;&#xFF0C;&#x6700;&#x521D;&#x306F;C-n&#x3068;C-p&#x306B;&#x6163;&#x308C;&#x3066;&#x304A;&#x304F;&#x3068;&#x3044;&#x3044;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x306A;&#x300D;&#x300C;&#x3067;&#x3082;&#x79C1;&#x306F;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3082;&#x4F7F;&#x3046;&#x3002;<a href="https://k-tai.watch.impress.co.jp/docs/column/stapa/730357.html" target="_blank">&#x30B9;&#x30BF;&#x30D1;&#x9F4B;&#x85E4;&#x3082;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x30AD;&#x30FC;&#x4F7F;&#x3044;&#x307E;&#x304F;&#x308B;</a>&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x3055;&#x3063;&#x304D;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x306E;&#x304C;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x3063;&#x3066;&#x8A00;&#x3063;&#x305F;&#x3070;&#x304B;&#x308A;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x30DD;&#x30EA;&#x30B7;&#x30FC;&#x304C;&#x3042;&#x308C;&#x3070;&#x3044;&#x3044;&#x306E;&#x3002; <strong>&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x304C;&#x3064;&#x3044;&#x3066;&#x3044;&#x308B;&#x304B;&#x3089;&#x300E;&#x3042;&#x3048;&#x3066;&#x300F;HHKB Pro&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;Lite2&#x3092;&#x8CB7;&#x3046;</strong> &#x3068;&#x304B;&#xFF0C; <a href="https://www.careertrek.com/daily/shukan-matz/" target="_blank"><strong>&#x82F1;&#x5B57;&#x914D;&#x5217;&#x3060;&#x3068;&#x30AD;&#x30FC;&#x306E;&#x6570;&#x304C;&#x8DB3;&#x308A;&#x306A;&#x3044;&#x304B;&#x3089;JIS&#x914D;&#x5217;&#x306E;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3092;&#x82F1;&#x5B57;&#x914D;&#x5217;&#x306B;&#x3057;&#x3066;&#x4F7F;&#x3046;</strong></a> &#x3068;&#x304B;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>&gt;&gt; C-f &#x3092;&#x4F7F;&#x3063;&#x3066;&#x884C;&#x306E;&#x4E2D;&#x307B;&#x3069;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;C-p &#x3067;&#x4F55;&#x884C;&#x304B;&#x4E0A;&#x306B;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306E;&#x4F4D;&#x7F6E;&#x306E;&#x5909;&#x5316;&#x306B;&#x6CE8;&#x610F;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;

&#x5404;&#x884C;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x306F;&#xFF08;&#x76EE;&#x306B;&#x306F;&#x898B;&#x3048;&#x306A;&#x3044;&#xFF09; Newline &#x6587;&#x5B57;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x6B21;&#x306E;&#x884C;
&#x3068;&#x306E;&#x533A;&#x5207;&#x308A;&#x3092;&#x793A;&#x3059;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;&#x666E;&#x901A;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x6700;&#x5F8C;&#x306E;&#x884C;&#x306B;&#x3082; Newline &#x3092;&#x4ED8;&#x3051;
&#x308B;&#x3079;&#x304D;&#x3067;&#x3059;&#xFF08;&#x3082;&#x3063;&#x3068;&#x3082; Emacs &#x306F;&#x305D;&#x308C;&#x3092;&#x5F37;&#x5236;&#x306F;&#x3057;&#x307E;&#x305B;&#x3093;&#x304C;&#xFF09;&#x3002;
</code></pre><p>&#x300C;Newline&#x6587;&#x5B57;&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x51E6;&#x7406;&#x3057;&#x305F;&#x3053;&#x3068;&#x3042;&#x308B;&#x4EBA;&#x306A;&#x3089; &quot;\n&quot; &#x3068;&#x304B; &quot;\r\n&quot; &#x3067;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;Word&#x3092;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x4EBA;&#x306B;&#x306F;&#x300E;&#x884C;&#x672B;&#x306B;&#x3042;&#x308B;&#x66F2;&#x304C;&#x3063;&#x305F;&#x77E2;&#x5370;&#x306E;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x300F;&#x3068;&#x3044;&#x3046;&#x3068;&#x4F1D;&#x308F;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x300D;&#x300C;&#x305D;&#x3046;&#x304B;&#x300D;&#x300C;&#x541B;&#x3082;&#x6614;&#x306F;Word&#x306E;&#x304A;&#x4E16;&#x8A71;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x305F;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x305A;&#x3044;&#x3076;&#x3093;&#x9060;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#xFF0C;Git&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x672B;&#x5C3E;&#x306B;&#x6539;&#x884C;&#x5165;&#x308C;&#x306A;&#x3044;&#x3068;&#x8B66;&#x544A;&#x304C;&#x51FA;&#x308B;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x3053;&#x3053;&#x3067;&#x3082;&#x300E;&#x4ED8;&#x3051;&#x308B;&#x3079;&#x304D;&#x3067;&#x3059;&#x300F;&#x3063;&#x3066;&#x66F8;&#x304B;&#x308C;&#x3066;&#x308B;&#x304B;&#x3089;&#xFF0C;&#x306A;&#x3093;&#x3067;&#x305D;&#x3046;&#x306A;&#x306E;&#x304B;&#x8ABF;&#x3079;&#x305F;&#x300D;&#x300C;&#x306A;&#x305C;&#x3060;&#xFF1F;&#x300D;&#x300C;<a href="https://stackoverflow.com/questions/729692/why-should-text-files-end-with-a-newline" target="_blank">POSIX&#x306E;&#x30EB;&#x30FC;&#x30EB;</a>&#x3067;&#x6C7A;&#x307E;&#x3063;&#x3066;&#x308B;&#x3089;&#x3057;&#x3044;&#x300D;&#x300C;POSIX&#x300D;&#x300C;UNIX&#x306E;&#x4ED5;&#x69D8;&#x3092;&#x6C7A;&#x3081;&#x3066;&#x308B;&#x3068;&#x3053;&#x308D;&#x300D;&#x300C;UNIX&#x300D;&#x300C;Windows&#x4EE5;&#x5916;&#x300D;&#x300C;&#x305D;&#x306E;&#x5B9A;&#x7FA9;&#x306F;&#x6B63;&#x78BA;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;iOS&#x306F;UNIX&#x30D9;&#x30FC;&#x30B9;&#x3060;&#x3057;&#xFF0C;Android&#x306F;Linux&#x30D9;&#x30FC;&#x30B9;&#x3060;&#x3057;&#xFF0C;Linux&#x306F;POSIX&#x6E96;&#x62E0;&#x3060;&#x3057;&#x300D;&#x300C;TRON&#x304C;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;FreeDOS&#x3084;Haiku&#x3082;&#x3042;&#x308B;&#x300D;&#x300C;&#x8D85;&#x6F22;&#x5B57;&#x3067;<a href="https://ja.wikipedia.org/wiki/%E3%83%88%E3%83%B3%E3%83%91%E6%96%87%E5%AD%97" target="_blank">&#x30C8;&#x30F3;&#x30D1;&#x6587;&#x5B57;</a>&#x89E6;&#x3063;&#x3066;&#x307F;&#x305F;&#x3044;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;  </p>
<blockquote>
<p><a href="http://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap03.html#tag_03_206" target="_blank">3.206 Line<br>      A sequence of zero or more non- <newline> characters plus a terminating <newline> character.</newline></newline></a>  </p>
</blockquote>
<p><br>  </p>
<pre><code>&gt;&gt; &#x884C;&#x306E;&#x5148;&#x982D;&#x3067; C-b &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306F;&#x524D;&#x306E;&#x884C;&#x306E;&#x672B;&#x5C3E;&#x306B;&#x79FB;&#x52D5;
   &#x3059;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F; C-b &#x304C;&#x524D;&#x306E; Newline &#x6587;&#x5B57;&#x3092;&#x8D8A;&#x3048;&#x3066;&#x623B;&#x3063;&#x305F;&#x304B;&#x3089;&#x3067;&#x3059;&#x3002;

&#x540C;&#x69D8;&#x306B; C-f &#x306F;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092; Newline &#x6587;&#x5B57;&#x3092;&#x8D8A;&#x3048;&#x3066;&#x6B21;&#x306B;&#x9032;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x3055;&#x3089;&#x306B;&#x3082;&#x3046;&#x5C11;&#x3057; C-b &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x306E;&#x611F;&#x3058;&#x3092;&#x628A;&#x3093;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x4ECA;&#x5EA6;&#x306F; C-f &#x3067;&#x884C;&#x672B;&#x307E;&#x3067;&#x9032;&#x3093;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x3055;&#x3089;&#x306B;&#x3082;&#x3046;&#x4E00;&#x5EA6; C-f &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x6B21;&#x306E;&#x884C;&#x306B;&#x9032;&#x3093;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x306A;&#x3093;&#x304B;&#x4E16;&#x9593;&#x8A71;&#x3070;&#x3063;&#x304B;&#x3057;&#x3066;&#x308B;&#x304B;&#x3089;&#x5168;&#x7136;&#x9032;&#x307E;&#x306A;&#x3044;&#x306D;&#x300D;&#x300C;&#x4ECA;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x306A;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x307E;&#x3060;&#x4E00;&#x5272;&#x304F;&#x3089;&#x3044;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x6C17;&#x697D;&#x306B;&#x3044;&#x3053;&#x3046;&#x3063;&#x3066;&#x884C;&#x3063;&#x305F;&#x306E;&#x306F;&#x541B;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x305D;&#x3046;&#x3060;&#x304C;&#x300D;&#x300C;&#x79C1;&#x304C;&#x98FD;&#x304D;&#x305F;&#x3089;&#x305F;&#x3060;&#x306E;&#x30B3;&#x30D4;&#x30DA;&#x306B;&#x306A;&#x308B;&#x3088;&#x3002;&#x305D;&#x308C;&#x3067;&#x3082;&#x3044;&#x3044;&#x306E;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x9000;&#x5C48;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;&#x300C;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x3058;&#x3083;&#x3042;&#x3082;&#x3063;&#x3068;&#x5FDC;&#x63F4;&#x3057;&#x3066;&#x3088;&#x300D;&#x300C;&#x5584;&#x51E6;&#x3059;&#x308B;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03.html" class="navigation navigation-prev " aria-label="Previous page: 03 - 偽装テキスト">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05.html" class="navigation navigation-next " aria-label="Next page: 05 - Move! Move! Move!">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"04 - Go! Go! Go!","level":"3.2","depth":1,"next":{"title":"05 - Move! Move! Move!","level":"3.3","depth":1,"path":"05.md","ref":"05.md","articles":[]},"previous":{"title":"03 - 偽装テキスト","level":"3.1","depth":1,"path":"03.md","ref":"03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"04.md","mtime":"2018-08-14T11:00:43.837Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T09:17:13.044Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

