
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>05 - Move! Move! Move! · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="06.html" />
    
    
    <link rel="prev" href="04.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >05 - Move! Move! Move!</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="05---move-move-move">05 - Move! Move! Move!</h1>
<pre><code>&#x753B;&#x9762;&#x306E;&#x5148;&#x982D;&#x3084;&#x672B;&#x5C3E;&#x3092;&#x8D8A;&#x3048;&#x3066;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x65B9;&#x5411;&#x306B;&#x3042;&#x308B;
&#x6587;&#x7AE0;&#x304C;&#x753B;&#x9762;&#x306E;&#x4E2D;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3066;&#x6765;&#x3066;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3092;&#x300C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x300D;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;&#x753B;&#x9762;
&#x304C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x3066;&#x3082;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306F;&#x5E38;&#x306B;&#x753B;
&#x9762;&#x5185;&#x306B;&#x3042;&#x308B;&#x3088;&#x3046;&#x306B;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-n &#x3092;&#x4F7F;&#x3063;&#x3066;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x753B;&#x9762;&#x306E;&#x4E0B;&#x7AEF;&#x3088;&#x308A;&#x4E0B;&#x306B;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x3066;&#x307F;&#x306A;&#x3055;&#x3044;&#x3002;&#x4F55;
   &#x304C;&#x8D77;&#x3053;&#x308A;&#x307E;&#x3057;&#x305F;&#x304B;&#xFF1F;
</code></pre><p>&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x7248;&#x3068;&#x304B;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x3060;&#x3068;&#x3053;&#x3053;&#x3067;&#x521D;&#x3081;&#x3066;&#x300E;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x300F;&#x3063;&#x3066;&#x8A00;&#x8449;&#x304C;&#x51FA;&#x3066;&#x304F;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x82F1;&#x8A9E;&#x7248;&#x306F;&#x811A;&#x6CE8;&#x307F;&#x305F;&#x3044;&#x306A;&#x5F62;&#x3067;&#x3082;&#x3063;&#x3068;&#x524D;&#x306B;&#x51FA;&#x3066;&#x304F;&#x308B; (<a href="https://jamcha-aa.github.io/Emacs-tutorial/03.html" target="_blank">&#x672C;&#x7DE8;03&#x6587;&#x672B;&#x3092;&#x53C2;&#x7167;</a>)&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x305F;&#x3076;&#x3093;&#x5C11;&#x3057;&#x77E5;&#x8B58;&#x3042;&#x308B;&#x4EBA;&#x306B;&#x5411;&#x3051;&#x305F;&#x6CE8;&#x610F;&#x66F8;&#x304D;&#x307F;&#x305F;&#x3044;&#x306A;&#x3082;&#x306E;&#x3060;&#x3068;&#x601D;&#x3046;&#x3002;&#x300E;&#x3067;&#x304D;&#x308B;&#x3084;&#x3064;&#x306F;&#x3069;&#x3093;&#x3069;&#x3093;&#x5148;&#x306B;&#x9032;&#x3081;!&#x300F;&#x3063;&#x3066;&#x611F;&#x3058;&#xFF1F;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x4E00;&#x6587;&#x5B57;&#x5358;&#x4F4D;&#x306E;&#x79FB;&#x52D5;&#x3067;&#x306F;&#x307E;&#x3069;&#x308D;&#x3063;&#x3053;&#x3057;&#x3044;&#x306A;&#x3089;&#x3001;&#x5358;&#x8A9E;&#x5358;&#x4F4D;&#x3067;&#x79FB;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;
&#x3059;&#x3002;M-f (&lt;ESC&gt; f) &#x3067;&#x4E00;&#x5358;&#x8A9E;&#x5148;&#x3078;&#x3001;M-b (&lt;ESC&gt; b) &#x3067;&#x4E00;&#x5358;&#x8A9E;&#x524D;&#x3078;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;

&#x6CE8;&#x610F;&#xFF1A;      &#x65E5;&#x672C;&#x8A9E;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x5358;&#x8A9E;&#x306E;&#x5207;&#x308C;&#x76EE;&#x3092;&#x8A8D;&#x8B58;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x7591;
        &#x4F3C;&#x7684;&#x306A;&#x6587;&#x7BC0;&#x3092;&#x5358;&#x8A9E;&#x306E;&#x5207;&#x308C;&#x76EE;&#x3068;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;

&gt;&gt; M-f &#x3084; M-b &#x3092;&#x4F55;&#x56DE;&#x304B;&#x8A66;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

&#x5358;&#x8A9E;&#x306E;&#x4E2D;&#x7A0B;&#x306B;&#x3044;&#x308B;&#x6642;&#x306F;&#x3001;M-f &#x306F;&#x305D;&#x306E;&#x5358;&#x8A9E;&#x306E;&#x7D42;&#x308F;&#x308A;&#x307E;&#x3067;&#x9032;&#x307F;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x5358;&#x8A9E;&#x9593;&#x306E;
&#x7A7A;&#x767D;&#x306B;&#x3044;&#x308B;&#x6642;&#x306B;&#x306F; M-f &#x306F;&#x6B21;&#x306E;&#x5358;&#x8A9E;&#x306E;&#x7D42;&#x308F;&#x308A;&#x307E;&#x3067;&#x9032;&#x307F;&#x307E;&#x3059;&#x3002;M-b &#x3082;&#x540C;&#x69D8;&#x3067;&#x3059;&#x3001;
&#x65B9;&#x5411;&#x306F;&#x9006;&#x3067;&#x3059;&#x304C;&#x3002;
</code></pre><p>&#x300C;&#x3053;&#x308C;&#x306F;&#x885D;&#x6483;&#x7684;&#x3060;&#x3063;&#x305F;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;  </p>
<p><strong>&#x65E5;&#x672C;&#x8A9E;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x5358;&#x8A9E;&#x306E;&#x5207;&#x308C;&#x76EE;&#x3092;&#x8A8D;&#x8B58;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x7591;&#x4F3C;&#x7684;&#x306A;&#x6587;&#x7BC0;&#x3092;&#x5358;&#x8A9E;&#x306E;&#x5207;&#x308C;&#x76EE;&#x3068;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</strong>  </p>
<p>&#x300C;&#x3044;&#x3084;&#x3042;&#xFF0C;&#x77E5;&#x308A;&#x307E;&#x305B;&#x3093;&#x3067;&#x3057;&#x305F;&#x300D;&#x300C;M-f&#x305D;&#x306E;&#x3082;&#x306E;&#x3092;&#x304B;&#xFF1F;&#x300D;&#x300C;M-f&#x3063;&#x3066;&#x3044;&#x3046;&#x304B;&#xFF0C;&#x82F1;&#x8A9E;&#x5C02;&#x7528;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x982D;&#x306B;&#x56DE;&#x8DEF;&#x304C;&#x3067;&#x304D;&#x3066;&#x306A;&#x3044;&#x300D;&#x300C;&#x4ECA;&#x5F8C;&#x306F;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x304F;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x610F;&#x8B58;&#x3057;&#x3066;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x304B;&#x306A;&#x3044;&#x3068;&#x306D;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x3060;&#x3068;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#xFF1F;&#x300D;  </p>
<pre><code>    &#x8FD9;&#x91CC;&#x7684;&#x201C;&#x8BCD;&#x201D;&#x6307;
    &#x82F1;&#x6587;&#x5355;&#x8BCD;&#xFF0C;&#x5BF9;&#x4E2D;&#x6587;&#x6765;&#x8BF4;&#xFF0C;&#x5219;&#x662F;&#x6307;&#x79FB;&#x52A8;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x3002;  
</code></pre><p>&#x300C;&#x6B21;&#x306E;&#x53E5;&#x8AAD;&#x70B9;&#x307E;&#x3067;&#x98DB;&#x3076;&#x3063;&#x3066;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x3088;&#x308A;&#x8C6A;&#x5FEB;&#x3060;&#x306A;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x3060;&#x3068;&#x52A9;&#x8A5E;&#x3068;&#x52A9;&#x52D5;&#x8A5E;&#x3067;&#x533A;&#x5207;&#x3063;&#x3066;&#x308B;&#x306E;&#x304B;&#x306A;&#xFF1F;&#x300D;  </p>
<p><br>  </p>
<pre><code>&gt;&gt; M-f &#x3068; M-b &#x3092; C-f &#x3068; C-b &#x3092;&#x4EA4;&#x3048;&#x306A;&#x304C;&#x3089;&#x6570;&#x56DE;&#x8A66;&#x3057;&#x3001;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x5358;&#x8A9E;&#x4E2D;&#x306B;&#x3042;
   &#x308B;&#x6642;&#x3068;&#x3001;&#x5358;&#x8A9E;&#x3068;&#x5358;&#x8A9E;&#x306E;&#x9593;&#x306B;&#x3042;&#x308B;&#x6642;&#x306E;&#x52D5;&#x304D;&#x3092;&#x8ABF;&#x3079;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;

C-f &#x3068; C-b &#x306B;&#x5BFE;&#x3059;&#x308B;&#x3001;M-f &#x3068; M-b &#x306E;&#x985E;&#x4F3C;&#x6027;&#x306B;&#x6CE8;&#x76EE;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x591A;&#x304F;&#x306E;&#x5834;&#x5408;&#x3001;
&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x306F;&#x6587;&#x66F8;&#x3092;&#x69CB;&#x6210;&#x3059;&#x308B;&#x30E6;&#x30CB;&#x30C3;&#x30C8;&#xFF08;&#x5358;&#x8A9E;&#x3001;&#x6587;&#x3001;&#x6BB5;&#x843D;&#xFF09;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x64CD;&#x4F5C;&#x306B;&#x4F7F;&#x3044;&#x3001;
&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x306F;&#x305D;&#x308C;&#x3088;&#x308A;&#x3082;&#x3082;&#x3063;&#x3068;&#x57FA;&#x672C;&#x7684;&#x306A;&#x5BFE;&#x8C61;&#xFF08;&#x6587;&#x5B57;&#x3068;&#x304B;&#x884C;&#x7B49;&#xFF09;&#x306B;&#x5BFE;&#x3059;&#x308B;
&#x64CD;&#x4F5C;&#x306B;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x82F1;&#x8A9E;&#x5C02;&#x7528;&#x307F;&#x305F;&#x3044;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x4ED6;&#x306B;&#x3082;&#x3042;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#x3055;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;C-t&#x3068;&#x304B;&#x300D;&#x300C;&#x4F55;&#x3060;&#x305D;&#x308C;&#x306F;&#x300D;&#x300C;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x524D;&#x306E;2&#x6587;&#x5B57;&#x306E;&#x9806;&#x5E8F;&#x3092;&#x5165;&#x308C;&#x66FF;&#x3048;&#x308B;&#x3002;aeg &#x2192; age &#x3068;&#x304B;&#x300D;&#x300C;&#x82F1;&#x8A9E;&#x5C02;&#x7528;&#x306A;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x3060;&#x3068;&#x3042;&#x307E;&#x308A;&#x3002;&#x3060;&#x304B;&#x3089;&#x79C1;&#x306F;C-x o&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x6301;&#x305F;&#x305B;&#x3066;&#x307E;&#x3059;&#x3002;&#x8A73;&#x3057;&#x304F;&#x306F;&#x300E;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x300F;&#x306B;&#x3066;&#x300D;  </p>
<p>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x541B;&#x306F;&#x5192;&#x982D;&#x306B;&#x524D;&#x56DE;&#x306E;&#x307E;&#x3068;&#x3081;&#x3092;&#x5165;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x306A;&#x3002;&#x6700;&#x521D;&#x306B;&#x5FA9;&#x7FD2;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x8A71;&#x306F;&#x3069;&#x3053;&#x3078;&#x884C;&#x3063;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#x672C;&#x6587;&#x306B;&#x8981;&#x7D04;&#x304C;&#x306A;&#x3044;&#x3093;&#x3060;&#x3082;&#x3093;&#x300D;&#x300C;&#x3084;&#x306F;&#x308A;&#x524D;&#x56DE;&#x306E;&#x306F;&#x51FA;&#x307E;&#x304B;&#x305B;&#x3060;&#x3063;&#x305F;&#x304B;&#x2026;&#x300D;&#x300C;&#x3048;&#x30FC;&#xFF0C;&#x3060;&#x3063;&#x3066;&#x524D;&#x56DE;&#x3069;&#x3046;&#x3067;&#x3082;&#x3044;&#x3044;&#x4E16;&#x9593;&#x8A71;&#x3068;C-n, C-p&#x304F;&#x3089;&#x3044;&#x3057;&#x304B;&#x3057;&#x3066;&#x306A;&#x3044;&#x3057;&#x300D;&#x300C;&#x3069;&#x3046;&#x3067;&#x3082;&#x3044;&#x3044;&#x3063;&#x3066;&#x2026;&#x300D;&#x300C;&#x307B;&#x3089;&#xFF0C;&#x4ECA;&#x56DE;&#x3060;&#x3063;&#x3066;&#x6700;&#x521D;&#x306B;C-n&#x4F7F;&#x3063;&#x3066;&#x308B;&#x3067;&#x3057;&#x3087;&#x3002;&#x306F;&#x3044;&#x5FA9;&#x7FD2;&#x3057;&#x305F;!&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x3053;&#x306E;&#x985E;&#x4F3C;&#x6027;&#x306F;&#x884C;&#x3068;&#x6587;&#x306E;&#x95A2;&#x4FC2;&#x306B;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;C-a &#x3068; C-e &#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x884C;&#x982D;&#x3068;&#x884C;&#x672B;
&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;M-a &#x3068; M-e &#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x6587;&#x982D;&#x3068;&#x6587;&#x672B;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-a &#x3092;&#xFF12;&#x56DE;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089; C-e &#x3092;&#xFF12;&#x56DE;&#x8A66;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   M-a &#x3092;&#xFF12;&#x56DE;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089; M-e &#x3092;&#xFF12;&#x56DE;&#x8A66;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

C-a &#x3092;&#x7E70;&#x8FD4;&#x3057;&#x3066;&#x3082;&#x305D;&#x308C;&#x4EE5;&#x4E0A;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;M-a &#x3092;&#x7E70;&#x308A;&#x8FD4;&#x3059;&#x3068;&#x3069;&#x3093;&#x3069;&#x3093;&#x524D;&#x306E;&#x6587;
&#x982D;&#x306B;&#x623B;&#x3063;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x90E8;&#x5206;&#x3067;&#x306F;&#x985E;&#x4F3C;&#x6027;&#x304C;&#x7834;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x307E;&#x3042;&#x3053;&#x308C;&#x304C;&#x81EA;&#x7136;
&#x306A;&#x52D5;&#x4F5C;&#x3067;&#x306F;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#x3002;
</code></pre><p>&#x300C;&#x51FA;&#x305F;&#xFF0C;C-a&#x3068;C-e&#x300D;&#x300C;&#xFF1F;&#x300D;&#x300C;C-f&#x3068;C-b&#x306F;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3067;&#x4EE3;&#x7528;&#x3067;&#x304D;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#x3053;&#x308C;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3059;&#x3054;&#x304F;&#x4FBF;&#x5229;&#x300D;&#x300C;&#x305A;&#x3044;&#x3076;&#x3093;&#x62BC;&#x3057;&#x3066;&#x304F;&#x308B;&#x306A;&#x3002;&#x6691;&#x82E6;&#x3057;&#x3044;&#x305E;&#x3002;M-a&#x3068;M-e&#x306F;&#xFF1F;&#x300D;&#x300C;&#x4ECA;&#x77E5;&#x3063;&#x305F;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x3067;&#x3082;C-a&#x3068;C-e&#x306F;&#x672C;&#x5F53;&#x306B;&#x4FBF;&#x5229;&#x3002;&#x6587;&#x982D;&#x306B;&#x5225;&#x306E;&#x6587;&#x7AE0;&#x5165;&#x308C;&#x308B;&#x3068;&#x304D;&#x3068;&#x304B;&#xFF0C;&#x6587;&#x672B;&#x306B;&#x5225;&#x306E;&#x6587;&#x7AE0;&#x5165;&#x308C;&#x308B;&#x3068;&#x304D;&#x3068;&#x304B;&#x5927;&#x6D3B;&#x8E8D;&#x3059;&#x308B;&#x300D;&#x300C;&#x3067;&#x3082;M-a&#x3068;M-e&#x306F;&#xFF1F;&#x300D;&#x300C;&#x4ECA;&#x77E5;&#x3063;&#x305F;&#x300D;&#x300C;&#x2026;&#x306F;&#x3041;&#x300D;&#x300C;&#x4E16;&#x306E;&#x4E2D;&#x77E5;&#x3089;&#x306A;&#x3044;&#x3053;&#x3068;&#x3060;&#x3089;&#x3051;&#x3067;&#x3059;&#xFF0C;&#x30CF;&#x30A4;&#x300D;&#x300C;Emacs&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3082;&#x541B;&#x306E;&#x5F79;&#x306B;&#x7ACB;&#x3063;&#x3066;&#x672C;&#x671B;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x6587;&#x7AE0;&#x4E2D;&#x3067;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x3042;&#x308B;&#x4F4D;&#x7F6E;&#x3092;&#x300C;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x300D;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;&#x8A00;&#x3044;&#x304B;&#x3048;&#x308C;&#x3070;&#x3001;&#x30AB;&#x30FC;
&#x30BD;&#x30EB;&#x306F;&#x3001;&#x6587;&#x7AE0;&#x306E;&#x3069;&#x3053;&#x306B;&#x30DD;&#x30A4;&#x30F3;&#x30C8;&#x304C;&#x3042;&#x308B;&#x304B;&#x3092;&#x753B;&#x9762;&#x4E0A;&#x3067;&#x793A;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;

&#x4EE5;&#x4E0B;&#x306B;&#x5358;&#x7D14;&#x306A;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x64CD;&#x4F5C;&#x306B;&#x3064;&#x3044;&#x3066;&#x8981;&#x7D04;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x306A;&#x304B;&#x306B;&#x306F;&#x3001;&#x5358;&#x8A9E;&#x3084;&#x884C;
&#x5358;&#x4F4D;&#x3067;&#x306E;&#x79FB;&#x52D5;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3082;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;

      C-f    &#x4E00;&#x6587;&#x5B57;&#x6B21;&#x306B;&#x9032;&#x3080;
      C-b    &#x4E00;&#x6587;&#x5B57;&#x524D;&#x306B;&#x623B;&#x308B;

      M-f    &#x4E00;&#x5358;&#x8A9E;&#x6B21;&#x306B;&#x9032;&#x3080;
      M-b    &#x4E00;&#x5358;&#x8A9E;&#x524D;&#x306B;&#x623B;&#x308B;

      C-n    &#x6B21;&#x306E;&#x884C;&#x306B;&#x79FB;&#x52D5;
      C-p    &#x524D;&#x306E;&#x884C;&#x306B;&#x79FB;&#x52D5;

      C-a    &#x884C;&#x982D;&#x306B;&#x79FB;&#x52D5;
      C-e    &#x884C;&#x672B;&#x306B;&#x79FB;&#x52D5;

      M-a    &#x6587;&#x982D;&#x306B;&#x79FB;&#x52D5;
      M-e    &#x6587;&#x672B;&#x306B;&#x79FB;&#x52D5;

&gt;&gt; &#x3053;&#x308C;&#x3089;&#x5168;&#x90E8;&#x3092;&#x4F55;&#x5EA6;&#x304B;&#x8A66;&#x3057;&#x3066;&#x7DF4;&#x7FD2;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   &#x3069;&#x308C;&#x3082;&#x983B;&#x7E41;&#x306B;&#x4F7F;&#x3046;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x79C1;&#x306F;&#x983B;&#x7E41;&#x306B;&#x4F7F;&#x3046;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x534A;&#x5206;&#x3057;&#x304B;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x306A;&#x304B;&#x3063;&#x305F;&#x3088;&#x3046;&#x3060;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x53E3;&#x8ABF;&#x3092;&#x771F;&#x4F3C;&#x3059;&#x308B;&#x306A;&#x300D;&#x300C;C-a&#x3068;C-e&#x306F;&#x610F;&#x8B58;&#x7684;&#x306B;&#x4F7F;&#x3046;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x3089;&#x672C;&#x5F53;&#x306B;&#x4FBF;&#x5229;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#xFF0C;M-&#x3067;&#x59CB;&#x307E;&#x308B;&#x3084;&#x3064;&#x3082;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x300D;&#x300C;&#x3046;&#x3080;&#xFF0C;&#x6B8A;&#x52DD;&#x306A;&#x5FC3;&#x304C;&#x3051;&#x3060;&#x300D;&#x300C;&#x3061;&#x306A;&#x307F;&#x306B;&#x4ECA;M-a&#x3068;M-e&#x4F7F;&#x3063;&#x305F;&#x3089;&#x4F1A;&#x8A71;&#x6587;&#x306F;&#x5168;&#x90E8;&#x98DB;&#x3070;&#x3055;&#x308C;&#x305F;&#x300D;&#x300C;&#x5224;&#x65AD;&#x3059;&#x308B;&#x306E;&#x306F;&#x53E5;&#x70B9;&#x3060;&#x3051;&#x304B;&#x300D;&#x300C;&#x3042;&#x3068;&#x7A7A;&#x767D;&#x884C;&#x3068;&#x304B;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x3042;&#x3068;&#x4E8C;&#x3064;&#x3001;&#x91CD;&#x8981;&#x306A;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5148;&#x982D;&#x306B;&#x79FB;&#x52D5;&#x3059;
&#x308B; M-&lt; &#x3068;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x672B;&#x5C3E;&#x306B;&#x79FB;&#x52D5;&#x3059;&#x308B; M-&gt; &#x3067;&#x3059;&#x3002;

&#x5927;&#x62B5;&#x306E;&#x7AEF;&#x672B;&#x3067;&#x306F; &quot;&lt;&quot; &#x30AD;&#x30FC;&#x306F; &quot;,&quot; &#x30AD;&#x30FC;&#xFF08;&#x30B3;&#x30F3;&#x30DE;&#xFF09;&#x306E;&#x4E0A;&#x306B;&#x3042;&#x308A;&#x3001;&#x305D;&#x308C;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;
&#x308B;&#x306B;&#x306F;&#x30B7;&#x30D5;&#x30C8;&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3057;&#x305F;&#x304C;&#x3063;&#x3066; M-&lt; &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;
&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x3068;&#x30B7;&#x30D5;&#x30C8;&#x30AD;&#x30FC;&#x3068;&#x30B3;&#x30F3;&#x30DE;&#x30AD;&#x30FC;&#x3092;&#x540C;&#x6642;&#x306B;&#x62BC;&#x3055;&#x306D;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;

&gt;&gt; M-&lt; &#x3092;&#x8A66;&#x3057;&#x3066;&#x3001;&#x3053;&#x306E;&#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x306E;&#x5148;&#x982D;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   &#x305D;&#x308C;&#x304B;&#x3089;&#x3001;C-v &#x3092;&#x4F55;&#x5EA6;&#x304B;&#x4F7F;&#x3063;&#x3066;&#x3053;&#x3053;&#x307E;&#x3067;&#x5E30;&#x3063;&#x3066;&#x304D;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;

&gt;&gt; M-&gt; &#x3092;&#x8A66;&#x3057;&#x3066;&#x3001;&#x3053;&#x306E;&#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x306E;&#x672B;&#x5C3E;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
   &#x305D;&#x308C;&#x304B;&#x3089;&#x3001;M-v &#x3092;&#x4F55;&#x5EA6;&#x304B;&#x4F7F;&#x3063;&#x3066;&#x3053;&#x3053;&#x307E;&#x3067;&#x5E30;&#x3063;&#x3066;&#x304D;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x51FA;&#x305F;M-&gt;&#x3068;M-&lt;&#x300D;&#x300C;&#x307E;&#x305F;&#x304B;&#x300D;&#x300C;&#x672C;&#x6587;&#x898B;&#x76F4;&#x3059;&#x3068;&#x304D;&#x306B;M-&lt;&#x3067;&#x6700;&#x521D;&#x307E;&#x3067;&#x623B;&#x3063;&#x3066;&#x304B;&#x3089;C-v&#x3067;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3002;&#x3059;&#x3054;&#x304F;&#x4FBF;&#x5229;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x7D9A;&#x304D;&#x66F8;&#x304F;&#x3068;&#x304D;&#x306F;M-&gt;&#x3067;&#x6700;&#x5F8C;&#x307E;&#x3067;&#x4E00;&#x767A;&#x3067;&#x884C;&#x3051;&#x308B;&#x3057;&#x3002;C-a, C-e&#x3068;&#x540C;&#x3058;&#x304F;&#x3089;&#x3044;&#x3088;&#x304F;&#x4F7F;&#x3046;&#x300D;&#x300C;&#x899A;&#x3048;&#x3066;&#x304A;&#x3044;&#x3066;&#x640D;&#x304C;&#x306A;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x306A;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x3082;&#x3057;&#x7AEF;&#x672B;&#x306B;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x304C;&#x3042;&#x308C;&#x3070;&#x3001;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x52D5;&#x304B;&#x3059;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
    &#x3051;&#x308C;&#x3069;&#x3001;&#x6B21;&#x306E;&#xFF13;&#x3064;&#x306E;&#x7406;&#x7531;&#x304B;&#x3089; C-b, C-f, C-n, C-p &#x3092;&#x899A;&#x3048;&#x308B;&#x3053;&#x3068;&#x3092;&#x52E7;&#x3081;&#x307E;&#x3059;&#x3002;
    &#x7B2C;&#x4E00;&#x306B;&#x3001;&#x3053;&#x308C;&#x3089;&#x306F;&#x3069;&#x3093;&#x306A;&#x7AEF;&#x672B;&#x3067;&#x3082;&#x4F7F;&#x3048;&#x307E;&#x3059;&#x3002;&#x7B2C;&#x4E8C;&#x306B;&#x3001;Emacs &#x3092;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x4E0A;&#x9054;&#x3057;
    &#x3066;&#x304F;&#x308C;&#x3070;&#x3001;&#x3053;&#x308C;&#x3089;&#x306E;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x6587;&#x5B57;&#x3092;&#x6253;&#x3064;&#x65B9;&#x304C;&#x3001;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3092;&#x6253;&#x3064;&#x3088;&#x308A;&#x305A;&#x3063;&#x3068;
    &#x901F;&#x3044;&#x3053;&#x3068;&#x304C;&#x5206;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#xFF08;&#x624B;&#x3092;&#x901A;&#x5E38;&#x306E;&#x4F4D;&#x7F6E;&#x304B;&#x3089;&#x5927;&#x304D;&#x304F;&#x52D5;&#x304B;&#x3055;&#x306A;&#x3044;&#x3067;&#x3088;&#x3044;&#x306E;&#x3067;&#xFF09;&#x3002;
    &#x6700;&#x5F8C;&#x306B;&#x3001;&#x4E00;&#x5EA6;&#x3053;&#x308C;&#x3089;&#x306E;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x6587;&#x5B57;&#x3092;&#x6253;&#x3064;&#x7FD2;&#x6163;&#x3092;&#x4ED8;&#x3051;&#x305F;&#x3089;&#x3001;&#x3082;&#x3063;&#x3068;&#x9032;&#x3093;&#x3060;
    &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3082;&#x7C21;&#x5358;&#x306B;&#x899A;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x304A;&#x3044;&#xFF0C;&#x541B;&#x306E;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x30AD;&#x30FC;&#x8AD6;&#x304C;&#x5426;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x305E;&#x300D;&#x300C;&#x79C1;&#x306F;&#x3059;&#x3067;&#x306B;C-b, C-f, C-n, C-p&#x3092;&#x899A;&#x3048;&#x3066;&#x3044;&#x308B;&#x300D;&#x300C;&#x304A;&#x2026;&#x304A;&#x3046;&#x300D;&#x300C;&#x305D;&#x308C;&#x306B;<a href="https://jamcha-aa.github.io/EeePC/07.html" target="_blank">&#x79C1;&#x306F;Emacs&#x3067;Nautilus&#x3084;gnome-terminal&#x3084;Firefox&#x3084;Gimp&#x3084;LibreOffice&#x3082;&#x4F7F;&#x3046;&#x3002;</a>&#x305D;&#x308C;&#x3060;&#x3068;Emacs&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x4F7F;&#x3048;&#x306A;&#x3044;&#x300D;&#x300C;&#x3068;&#x3093;&#x3067;&#x3082;&#x306A;&#x3044;&#x65B9;&#x5411;&#x304B;&#x3089;&#x53CD;&#x8AD6;&#x3057;&#x3066;&#x304D;&#x305F;&#x306A;&#x300D;&#x300C;&#x3042;&#x3068;&#x30A8;&#x30E9;&#x30FC;&#x306E;&#x539F;&#x56E0;&#x63A2;&#x3057;&#x3066;&#x308B;&#x3068;&#x304D;&#x3068;&#x304B;&#x306F;&#x30DB;&#x30FC;&#x30E0;&#x30DD;&#x30B8;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x624B;&#x7F6E;&#x304F;&#x3088;&#x308A;&#x3082;&#x30EA;&#x30E9;&#x30C3;&#x30AF;&#x30B9;&#x3057;&#x305F;&#x59FF;&#x52E2;&#x3067;&#x64CD;&#x4F5C;&#x3057;&#x305F;&#x3044;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x305D;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x3093;&#x304C;&#x3002;&#x2026;&#x307E;&#x3042;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3044;&#x7D9A;&#x3051;&#x305F;&#x3044;&#x3068;&#x3044;&#x3046;&#x4FE1;&#x5FF5;&#x306F;&#x4F1D;&#x308F;&#x3063;&#x305F;&#x3088;&#x300D;&#x300C;&#x4F7F;&#x3044;&#x305F;&#x3044;&#xFF0C;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x4F7F;&#x3044;&#x307E;&#x3059;&#xFF0C;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="04.html" class="navigation navigation-prev " aria-label="Previous page: 04 - Go! Go! Go!">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="06.html" class="navigation navigation-next " aria-label="Next page: 06 - 賢馬は「引数」が読める">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"05 - Move! Move! Move!","level":"3.3","depth":1,"next":{"title":"06 - 賢馬は「引数」が読める","level":"3.4","depth":1,"path":"06.md","ref":"06.md","articles":[]},"previous":{"title":"04 - Go! Go! Go!","level":"3.2","depth":1,"path":"04.md","ref":"04.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"05.md","mtime":"2018-08-14T11:00:51.017Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-15T16:14:53.705Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

