
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>06 - 賢馬は「引数」が読める · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="07.html" />
    
    
    <link rel="prev" href="05.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >06 - 賢馬は「引数」が読める</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="06---&#x8CE2;&#x99AC;&#x306F;&#x300C;&#x5F15;&#x6570;&#x300D;&#x304C;&#x8AAD;&#x3081;&#x308B;">06 - &#x8CE2;&#x99AC;&#x306F;&#x300C;&#x5F15;&#x6570;&#x300D;&#x304C;&#x8AAD;&#x3081;&#x308B;</h1>
<p>&#x79C1;&#x304C;&#x304A;&#x8179;&#x3092;&#x3055;&#x3059;&#x308A;&#x306A;&#x304C;&#x3089;&#x5E2D;&#x306B;&#x3064;&#x304F;&#x3068;&#xFF0C;EeePC&#x304C;&#x4E0D;&#x601D;&#x8B70;&#x306A;&#x69D8;&#x5B50;&#x3067;&#x305F;&#x305A;&#x306D;&#x308B;&#x3002;&#x300C;&#x73CD;&#x3057;&#x3044;&#x306A;&#xFF0C;&#x3053;&#x3093;&#x306A;&#x591C;&#x66F4;&#x3051;&#x306B;&#x300D;&#x300C;&#x3046;&#x3093;&#xFF0C;&#x6669;&#x3054;&#x98EF;&#x98DF;&#x3079;&#x3059;&#x304E;&#x3066;&#x5BDD;&#x308C;&#x306A;&#x3044;&#x306E;&#x3002;&#x3060;&#x304B;&#x3089;&#x7720;&#x304F;&#x306A;&#x308B;&#x307E;&#x3067;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3084;&#x308D;&#x3046;&#x3068;&#x601D;&#x3063;&#x3066;&#x300D;  </p>
<p>&#x300C;&#x4F55;&#x3092;&#x98DF;&#x3079;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x3048;&#x30FC;&#x3068;&#x306D;&#xFF0C;&#x9D8F;&#x8089;&#x306E;&#x30A8;&#x30D3;&#x30C1;&#x30EA;&#x98A8;&#x3068;&#xFF0C;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x3082;&#x3084;&#x3057;&#x3068;&#x30AD;&#x30E3;&#x30D9;&#x30C4;&#x306E;&#x30B9;&#x30FC;&#x30D7;&#x3068;&#xFF0C;&#x3042;&#x3068;&#xFF0C;&#x3086;&#x304B;&#x308A;&#x3054;&#x98EF;&#x300D;&#x300C;&#x4F53;&#x8ABF;&#x306F;&#x5143;&#x901A;&#x308A;&#x306E;&#x3088;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x3060;&#x3044;&#x305F;&#x3044;&#x306D;&#x300D;&#x300C;&#x7121;&#x8336;&#x306F;&#x3059;&#x308B;&#x306A;&#x3088;&#x3002;&#x79C1;&#x3068;&#x9055;&#x3063;&#x3066;&#x541B;&#x306E;&#x90E8;&#x54C1;&#x306F;&#x4EA4;&#x63DB;&#x3067;&#x304D;&#x306A;&#x3044;&#x3093;&#x3060;&#x304B;&#x3089;&#x306A;&#x300D;&#x300C;&#x2026;&#x3042;&#x308A;&#x304C;&#x3068;&#x3002;&#x3067;&#x3082;&#x541B;&#x3060;&#x3063;&#x3066;&#x3082;&#x3046;&#x4EA4;&#x63DB;&#x3067;&#x304D;&#x308B;&#x90E8;&#x54C1;&#x306F;&#x306A;&#x3044;&#x3093;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x79C1;&#x306F;&#x541B;&#x3068;&#x9055;&#x3063;&#x3066;&#x9811;&#x4E08;&#x3060;&#x304B;&#x3089;&#x5E73;&#x6C17;&#x3060;&#x3002;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3060;&#x3051;&#x306F;&#x58CA;&#x308C;&#x3084;&#x3059;&#x3044;&#x304C;&#x300D;&#x300C;&#x58CA;&#x308C;&#x308B;&#x524D;&#x306B;&#x5916;&#x4ED8;&#x3051;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3067;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x3089;&#x5B89;&#x5FC3;&#x3057;&#x3066;&#x300D;&#x300C;&#x3046;&#x3080;&#x3002;&#x3060;&#x304B;&#x3089;&#x5FC3;&#x914D;&#x306F;&#x7121;&#x7528;&#x3060;&#x3002;&#x5B58;&#x5206;&#x306B;&#x4F7F;&#x3063;&#x3066;&#x304F;&#x308C;&#x300D;&#x300C;&#x5B58;&#x5206;&#x306B;&#x4F7F;&#x3048;&#x308B;&#x307B;&#x3069;&#x306E;&#x6027;&#x80FD;&#x304C;&#x3042;&#x308C;&#x3070;&#x306D;&#x2026;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x5143;&#x6C17;&#x306B;&#x306A;&#x3063;&#x305F;&#x9014;&#x7AEF;&#x306B;&#x618E;&#x307E;&#x308C;&#x53E3;&#x304B;&#x300D;  </p>
<p><br><br>&#x300C;&#x65E9;&#x901F;&#x524D;&#x56DE;&#x306E;&#x304A;&#x3055;&#x3089;&#x3044;&#x3092;&#x3057;&#x3088;&#x3046;&#x3068;&#x601D;&#x3063;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;C-n&#x3068;&#x304B;M-f&#x3068;&#x304B;&#x3092;&#x4FEE;&#x5F97;&#x3057;&#x305F;&#x3044;&#x306A;&#x3089;<a href="https://github.com/k1LoW/emacs-drill-instructor/wiki" target="_blank">&#x9B3C;&#x8ECD;&#x66F9;.el</a>&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x306A;&#x3093;&#x3060;&#x305D;&#x308C;&#x306F;&#x300D;&#x300C;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x3068;&#x304B;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x304C;&#x4F7F;&#x3048;&#x306A;&#x304F;&#x306A;&#x308B;&#x300D;&#x300C;&#x540D;&#x524D;&#x306B;&#x9055;&#x308F;&#x306C;&#x30B9;&#x30D1;&#x30EB;&#x30BF;&#x3060;&#x306A;&#x300D;&#x300C;<a href="http://gihyo.jp/book/2016/978-4-7741-8007-6" target="_blank">&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x306E;&#x672C;</a>&#x3067;&#x3082;&#x7D39;&#x4ECB;&#x3055;&#x308C;&#x3066;&#x305F;&#x3057;&#xFF0C;&#x982D;&#x3067;&#x899A;&#x3048;&#x308B;&#x3088;&#x308A;&#x52D5;&#x304B;&#x3057;&#x3066;&#x8EAB;&#x306B;&#x3064;&#x3051;&#x307E;&#x3057;&#x3087;&#x3046;&#x300D;&#x300C;&#x541B;&#x306F;&#x4F7F;&#x3063;&#x305F;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x306F;&#x5C0F;&#x8AAC;&#x66F8;&#x304D;&#x306A;&#x304C;&#x3089;&#x8EAB;&#x306B;&#x3064;&#x3051;&#x307E;&#x3057;&#x305F;&#x300D;&#x300C;&#x304B;&#x306A;&#x308A;&#x7279;&#x6B8A;&#x306A;&#x30B1;&#x30FC;&#x30B9;&#x3060;&#x306A;&#x300D;  </p>
<p><br>  </p>
<pre><code>Emacs&#x306E;&#x5927;&#x62B5;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x306F;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3092;&#x4E0E;&#x3048;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x5927;&#x62B5;&#x306E;&#x5834;&#x5408;&#x3053;
&#x306E;&#x6570;&#x5024;&#x3067;&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x56DE;&#x6570;&#x3092;&#x6307;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3092;&#x4E0E;&#x3048;&#x308B;&#x306B;&#x306F;&#x3001;&#x30B3;
&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x524D;&#x306B; C-u &#x306B;&#x7D9A;&#x3044;&#x3066;&#x6570;&#x5B57;&#x3092;&#x4F55;&#x6841;&#x304B;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x30E1;&#x30BF;&#x30AD;&#x30FC;
&#x304C;&#x4F7F;&#x3048;&#x308B;&#x306A;&#x3089;&#x3001;&#x30E1;&#x30BF;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x306A;&#x304C;&#x3089;&#x6570;&#x5B57;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3067;&#x3082;
&#x3084;&#x306F;&#x308A; C-u &#x3092;&#x899A;&#x3048;&#x308B;&#x3053;&#x3068;&#x3092;&#x52E7;&#x3081;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x306F;&#x3069;&#x3093;&#x306A;&#x7AEF;&#x672B;&#x3067;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x304B;&#x3089;&#x3067;&#x3059;&#x3002;
&#x6570;&#x5024;&#x5F15;&#x6570;&#x306F;&#x300C;&#x524D;&#x7F6E;&#x5F15;&#x6570;&#x300D;&#x3068;&#x3082;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;&#x5B9F;&#x884C;&#x3057;&#x305F;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x524D;&#x306B;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;
&#x304B;&#x3089;&#x3067;&#x3059;&#x3002;

&#x4F8B;&#x3048;&#x3070; C-u 8 C-f &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068;&#xFF18;&#x6587;&#x5B57;&#x5206;&#x5148;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x9069;&#x5F53;&#x306A;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3092; C-n &#x3042;&#x308B;&#x3044;&#x306F; C-p &#x306B;&#x4E0E;&#x3048;&#x3001;&#x4E00;&#x56DE;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x306A;&#x308B;&#x3079;&#x304F;
   &#x3053;&#x306E;&#x884C;&#x306E;&#x8FD1;&#x304F;&#x306B;&#x6765;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;&#x521D;&#x898B;&#x3067;&#x3053;&#x306E;&#x5B57; (&#x300E;&#x5F15;&#x6570;&#x300F;&#x306E;&#x3053;&#x3068;) &#x3092;&#x6B63;&#x3057;&#x304F;&#x8AAD;&#x3081;&#x308B;&#x4EBA;&#x304C;&#x3044;&#x305F;&#x3089;&#xFF0C;&#x305D;&#x306E;&#x4EBA;&#x306F;<a href="https://ja.wikipedia.org/wiki/%E8%B3%A2%E9%A6%AC%E3%83%8F%E3%83%B3%E3%82%B9" target="_blank">&#x99AC;&#x306E;&#x30CF;&#x30F3;&#x30B9;</a>&#x3092;&#x5B88;&#x8B77;&#x970A;&#x306B;&#x6301;&#x3063;&#x3066;&#x3044;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x300D;&#x300C;&#x99AC;&#x306E;&#x30CF;&#x30F3;&#x30B9;&#x3063;&#x3066;&#x4F55;&#x3060;&#x300D;&#x300C;&#x8DB3;&#x3057;&#x7B97;&#x304C;&#x3067;&#x304D;&#x308B;&#x99AC;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x3059;&#x3054;&#x3044;&#x300D;&#x300C;&#x672C;&#x5F53;&#x306F;&#x98FC;&#x3044;&#x4E3B;&#x306E;&#x53CD;&#x5FDC;&#x3092;&#x898B;&#x3066;&#x305F;&#x300D;&#x300C;&#x3058;&#x3083;&#x3042;&#x8A08;&#x7B97;&#x80FD;&#x529B;&#x3092;&#x6301;&#x3063;&#x3066;&#x305F;&#x308F;&#x3051;&#x3058;&#x3083;&#x306A;&#x3044;&#x3093;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x305D;&#x308C;&#x3068;&#x305D;&#x306E;&#x2026;&#x541B;&#x306E;&#x8A00;&#x3046;&#x719F;&#x8A9E;&#x306B;&#x4F55;&#x306E;&#x95A2;&#x4FC2;&#x304C;&#x3042;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x307B;&#x3089;&#xFF0C;&#x8AAD;&#x3081;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x3050;&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x30CB;&#x30E4;&#x30EA;&#x3068;&#x3059;&#x308B;&#x3002;&#x300C;&#x79C1;&#x306F;&#x30CF;&#x30F3;&#x30B9;&#x306E;&#x98FC;&#x3044;&#x4E3B;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3089;&#x306D;&#x3002;&#x30D2;&#x30F3;&#x30C8;&#x306F;&#x3042;&#x3052;&#x306A;&#x3044;&#x3088;&#x300D;&#x300C;&#x2026;&#x300D;EeePC&#x306E;CPU&#x4F7F;&#x7528;&#x7387;&#x304C;&#x7A81;&#x5982;&#x3068;&#x3057;&#x3066;&#x6025;&#x4E0A;&#x6607;&#x3059;&#x308B;&#x3002;&#x300C;&#x3042;&#xFF0C;&#x691C;&#x7D22;&#x3057;&#x305F;&#x3089;&#x30C0;&#x30E1;&#x3060;&#x3088;&#x300D;&#x6C17;&#x3065;&#x304B;&#x308C;&#x305F;EeePC&#x3002;&#x300C;&#x2026;&#x541B;&#x304C;&#x554F;&#x3044;&#x3092;&#x51FA;&#x3059;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306F;&#xFF0C;&#x300E;&#x3044;&#x3093;&#x3059;&#x3046;&#x300F;&#x3067;&#x306F;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3057;&#x304B;&#x308F;&#x304B;&#x3089;&#x3093;&#x2026;&#x300D;&#x300C;&#x3069;&#x3046;&#xFF1F;&#x964D;&#x53C2;&#x3059;&#x308B;&#xFF1F;&#x300D;  </p>
<p>&#x8FFD;&#x3044;&#x8FBC;&#x307E;&#x308C;&#x305F;EeePC&#x3002;&#x3057;&#x304B;&#x3057;&#x30AD;&#x30E3;&#x30EA;&#x30A2;10&#x5E74;&#x306E;&#x30D9;&#x30C6;&#x30E9;&#x30F3;&#x306F;&#x8E0F;&#x3093;&#x3070;&#x3063;&#x305F;&#x3002;&#x300C;&#x5B9A;&#x7FA9;&#x3092;&#x6559;&#x3048;&#x3066;&#x304F;&#x308C;&#x300D;&#x300C;&#x3044;&#x3044;&#x3088;&#x3002;&#x3053;&#x308C;&#x306F;&#x306D;&#xFF0C;&#x9078;&#x629E;&#x80A2;&#x306A;&#x306E;&#x300D;&#x300C;&#x9078;&#x629E;&#x80A2;&#xFF1F;&#x300D;&#x300C;&#x679C;&#x7269;&#x3068;&#x304B;&#x8CB7;&#x3046;&#x3068;&#x304D;&#x306B;&#xFF0C;&#x3044;&#x304F;&#x3064;&#x8CB7;&#x3046;&#x304B;&#x9078;&#x3079;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x3067;&#x3057;&#x3087;&#x3002;&#x670D;&#x3092;&#x8CB7;&#x3046;&#x3068;&#x304D;&#x3082;&#xFF0C;&#x901A;&#x8CA9;&#x3060;&#x3068;&#x8272;&#x3092;&#x9078;&#x3079;&#x305F;&#x308A;&#x3002;&#x305D;&#x3046;&#x3044;&#x3046;&#x9078;&#x629E;&#x80A2;&#x306E;&#x3053;&#x3068;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x9078;&#x3093;&#x3060;&#x5185;&#x5BB9;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x7D50;&#x679C;&#x304C;&#x5909;&#x308F;&#x3063;&#x3066;&#x304F;&#x308B;&#x3002;&#x91D1;&#x984D;&#x3068;&#x304B;&#xFF0C;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x3068;&#x304B;&#x300D;&#x300C;&#x5909;&#x6570;&#x306E;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x304A;!&#x3044;&#x3044;&#x7DDA;&#x3044;&#x3063;&#x3066;&#x308B;&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3080;&#xFF0C;&#x3068;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x3053;&#x306E; &quot;C-u 8 C-f&quot; &#x306E; &quot;8&quot; &#x304C;&#x9078;&#x629E;&#x80A2;&#x306B;&#x3042;&#x305F;&#x308B;&#x308F;&#x3051;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;&#x305D;&#x308C;&#x304C;6&#x3060;&#x3068;6&#x6587;&#x5B57;&#x9032;&#x3080;&#x300D;&#x300C;20&#x3060;&#x3068;20&#x5B57;&#x9032;&#x3080;&#x300D;&#x300C;&#x305D;&#x306E;&#x901A;&#x308A;&#x300D;&#x300C;&#x305D;&#x308C;&#x3063;&#x3066;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF; (&#x5A92;&#x4ECB;&#x5909;&#x6570;) &#x306E;&#x3053;&#x3068;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x304A;&#x304A;!&#x300D;&#x300C;&#x3093;&#xFF1F;&#x300D;&#x300C;&#x3054;&#x660E;&#x5BDF;&#x3067;&#x3054;&#x3056;&#x3044;&#x307E;&#x3059;&#x300D;  </p>
<p>&#x300C;&#x3053;&#x308C;&#xFF0C;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3063;&#x3066;&#x8AAD;&#x3080;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x6B63;&#x3057;&#x304F;&#x306F;&#x300E;&#x3072;&#x304D;&#x3059;&#x3046;&#x300F;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3072;&#x304D;&#x3059;&#x3046;&#x300D;&#x300C;&#x3067;&#x3082;&#x3088;&#x304F;&#x308F;&#x304B;&#x3063;&#x305F;&#x306D;&#x300D;&#x300C;&#x5A92;&#x4ECB;&#x5909;&#x6570;&#x306F;&#x5E38;&#x8B58;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x3048;&#x300D;&#x300C;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x307E;&#x3055;&#x304B;&#x541B;&#x306F;&#x77E5;&#x3089;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3057;&#xFF0C;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3088;!&#x6570;&#x5B66;&#x3067;&#xFF0C;&#x6614;&#x2026;&#x300D;&#x300C;&#x5FA9;&#x7FD2;&#x304C;&#x5927;&#x4E8B;&#x306A;&#x3093;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x4EBA;&#x9593;&#x306F;&#x5FD8;&#x308C;&#x3084;&#x3059;&#x3044;&#x3093;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x9752;&#x30C1;&#x30E3;&#x30FC;&#x30C8;&#x304C;&#x57C3;&#x3092;&#x304B;&#x3076;&#x3063;&#x3066;&#x3044;&#x308B;&#x305E;&#x300D;&#x300C;&#x3061;&#x3087;&#x3063;&#x3068;&#xFF0C;&#x4F59;&#x8A08;&#x306A;&#x3053;&#x3068;&#x8A00;&#x308F;&#x306A;&#x3044;&#x3067;&#x3088;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x5927;&#x62B5;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3092;&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x56DE;&#x6570;&#x3068;&#x89E3;&#x91C8;&#x3057;&#x307E;&#x3059;&#x304C;&#x3001;&#x4E2D;&#x306B;&#x306F;&#x4F8B;&#x5916;&#x3082;&#x3042;&#x308A;
&#x307E;&#x3059;&#x3002;&#x305F;&#x3068;&#x3048;&#x3070;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#xFF08;&#x3053;&#x308C;&#x307E;&#x3067;&#x306B;&#x5B66;&#x3093;&#x3060;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3069;&#x308C;&#x3082;&#x9055;
&#x3044;&#x307E;&#x3059;&#x304C;&#xFF09;&#x3001;&#x524D;&#x7F6E;&#x5F15;&#x6570;&#x304C;&#x3042;&#x308B;&#x304B;&#x306A;&#x3044;&#x304B;&#x3060;&#x3051;&#x304C;&#x554F;&#x984C;&#x3067;&#x3001;&#x305D;&#x308C;&#x304C;&#x3042;&#x308B;&#x3068;&#x304D;&#x306F;&#x3001;&#x5B9F;&#x969B;
&#x306B;&#x4E0E;&#x3048;&#x305F;&#x6570;&#x5024;&#x306B;&#x306F;&#x95A2;&#x4FC2;&#x306A;&#x304F;&#x3001;&#x901A;&#x5E38;&#x3068;&#x306F;&#x7570;&#x306A;&#x308B;&#x50CD;&#x304D;&#x3092;&#x3057;&#x307E;&#x3059;&#x3002;

C-v &#x3084; M-v &#x306F;&#x307E;&#x305F;&#x9055;&#x3063;&#x305F;&#x30BF;&#x30A4;&#x30D7;&#x306E;&#x4F8B;&#x5916;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x5834;&#x5408;&#x3001;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x6570;&#x306E;&#x884C;&#x3060;
&#x3051;&#x753B;&#x9762;&#x3092;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070; C-u 8 C-v &#x306F;&#x753B;&#x9762;&#x3092;&#xFF18;&#x884C;
&#x4E0A;&#x306B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-u 8 C-v &#x3092;&#x8A66;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

&#x753B;&#x9762;&#x304C;&#x4E0A;&#x306B;&#xFF18;&#x884C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3057;&#x305F;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;&#x307E;&#x305F;&#x753B;&#x9762;&#x3092;&#x4E0B;&#x306B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x308B;&#x306B;&#x306F;
M-v &#x306B;&#x5F15;&#x6570;&#x3092;&#x4E0E;&#x3048;&#x308C;&#x3070;&#x3088;&#x3044;&#x306E;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;C-u&#x3063;&#x3066;<a href="https://www.oreilly.co.jp/books/9784873112770/" target="_blank">Emacs&#x306E;&#x672C;</a>&#x3067;&#x3082;&#x5E8F;&#x76E4;&#x306B;&#x51FA;&#x3066;&#x304F;&#x308B;&#x304F;&#x3089;&#x3044;&#x57FA;&#x672C;&#x306E;&#x6A5F;&#x80FD;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x4ECA;&#x307E;&#x3067;&#x4F7F;&#x3044;&#x3053;&#x306A;&#x305B;&#x306A;&#x304B;&#x3063;&#x305F;&#x300D;&#x300C;&#x3053;&#x308C;&#x304B;&#x3089;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x304F;&#x3093;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x307F;&#x305F;&#x3044;&#x306B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x4F7F;&#x308F;&#x306A;&#x304F;&#x3066;&#x3082;&#x6D3B;&#x8E8D;&#x3059;&#x308B;&#x304B;&#x306A;&#x300D;&#x300C;&#x3084;&#x3089;&#x306A;&#x3044;&#x7406;&#x7531;&#x306A;&#x3093;&#x3066;&#x3044;&#x304F;&#x3089;&#x3067;&#x3082;&#x51FA;&#x3066;&#x304F;&#x308B;&#x3082;&#x306E;&#x3060;&#x3002;&#x6C17;&#x3092;&#x3064;&#x3051;&#x308D;&#x300D;&#x300C;&#x3042;&#x308C;&#xFF1F;&#x305D;&#x308C;&#x524D;&#x306B;&#x79C1;&#x8A00;&#x3063;&#x305F;&#x3063;&#x3051;&#x300D;&#x300C;&#x541B;&#x304C;&#x6D41;&#x3057;&#x3066;&#x308B;&#x30E9;&#x30B8;&#x30AA;&#x3067;&#x805E;&#x3044;&#x305F;&#x300D;  </p>
<p>&#x300C;&#x3042;&#xFF0C;&#x79C1;&#x3067;&#x3082;&#x77E5;&#x3063;&#x3066;&#x308B;C-u&#x4F7F;&#x3046;&#x4FBF;&#x5229;&#x306A;&#x65B9;&#x6CD5;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;&#x3042;&#x3068;&#x3067;&#x300E;&#x30DE;&#x30FC;&#x30AF; (C-SPC)&#x300F;&#x3063;&#x3066;&#x6A5F;&#x80FD;&#x304C;&#x8AAC;&#x660E;&#x3055;&#x308C;&#x308B;&#x3068;&#x601D;&#x3046;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;C-u C-SPC&#x3067;&#x3055;&#x3063;&#x304D;&#x30DE;&#x30FC;&#x30AF;&#x3057;&#x305F;&#x5834;&#x6240;&#x306B;&#x5E30;&#x3063;&#x3066;&#x3053;&#x308C;&#x308B;&#x300D;&#x300C;&#x4F55;&#x304C;&#x4FBF;&#x5229;&#x306A;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x8AAD;&#x3093;&#x3067;&#x308B;&#x9014;&#x4E2D;&#x3067;&#x4F55;&#x304B;&#x78BA;&#x8A8D;&#x3057;&#x305F;&#x3044;&#x3053;&#x3068;&#x304C;&#x3042;&#x3063;&#x3066;&#x5225;&#x306E;&#x884C;&#x306B;&#x3046;&#x3064;&#x3063;&#x3066;&#x3082;&#xFF0C;C-u C-SPC&#x3067;&#x3059;&#x3050;&#x306B;&#x623B;&#x3063;&#x3066;&#x4F5C;&#x696D;&#x3092;&#x518D;&#x958B;&#x3067;&#x304D;&#x308B;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x3057;&#x304B;&#x3082;&#x30DE;&#x30FC;&#x30AF;&#x3057;&#x305F;&#x5834;&#x6240;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x9589;&#x3058;&#x308B;&#x307E;&#x3067;Emacs&#x306B;&#x8A18;&#x61B6;&#x3055;&#x308C;&#x3066;&#x308B;&#x304B;&#x3089;&#xFF0C;&#x3075;&#x305B;&#x3093;&#x307F;&#x305F;&#x3044;&#x306B;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x300D;&#x300C;&#x4ED8;&#x7B8B;&#x304B;&#x3002;&#x541B;&#x306E;&#x6587;&#x7AE0;&#x306F;&#x77ED;&#x3044;&#x3082;&#x306E;&#x304C;&#x591A;&#x3044;&#x304C;&#xFF0C;&#x6D3B;&#x8E8D;&#x3059;&#x308B;&#x6A5F;&#x4F1A;&#x306F;&#x3042;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;eww&#x3067;&#x9577;&#x3044;Web&#x30DA;&#x30FC;&#x30B8;&#x8AAD;&#x3080;&#x3068;&#x304D;&#x3068;&#x304B;&#x300D;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x300D;  </p>
<p>&#x300C;&#x3042;&#x3068;&#x306D;&#xFF0C;&#x4ECA;&#x8ABF;&#x3079;&#x3066;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;<a href="http://akisute3.hatenablog.com/entry/20111129/1322557154" target="_blank">&#x540C;&#x3058;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3082;C-u&#x306E;&#x6709;&#x308A;&#x7121;&#x3057;&#x3067;&#x9055;&#x3046;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x5B9F;&#x884C;&#x3067;&#x304D;&#x308B;</a>&#x306E;&#x300D;&#x300C;C-u&#x306E;&#x5B9A;&#x7FA9;&#x304B;&#x3089;&#x3059;&#x308B;&#x3068;&#x305D;&#x3046;&#x306A;&#x308B;&#x306A;&#x300D;&#x300C;&#x79C1;&#x3044;&#x307E;C-x g&#x3067;magit&#x304C;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;C-u C-x g&#x3067;&#x81EA;&#x52D5;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x308B;&#x3068;&#x9762;&#x767D;&#x3044;&#x306A;&#x3063;&#x3066;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;GitBook&#x3092;&#x30D3;&#x30EB;&#x30C9;&#x3059;&#x308B;&#x3068;&#x5909;&#x66F4;&#x70B9;&#x304C;&#x591A;&#x304F;&#x3066;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;magit&#x306E;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x753B;&#x9762;&#x304C;&#x91CD;&#x304F;&#x306A;&#x3063;&#x3061;&#x3083;&#x3046;&#x300D;&#x300C;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x306B;&#x6642;&#x9593;&#x304C;&#x304B;&#x304B;&#x308B;&#x306E;&#x304C;&#x5ACC;&#x3060;&#x3068;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;&#x3060;&#x304B;&#x3089;GitBook&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x305F;&#x3089;&#xFF0C;C-u C-x g&#x3067;&#x76F4;&#x63A5;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x308C;&#x3070;&#x3044;&#x3044;&#x306A;&#x3063;&#x3066;&#x300D;&#x300C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x304C;&#x5B8C;&#x6210;&#x3057;&#x305F;&#x3089;&#x516C;&#x958B;&#x3059;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x300D;&#x300C;&#x697D;&#x3057;&#x307F;&#x3060;&#x306A;&#x300D;&#x300C;&#x541B;&#xFF0C;&#x4EBA;&#x306E;&#x8A71;&#x805E;&#x304F;&#x306E;&#x4E0A;&#x624B;&#x3060;&#x306D;&#x300D;&#x300C;&#x305D;&#x3046;&#x304B;&#x3002; <code>M-x doctor</code> &#x306B;&#x611F;&#x8B1D;&#x3059;&#x308B;&#x3068;&#x3044;&#x3044;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x3082;&#x3057; X &#x3084; MS-Windows &#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x306A;&#x3089;&#x3001;&#x30B9;&#x30AF;&#x30ED;&#x30FC;
&#x30EB;&#x30D0;&#x30FC;&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x7E26;&#x9577;&#x306E;&#x56DB;&#x89D2;&#x3044;&#x30A8;&#x30EA;&#x30A2;&#x304C; Emacs &#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x5DE6;&#x53F3;&#x3069;&#x3061;&#x3089;&#x304B;
&#x304B;&#x306E;&#x7AEF;&#x306B;&#x3042;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x4E21;&#x7AEF;&#x306B;&#x306F;&#x540C;&#x3058;&#x304F;&#x7E26;&#x9577;&#x306E;&#x56DB;&#x89D2;&#x3044;&#x300C;&#x30D5;&#x30EA;&#x30F3;&#x30B8;&#x300D;
&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x30A8;&#x30EA;&#x30A2;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;&#x6DF7;&#x4E71;&#x3057;&#x306A;&#x3044;&#x3067;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x30D5;&#x30EA;&#x30F3;&#x30B8;&#x306F;&#x7D99;&#x7D9A;&#x884C;&#x3092;
&#x793A;&#x3059;&#x6587;&#x5B57;&#x3084;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30B7;&#x30F3;&#x30DC;&#x30EB;&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x5834;&#x6240;&#x3067;&#x3059;&#x3002;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x30D0;&#x30FC;&#x306F;&#x5DE6;&#x53F3;&#x3069;&#x3061;
&#x3089;&#x304B;&#x4E00;&#x65B9;&#x306E;&#x307F;&#x306E;&#x4E00;&#x756A;&#x5916;&#x5074;&#x306B;&#x3042;&#x308B;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x30D0;&#x30FC;&#x306E;&#x4E2D;&#x3092;&#x30DE;&#x30A6;&#x30B9;&#x3067;&#x30AF;&#x30EA;&#x30C3;
&#x30AF;&#x3059;&#x308C;&#x3070;&#x3001;&#x753B;&#x9762;&#x3092;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x30D0;&#x30FC;&#x306E;&#x4E2D;&#x3067;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x771F;&#x4E2D;&#x306E;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30DC;&#x30BF;&#x30F3;
   &#x3092;&#x62BC;&#x3057;&#x305F;&#x4F4D;&#x7F6E;&#x3067;&#x6C7A;&#x307E;&#x308B;&#x6587;&#x7AE0;&#x306E;&#x4F4D;&#x7F6E;&#x307E;&#x3067;&#x753B;&#x9762;&#x304C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3057;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x30D0;&#x30FC;&#x306E;&#x4E2D;&#x3067;&#x771F;&#x4E2D;&#x306E;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x62BC;&#x3057;&#x305F;&#x307E;&#x307E;&#x30DE;&#x30A6;&#x30B9;&#x3092;&#x4E0A;&#x4E0B;&#x306B;&#x52D5;&#x304B;&#x3057;&#x3066;
   &#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x308C;&#x306B;&#x5408;&#x305B;&#x3066;&#x753B;&#x9762;&#x304C;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x306E;&#x304C;&#x5206;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;

&#x3082;&#x3057;&#x3001;&#x30DE;&#x30A6;&#x30B9;&#x306B;&#x30DB;&#x30A4;&#x30FC;&#x30EB;&#x30DC;&#x30BF;&#x30F3;&#x304C;&#x3042;&#x308B;&#x306A;&#x3089;&#x3001;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3082;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3067;&#x304D;
&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3053;&#x308C;&#x82F1;&#x8A9E;&#x7248;&#x3060;&#x3068;&#x304B;&#x306A;&#x308A;&#x7C21;&#x7565;&#x5316;&#x3055;&#x308C;&#x3066;&#x308B;&#x306D;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;  </p>
<p><br>  </p>
<pre><code>If you are using a graphical display, such as X or MS-Windows, there
should be a tall rectangular area called a scroll bar on one side of
the Emacs window.  You can scroll the text by clicking the mouse in
the scroll bar.

If your mouse has a wheel button, you can also use this to scroll.  
</code></pre><p>&#x300C;&#x30D5;&#x30EA;&#x30F3;&#x30B8;&#x3068;&#x304B; &quot;&gt;&gt;&quot; &#x306E;&#x90E8;&#x5206;&#x3068;&#x304B;&#x7121;&#x304F;&#x306A;&#x3063;&#x3066;&#x308B;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF0C;&#x6BD4;&#x5982; X &#x6216;&#x8005;&#x5FAE;&#x8F6F;&#x7684; Windows&#xFF0C;&#x90A3;&#x4E48;&#x5728; Emacs&#x7A97;
    &#x53E3;&#x7684;&#x4E00;&#x8FB9;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x5F62;&#x7684;&#x533A;&#x57DF;&#x53EB;&#x201C;&#x6EDA;&#x52A8;&#x6761;&#x201D;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x9F20;&#x6807;&#x64CD;&#x7EB5;&#x6EDA;&#x52A8;&#x6761;&#x6765;&#x6EDA;&#x52A8;
    &#x6587;&#x5B57;&#x3002;

    &#x5982;&#x679C;&#x4F60;&#x7684;&#x9F20;&#x6807;&#x6709;&#x6EDA;&#x8F6E;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6EDA;&#x8F6E;&#x6765;&#x6EDA;&#x52A8;&#x3002;
</code></pre><p>&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x3082;&#x540C;&#x3058;&#x3002;&#x3042;&#xFF0C;&#x6EDA;&#x52A8;&#x306F;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x306E;&#x3053;&#x3068;&#x306D;&#x300D;&#x300C;&#x8AAD;&#x3081;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x8AAD;&#x3081;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x305F;&#x3044;&#x3002;&#x3053;&#x308C;&#x306F;&#x4F55;&#x56DE;&#x3082;&#x51FA;&#x3066;&#x304F;&#x308B;&#x304B;&#x3089;&#x899A;&#x3048;&#x305F;&#x300D;&#x300C;&#x5BFE;&#x8A33;&#x306F;&#x3044;&#x3044;&#x6559;&#x6750;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x306D;&#x3048;&#xFF0C;&#x65E5;&#x672C;&#x8A9E;&#x7248;&#x306E;&#x771F;&#x4E2D;&#x306E;&#x30DC;&#x30BF;&#x30F3;&#x3063;&#x3066;&#xFF0C;UNIX&#x306E;3&#x30DC;&#x30BF;&#x30F3;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x3053;&#x3068;&#x304B;&#x306A;&#xFF1F;&#x3044;&#x3061;&#x304A;&#x3046;&#x30DE;&#x30A6;&#x30B9;&#x30DB;&#x30A4;&#x30FC;&#x30EB;&#x306E;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3067;&#x3082;&#x52D5;&#x304F;&#x3051;&#x3069;&#x300D;&#x300C;3&#x30DC;&#x30BF;&#x30F3;&#x30DE;&#x30A6;&#x30B9;&#x300D;&#x300C;UNIX&#x306B;&#x306F;&#x305D;&#x3046;&#x3044;&#x3046;&#x30DE;&#x30A6;&#x30B9;&#x304C;&#x3042;&#x308B;&#x306E;&#x300D;  </p>
<p><br><br><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/An_Early_Three_Buttoned_Mouse.jpg/1024px-An_Early_Three_Buttoned_Mouse.jpg" alt="Lars Pind"><br>(Lars Pind, <a href="https://commons.wikimedia.org/wiki/File:An_Early_Three_Buttoned_Mouse.jpg" target="_blank">An_Early_Three_Buttoned_Mouse</a>)  </p>
<p>&#x300C;&#x5404;&#x30DC;&#x30BF;&#x30F3;&#x306E;&#x5F79;&#x5272;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x5DE6;&#x53F3;&#x306F;&#x666E;&#x901A;&#x306E;&#x30DE;&#x30A6;&#x30B9;&#x3068;&#x540C;&#x3058;&#x3067;&#xFF0C;&#x4E2D;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x304C;&#x30DA;&#x30FC;&#x30B9;&#x30C8;&#x3060;&#x3063;&#x305F;&#x304B;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x4F7F;&#x3063;&#x305F;&#x3053;&#x3068;&#x3042;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x5B9F;&#x969B;&#x306B;&#x52D5;&#x3044;&#x3066;&#x308B;&#x6A5F;&#x68B0;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B;&#x306A;&#x3041;&#x300D;&#x300C;&#x3055;&#x308F;&#x3063;&#x305F;&#x3053;&#x3068;&#x306F;&#x3042;&#x308B;&#x3093;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x79C1;&#x307F;&#x305F;&#x3044;&#x306A;&#x3078;&#x3063;&#x307D;&#x3053;&#x304C;&#x89E6;&#x3063;&#x3066;&#x3044;&#x3044;&#x4EE3;&#x7269;&#x3067;&#x306F;&#x306A;&#x3044;&#x3068;&#x3055;&#x3068;&#x3063;&#x305F;&#x300D;&#x300C;&#x5927;&#x3052;&#x3055;&#x3060;&#x306A;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#x7D76;&#x5BFE;&#x89E6;&#x3063;&#x3061;&#x3083;&#x3044;&#x3051;&#x306A;&#x3044;&#x3088;&#x3046;&#x306A;&#x6A5F;&#x68B0;&#x306B;&#x3057;&#x304B;&#x3064;&#x3044;&#x3066;&#x306A;&#x3044;&#x3093;&#x3060;&#x3082;&#x3093;&#x3002;&#x307F;&#x3093;&#x306A;&#x9854;&#x6016;&#x3044;&#x3057;&#x300D;&#x300C;&#x3053;&#x306E;&#x5199;&#x771F;&#x3060;&#x3068;&#x6614;&#x306E;&#x3082;&#x306E;&#x306E;&#x3088;&#x3046;&#x3060;&#x304C;&#x4ECA;&#x3067;&#x3082;&#x3042;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x308A;&#x3083;&#x5F53;&#x7136;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x306A;&#x305C;&#x308F;&#x304B;&#x308B;&#x300D;&#x300C;10&#x5E74;&#x7269;&#x306E;&#x541B;&#x304C;&#x5E73;&#x7136;&#x3068;&#x3057;&#x3066;&#x308B;&#x304F;&#x3089;&#x3044;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x2026;&#x305F;&#x3057;&#x304B;&#x306B;&#x306A;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="05.html" class="navigation navigation-prev " aria-label="Previous page: 05 - Move! Move! Move!">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="07.html" class="navigation navigation-next " aria-label="Next page: 07 - 広き世界へ">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"06 - 賢馬は「引数」が読める","level":"3.4","depth":1,"next":{"title":"07 - 広き世界へ","level":"3.5","depth":1,"path":"07.md","ref":"07.md","articles":[]},"previous":{"title":"05 - Move! Move! Move!","level":"3.3","depth":1,"path":"05.md","ref":"05.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"06.md","mtime":"2018-08-13T15:13:59.822Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-15T21:18:57.581Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

