
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>08 - ドレミファ挿入 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="09.html" />
    
    
    <link rel="prev" href="07.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter active" data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >08 - ドレミファ挿入</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="08---&#x30C9;&#x30EC;&#x30DF;&#x30D5;&#x30A1;&#x633F;&#x5165;">08 - &#x30C9;&#x30EC;&#x30DF;&#x30D5;&#x30A1;&#x633F;&#x5165;</h1>
<p>&#x79C1;&#x304C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x9032;&#x3081;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#xFF0C;EeePC&#x304C;&#x6012;&#x9CF4;&#x3063;&#x305F;&#x3002;&#x300C;&#x3053;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#x4F55;&#x3060;&#x3002;&#x3075;&#x3056;&#x3051;&#x3066;&#x308B;&#x306E;&#x304B;&#x300D;&#x79C1;&#x306F;&#x80F8;&#x3092;&#x306F;&#x3063;&#x3066;&#x7B54;&#x3048;&#x308B;&#x3002;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x3067;&#x3059;!&#x300D;  </p>
<p>&#x300C;&#x2026;&#x306F;&#x3041;&#x300D;EeePC&#x306F;&#x305F;&#x3081;&#x606F;&#x3092;&#x3064;&#x3044;&#x305F;&#x3002;&#x300C;&#x5FC3;&#x914D;&#x3057;&#x3066;&#x640D;&#x3057;&#x305F;&#x305E;&#x300D;&#x300C;&#x541B;&#x304C;&#x640D;&#x3057;&#x3066;&#x3082;&#x8AB0;&#x3082;&#x56F0;&#x3089;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x2026;&#x6E05;&#x3005;&#x3057;&#x3044;&#x307E;&#x3067;&#x306E;&#x9B3C;&#x3060;&#x306A;&#xFF0C;&#x541B;&#x306F;&#x300D;&#x300C;&#x305D;&#x308C;&#x306B;&#x3053;&#x3093;&#x306A;&#x5730;&#x5473;&#x306A;&#x3053;&#x3068;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#x304B;&#x3089;&#x3055;&#x3002;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3060;&#x3051;&#x3067;&#x3082;&#x697D;&#x3057;&#x304F;&#x3057;&#x305F;&#x3044;&#x3068;&#x601D;&#x308F;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x307E;&#x3042;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x305D;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x3093;&#x306A;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x633F;&#x5165;&#x3068;&#x524A;&#x9664;
============

&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3057;&#x305F;&#x3051;&#x308C;&#x3070;&#x3001;&#x5358;&#x306B;&#x305D;&#x308C;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;Emacs &#x306F;&#x3001;&#x76EE;&#x306B;&#x898B;&#x3048;&#x308B;
&#x6587;&#x5B57;&#xFF08;A, 7, * &#x7B49;&#xFF09;&#x3092;&#x6587;&#x7AE0;&#x3067;&#x3042;&#x308B;&#x3068;&#x307F;&#x306A;&#x3059;&#x306E;&#x3067;&#x3001;&#x305D;&#x308C;&#x3089;&#x306F;&#x305D;&#x306E;&#x307E;&#x307E;&#x633F;&#x5165;&#x3055;&#x308C;&#x307E;
&#x3059;&#x3002;&lt;Return&gt;&#xFF08;&#x6539;&#x884C;&#x30AD;&#x30FC;&#xFF09;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308C;&#x3070;&#x6539;&#x884C;&#x6587;&#x5B57;&#x304C;&#x633F;&#x5165;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;
</code></pre><p><strong>&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3057;&#x305F;&#x3051;&#x308C;&#x3070;&#x3001;&#x5358;&#x306B;&#x305D;&#x308C;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;</strong>  </p>
<p>&#x300C;&#x5947;&#x5999;&#x306A;&#x8A00;&#x3044;&#x56DE;&#x3057;&#x3060;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x300E;&#x5358;&#x306B;&#x300F;&#x3063;&#x3066;&#xFF0C;&#x307E;&#x308B;&#x3067;&#x4ED6;&#x306E;&#x4F5C;&#x696D;&#x3057;&#x306A;&#x3044;&#x3068;&#x6587;&#x5B57;&#x5165;&#x529B;&#x3067;&#x304D;&#x306A;&#x3044;&#x3088;&#x3046;&#x306A;&#x8A00;&#x3044;&#x65B9;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x305D;&#x308C;&#xFF0C;&#x79C1;&#x305F;&#x3061;&#x3044;&#x3064;&#x3082;&#x3084;&#x3063;&#x3066;&#x308B;&#x3088;&#x300D;&#x300C;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x307B;&#x3089;&#x300D;  </p>
<p><br><br><img src="images/burikaigi.png" alt="burikaigi"><br>(<a href="https://mzp.hatenablog.com/entry/2018/02/04/171050" target="_blank">https://mzp.hatenablog.com/entry/2018/02/04/171050</a> &#x3092;&#x3082;&#x3068;&#x306B;&#x4F5C;&#x6210;)  </p>
<p>&#x300C;&#x79C1;&#x305F;&#x3061;&#x306F;&#x5909;&#x63DB;&#x4F5C;&#x696D;&#x3092;&#x5165;&#x308C;&#x306A;&#x3044;&#x3068;&#x5E73;&#x4EEE;&#x540D;&#x3072;&#x3068;&#x3064;&#x5165;&#x529B;&#x3067;&#x304D;&#x306A;&#x3044;&#x300D;&#x300C;&#x5E73;&#x4EEE;&#x540D;&#x3082;&#x304B;&#x300D;&#x300C;Enter&#x62BC;&#x3059;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x78BA;&#x304B;&#x306B;&#x300D;  </p>
<p>&#x300C;&#x4E00;&#x5FDC;&#x8A00;&#x3063;&#x3066;&#x304A;&#x304F;&#x3068;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x300E;&#x5358;&#x306B;&#x300F;&#x3063;&#x3066;&#x3044;&#x3046;&#x306E;&#x306F;&#xFF0C;1&#x3064;&#x306E;&#x30AD;&#x30FC;&#x304C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x306A;&#x3063;&#x3066;&#x308B;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x304C;&#x3042;&#x308B;&#x304B;&#x3089;&#xFF0C;&#x305D;&#x308C;&#x3078;&#x306E;&#x914D;&#x616E;&#x3060;&#x3068;&#x601D;&#x3046;&#x3002;<a href="http://www.gnu.org/software/ed/manual/ed_manual.html" target="_blank">ed</a>&#x3068;&#x304B;<a href="https://www.vim.org/" target="_blank">vim</a>&#x3068;&#x304B;&#x300D;&#x300C;&#x541B;&#x306F;ed&#x3068;vim&#x306F;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;ed&#x306F;&#x4F7F;&#x3063;&#x305F;&#x3053;&#x3068;&#x306A;&#x3044;&#x3051;&#x3069;vim&#x306F;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;<a href="https://qutebrowser.org/" target="_blank">qutebrowser</a>&#x3060;&#x3063;&#x3066;vim&#x306E;&#x30AD;&#x30FC;&#x30D0;&#x30A4;&#x30F3;&#x30C9;&#x3060;&#x3057;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x76F4;&#x524D;&#x306B;&#x5165;&#x529B;&#x3057;&#x305F;&#x6587;&#x5B57;&#x3092;&#x524A;&#x9664;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&lt;Delback&gt; &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;&lt;Delback&gt;
&#x306F;&#x3001;Emacs &#x4EE5;&#x5916;&#x3067;&#x3001;&#x6700;&#x5F8C;&#x306B;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x305F;&#x6587;&#x5B57;&#x3092;&#x524A;&#x9664;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x3046;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x4E0A;
&#x306E;&#x30AD;&#x30FC;&#x3067;&#x3059;&#x3002;&#x901A;&#x5E38;&#x306F;&#x3001; &lt;Return&gt; &#x30AD;&#x30FC;&#x306E;&#x4E0A;&#x65B9;&#x306B;&#x3042;&#x308B;&#x5927;&#x304D;&#x3081;&#x306E;&#x30AD;&#x30FC;&#x3067;&#x3001;
&quot;Delete&quot; &#x3068;&#x304B; &quot;Del&quot; &#x3068;&#x304B; &quot;Backspace&quot; &#x3068;&#x66F8;&#x3044;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;

&#x3082;&#x3057;&#x3001;&#x305D;&#x306E;&#x305D;&#x308C;&#x304C; &quot;Backspace&quot; &#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x306A;&#x3089;&#x3001;&#x305D;&#x308C;&#x304C; &lt;Delback&gt; &#x30AD;&#x30FC;&#x3067;&#x3059;&#x3002;
&#x305D;&#x306E;&#x5834;&#x5408;&#x3001;&#x4ED6;&#x306E;&#x5834;&#x6240;&#x306B; &quot;Delete&quot; &#x3068;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x30AD;&#x30FC;&#x304C;&#x3042;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;
&#x305D;&#x308C;&#x306F; &lt;Delback&gt; &#x30AD;&#x30FC;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;

&#x3088;&#x308A;&#x4E00;&#x822C;&#x7684;&#x306B;&#x8A00;&#x3046;&#x306A;&#x3089;&#x3001;&lt;Delback&gt; &#x306F;&#x73FE;&#x5728;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306E;&#x3042;&#x308B;&#x4F4D;&#x7F6E;&#x306E;&#x76F4;&#x524D;&#x306E;&#x6587;&#x5B57;&#x3092;
&#x524A;&#x9664;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;Delback&#x3063;&#x3066;&#x8868;&#x73FE;&#x306F;&#x82F1;&#x8A9E;&#x7248;&#x3068;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306B;&#x306F;&#x306A;&#x3044;&#x304B;&#x3089;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x72EC;&#x81EA;&#x306E;&#x8868;&#x73FE;&#x304B;&#xFF0C;&#x6614;&#x306F;&#x3042;&#x3063;&#x305F;&#x306E;&#x304B;&#x3082;&#x3002;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x5C02;&#x7528;&#x6A5F;&#x3060;&#x3068;&#x300E;&#x5F8C;&#x9000;&#x300F;&#x3063;&#x3066;&#x3044;&#x3046;&#x96E3;&#x3057;&#x3044;&#x5B57;&#x306E;&#x30AD;&#x30FC;&#x3060;&#x3063;&#x305F;&#x300D;&#x300C;&#x8AAD;&#x3081;&#x3066;&#x308B;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x6614;&#x306F;&#x8AAD;&#x3081;&#x306A;&#x304B;&#x3063;&#x305F;&#x3093;&#x3060;&#x3088;&#x3002;&#x30ED;&#x30FC;&#x30DE;&#x5B57;&#x66F8;&#x3051;&#x306A;&#x3044;&#x304B;&#x3089;&#x304B;&#x306A;&#x6253;&#x3061;&#x3060;&#x3063;&#x305F;&#x3057;&#x300D;&#x300C;&#x6614;&#x304B;&#x3089;&#x6A5F;&#x68B0;&#x304C;&#x597D;&#x304D;&#x3060;&#x3063;&#x305F;&#x3093;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x3042;&#xFF0C;&#x6700;&#x5F8C;&#x306B;&#x3082;&#x66F8;&#x304B;&#x308C;&#x3066;&#x308B;&#x3051;&#x3069;Delback&#x306F;Backspace&#x306E;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x306E;&#x524D;&#x306E;&#x5B57;&#x3092;&#x6D88;&#x3059;&#x30AD;&#x30FC;&#x3002;&#x3042;&#x3068;4&#x884C;&#x76EE;&#x306E;&#x6587;&#x672B;&#x306F;&#x539F;&#x6587;&#x30DE;&#x30DE;&#x3067;&#x3059;&#x300D;&#x300C;&#x541B;&#x306E;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x306F;Backspace&#x304C;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;&#x30B9;&#x30DE;&#x30DB;&#x3068;&#x540C;&#x3058;&#x8A18;&#x53F7;&#x306B;&#x306A;&#x3063;&#x3066;&#x308B;&#x306D;&#x3002;&#x3053;&#x308C;&#x304B;&#x3089;&#x8A18;&#x53F7;&#x306B;&#x7F6E;&#x304D;&#x63DB;&#x308F;&#x3063;&#x3066;&#x3044;&#x304F;&#x306E;&#x304B;&#x306A;&#xFF1F;&#x300D;  </p>
<p><br>  </p>
<pre><code>&gt;&gt; &#x6587;&#x5B57;&#x3092;&#x3044;&#x304F;&#x3064;&#x304B;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089;&#x305D;&#x308C;&#x3089;&#x3092; &lt;Delback&gt; &#x3092;&#x4F7F;&#x3063;&#x3066;&#x524A;&#x9664;&#x3057;
   &#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x6C17;&#x306B;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x30AA;
   &#x30EA;&#x30B8;&#x30CA;&#x30EB;&#x306E;&#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x5909;&#x66F4;&#x3055;&#x308C;&#x307E;&#x305B;&#x3093;&#x304B;&#x3089;&#x3002;&#x4ECA;&#x898B;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A1;&#x30A4;
   &#x30EB;&#x306F;&#x3042;&#x306A;&#x305F;&#x306E;&#x305F;&#x3081;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3067;&#x3059;&#x3002;

   &#x6587;&#x7AE0;&#x306E;&#x4E00;&#x884C;&#x304C;&#x753B;&#x9762;&#x306B;&#x53CE;&#x307E;&#x3089;&#x306A;&#x3044;&#x7A0B;&#x9577;&#x304F;&#x306A;&#x3063;&#x305F;&#x5834;&#x5408;&#x3001;&#x305D;&#x306E;&#x884C;&#x306F;&#x753B;&#x9762;&#x4E0A;&#x306E;&#x6B21;&#x306E;&#x884C;&#x3078;
   &#x3068;&#x7D99;&#x7D9A;&#xFF08;continued&#xFF09;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x753B;&#x9762;&#x306E;&#x53F3;&#x7AEF;&#xFF08;&#x53F3;&#x5074;&#x306E;&#x30D5;&#x30EA;&#x30F3;&#x30B8;&#x30A8;&#x30EA;&#x30A2;&#xFF09;&#x306E;
   backslash &#x6587;&#x5B57; &#x300C;\&#x300D; &#xFF08;&#x3042;&#x308B;&#x3044;&#x306F;&#x3001;&#x3082;&#x3057;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001;
   &#x5C0F;&#x3055;&#x306A;&#x66F2;&#x3063;&#x305F;&#x77E2;&#x5370;&#xFF09;&#x306F;&#x3001;&#x305D;&#x306E;&#x884C;&#x304C;&#x7D99;&#x7D9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x3092;&#x8868;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x753B;&#x9762;&#x306E;&#x53F3;&#x7AEF;&#x307E;&#x3067;&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3057;&#x3001;&#x3055;&#x3089;&#x306B;&#x5165;&#x529B;&#x3092;&#x7D9A;&#x3051;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x7D99;&#x7D9A;&#x884C;&#x304C;&#x3067;&#x304D;&#x308B;&#x306E;&#x304C;&#x5206;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;

&gt;&gt; &lt;Delback&gt; &#x3092;&#x4F7F;&#x3063;&#x3066;&#xFF11;&#x884C;&#x306B;&#x53CE;&#x307E;&#x308B;&#x3068;&#x3053;&#x308D;&#x307E;&#x3067;&#x73FE;&#x5728;&#x306E;&#x884C;&#x3092;&#x77ED;&#x304F;&#x3057;&#x3066;&#x307F;&#x3066;&#x304F;&#x3060;&#x3055;
   &#x3044;&#x3002;&#x7D99;&#x7D9A;&#x884C;&#x306F;&#x6D88;&#x3048;&#x307E;&#x3059;&#x3002;

   &#x6539;&#x884C;&#x6587;&#x5B57;&#x3082;&#x4ED6;&#x306E;&#x6587;&#x5B57;&#x3068;&#x540C;&#x3058;&#x3088;&#x3046;&#x306B;&#x524A;&#x9664;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#xFF12;&#x3064;&#x306E;&#x884C;&#x306E;&#x9593;&#x306E;&#x6539;&#x884C;&#x6587;&#x5B57;&#x3092;&#x6D88;
   &#x3059;&#x3068;&#x305D;&#x308C;&#x3089;&#x306E;&#x884C;&#x304C;&#x5408;&#x308F;&#x3055;&#x308A;&#xFF11;&#x3064;&#x306E;&#x884C;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x305D;&#x306E;&#x5408;&#x308F;&#x3055;&#x3063;&#x305F;&#x884C;&#x304C;&#x753B;&#x9762;
   &#x306E;&#x5E45;&#x3088;&#x308A;&#x3082;&#x9577;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x7D99;&#x7D9A;&#x884C;&#x3068;&#x306A;&#x3063;&#x3066;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x884C;&#x306E;&#x5148;&#x982D;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x3001;&lt;Delback&gt; &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x73FE;&#x5728;&#x306E;&#x884C;&#x304C;
   &#x305D;&#x306E;&#x524D;&#x306E;&#x884C;&#x3068;&#x3064;&#x306A;&#x304C;&#x308A;&#x307E;&#x3059;&#x3002;

&gt;&gt; &lt;Return&gt; &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x3001;&#x4ECA;&#x524A;&#x9664;&#x3057;&#x305F;&#x6539;&#x884C;&#x6587;&#x5B57;&#x3092;&#x307E;&#x305F;&#x633F;&#x5165;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x5F8C;&#x3067;&#x8AAC;&#x660E;&#x3055;&#x308C;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3051;&#x3069;&#xFF0C;Emacs&#x4F7F;&#x3063;&#x3066;&#x308B;&#x4EBA;&#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306F;Backspace&#x3092; <strong>C-h</strong> &#x306B;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3066;&#x308B;&#x3068;&#x601D;&#x3046;&#x3002;&#x79C1;&#x3082;&#x305D;&#x3046;&#x3002;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x306F;&#x4F7F;&#x3046;&#x3051;&#x3069;Backspace&#x30AD;&#x30FC;&#x81EA;&#x4F53;&#x306F;&#x672C;&#x5F53;&#x306B;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x306A;&#x305C;&#x3060;&#x300D;&#x300C;&#x79C1;&#x306E;&#x624B;&#x304C;&#x5C0F;&#x3055;&#x3044;&#x304B;&#x3089;&#x3002;<a href="https://github.com/k1LoW/emacs-drill-instructor/wiki" target="_blank">&#x9B3C;&#x8ECD;&#x66F9;.el</a>&#x3067;&#x3082;C-h&#x4F7F;&#x3048;&#x3063;&#x3066;&#x3044;&#x3063;&#x3066;&#x308B;&#x3057;&#xFF0C;&#x6700;&#x521D;&#x304B;&#x3089;&#x6163;&#x308C;&#x3066;&#x304A;&#x304F;&#x3068;&#x3044;&#x3044;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x300D;  </p>
<p><br><br>&#x300C;&#x82F1;&#x8A9E;&#x7248;&#x3068;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306F;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x306E;&#x8AAC;&#x660E;&#x304C;&#x8FFD;&#x52A0;&#x3055;&#x308C;&#x3066;&#x308B;&#x300D;  </p>
<pre><code>The &lt;Return&gt; key is special, in that pressing it may do more than
just insert a Newline character.  Depending on the surrounding text,
it may insert whitespace after the Newline character, so that when
you start typing on the newly created line, the text lines up with
that on the previous line.  We call this behavior (where pressing a
key does more than simply inserting the relevant character) &quot;electric&quot;.

&gt;&gt; Here is an example of &lt;Return&gt; being electric.
   Type &lt;Return&gt; at the end of this line.

You should see that after inserting the Newline, Emacs inserts spaces
so that the cursor moves under the &quot;T&quot; of &quot;Type&quot;.
</code></pre><blockquote>
<p>&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x306F;&#x7279;&#x5225;&#x306A;&#x3082;&#x306E;&#x3067;&#xFF0C;&#x5358;&#x306B;&#x6539;&#x884C;&#x6587;&#x5B57;&#x3092;&#x633F;&#x5165;&#x3059;&#x308B;&#x4EE5;&#x4E0A;&#x306E;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x5468;&#x56F2;&#x306E;&#x6587;&#x7AE0;&#x306B;&#x5FDC;&#x3058;&#x3066;&#xFF0C;&#x30EA;&#x30BF;&#x30FC;&#x30F3;&#x30AD;&#x30FC;&#x306F;&#x6539;&#x884C;&#x6587;&#x5B57;&#x306E;&#x3042;&#x3068;&#x306B;&#x7A7A;&#x767D;&#x3092;&#x633F;&#x5165;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#xFF0C;&#x65B0;&#x3057;&#x304F;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x884C;&#x3067;&#x5165;&#x529B;&#x3092;&#x59CB;&#x3081;&#x308B;&#x3068;&#xFF0C;&#x305D;&#x306E;&#x884C;&#x306F;&#x524D;&#x306E;&#x884C;&#x306B;&#x63C3;&#x3048;&#x3089;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x52D5;&#x4F5C; (&#x30AD;&#x30FC;&#x5165;&#x529B;&#x304C;&#x6587;&#x5B57;&#x5165;&#x529B;&#x4EE5;&#x4E0A;&#x306E;&#x52D5;&#x4F5C;&#x3092;&#x3059;&#x308B;&#x3053;&#x3068;) &#x306F;&#x300E;&#x30B7;&#x30D3;&#x308C;&#x308B;&#x300F;&#x3068;&#x547C;&#x3070;&#x308C;&#x307E;&#x3059;&#x3002;  </p>
<p>&gt;&gt;&#xA0;&#xA0; &lt;Return&gt; &#x306E;&#x30B7;&#x30D3;&#x308C;&#x308B;&#x4F8B;&#x3092;&#x8A66;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;<br>&#xA0;&#xA0;&#xA0;&#xA0;&#x3053;&#x306E;&#x884C;&#x672B;&#x3067; &lt;Return&gt; &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;  </p>
<p>&#x65B0;&#x305F;&#x306A;&#x884C;&#x304C;&#x633F;&#x5165;&#x3055;&#x308C;&#x305F;&#x3042;&#x3068;&#xFF0C;Emacs&#x304C;&#x7A7A;&#x767D;&#x3092;&#x633F;&#x5165;&#x3057;&#xFF0C;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x304C;&#x300E;&#x3053;&#x306E;&#x884C;&#x672B;&#x300F;&#x306E;&#x300E;&#x3053;&#x300F;&#x306B;&#x79FB;&#x52D5;&#x3057;&#x305F;&#x306E;&#x304C;&#x308F;&#x304B;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;  </p>
</blockquote>
<p>&#x300C;&quot;electric&quot; &#x3092;&#x300E;&#x30B7;&#x30D3;&#x308C;&#x308B;&#x300F;&#x3068;&#x8A33;&#x3057;&#x305F;&#x304B;&#x300D;&#x300C;<a href="https://www.emacswiki.org/emacs/Electricity" target="_blank">Emacs Wiki</a>&#x3060;&#x3068;&#x300E;&#x30AF;&#x30BD;&#x4FBF;&#x5229;&#x300F;&#x306A;&#x6C17;&#x304C;&#x5229;&#x304F;&#x6A5F;&#x80FD;&#x3092; &quot;electric&quot; &#x3068;&#x3044;&#x3046;&#x3089;&#x3057;&#x3044;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306B;&#x305D;&#x306E;&#x4E00;&#x6587;&#x306F;&#x306A;&#x304F;&#x3066;&#xFF0C;&#x30C9;&#x30A4;&#x30C4;&#x8A9E;&#x3068;&#x30D8;&#x30D6;&#x30E9;&#x30A4;&#x8A9E;&#x306B;&#x306F;&#x3042;&#x3063;&#x305F;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;  </p>
<p><br>  </p>
<pre><code>Emacs &#x306E;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3001;&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x306E;&#x56DE;&#x6570;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x3092;&#x601D;&#x3044;&#x51FA;&#x3057;&#x3066;
&#x4E0B;&#x3055;&#x3044;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x6587;&#x5B57;&#x306E;&#x633F;&#x5165;&#x306B;&#x3064;&#x3044;&#x3066;&#x3082;&#x5F53;&#x3066;&#x306F;&#x307E;&#x308A;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-u 8 * &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068; ******** &#x304C;&#x633F;&#x5165;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x8A66;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;&#x6065;&#x305A;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x4ECA;&#x307E;&#x3067;&#x3053;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x5FD8;&#x308C;&#x3066;&#x304A;&#x308A;&#x307E;&#x3057;&#x305F;&#x300D;&#x300C;&#x30AD;&#x30FC;&#x62BC;&#x3057;&#x3063;&#x3071;&#x306A;&#x3057;&#x306B;&#x3057;&#x3066;&#x305F;&#x3093;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x3072;&#x3068;&#x3064;&#x9032;&#x6B69;&#x3057;&#x305F;&#x306A;&#x300D;&#x300C;&#x306F;&#x3044;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="07.html" class="navigation navigation-prev " aria-label="Previous page: 07 - 広き世界へ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="09.html" class="navigation navigation-next " aria-label="Next page: 09 - ことばダイエット">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"08 - ドレミファ挿入","level":"4.1","depth":1,"next":{"title":"09 - ことばダイエット","level":"4.2","depth":1,"path":"09.md","ref":"09.md","articles":[]},"previous":{"title":"07 - 広き世界へ","level":"3.5","depth":1,"path":"07.md","ref":"07.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"08.md","mtime":"2018-08-14T07:02:31.704Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-14T14:26:43.492Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

