
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>09 - ことばダイエット · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10.html" />
    
    
    <link rel="prev" href="08.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="21.html">
            
                <a href="21.html">
            
                    
                    21 - 答えは目の前にある
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="22.html">
            
                <a href="22.html">
            
                    
                    22 - 旅立ち
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >09 - ことばダイエット</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="09---&#x3053;&#x3068;&#x3070;&#x30C0;&#x30A4;&#x30A8;&#x30C3;&#x30C8;">09 - &#x3053;&#x3068;&#x3070;&#x30C0;&#x30A4;&#x30A8;&#x30C3;&#x30C8;</h1>
<p>&#x3052;&#x3063;&#x305D;&#x308A;&#x3057;&#x305F;&#x79C1;&#x306B;EeePC&#x304C;&#x9A5A;&#x304F;&#x3002;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x5927;&#x4E08;&#x592B;&#x304B;&#x3002;&#x307E;&#x305F;&#x4F53;&#x8ABF;&#x5D29;&#x3057;&#x305F;&#x304B;&#xFF1F;&#x300D;&#x79C1;&#x306F;&#x53E3;&#x3060;&#x3051;&#x3067;&#x7B54;&#x3048;&#x308B;&#x3002;&#x300C;&#x2026;&#x9055;&#x3046;&#x306E;&#x3002;&#x8A00;&#x8449;&#x306E;&#x610F;&#x5473;&#x8ABF;&#x3079;&#x3066;&#x308F;&#x304B;&#x3089;&#x306A;&#x304F;&#x306A;&#x3063;&#x305F;&#x306E;&#x300D;&#x300C;&#x8A00;&#x8449;&#x306E;&#x610F;&#x5473;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x2026;&#x5C11;&#x3057;&#x5148;&#x306E;&#x6587;&#x7AE0;&#x306B;&#x306A;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x300C;&#x6D88;&#x53BB;&#xFF08;kill&#xFF09;&#x300D;&#x3068;&#x300C;&#x524A;&#x9664;&#xFF08;delete&#xFF09;&#x300D;&#x306E;&#x9055;&#x3044;&#x306B;&#x6C17;&#x3092;&#x3064;&#x3051;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x6D88;&#x53BB;&#x3057;&#x305F;
    &#x6587;&#x7AE0;&#x306F;&#x518D;&#x5EA6;&#xFF08;&#x3069;&#x3053;&#x306B;&#x3067;&#x3082;&#xFF09;&#x633F;&#x5165;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x3001;&#x524A;&#x9664;&#x3057;&#x305F;&#x3082;&#x306E;&#x306F;&#x518D;&#x5EA6;&#x633F;&#x5165;&#x3059;&#x308B;&#x3053;&#x3068;
    &#x306F;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;  
</code></pre><p>&#x300C;&#x4F55;&#x304C;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x6D88;&#x53BB;&#x3068;&#x524A;&#x9664;&#x306E;&#x9055;&#x3044;&#x2026;&#x300D;&#x300C;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x3068;&#x304A;&#x308A;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x3067;&#x3082;<a href="https://www.taishukan.co.jp/book/b197673.html" target="_blank">&#x660E;&#x93E1;&#x56FD;&#x8A9E;&#x8F9E;&#x5178;</a>&#x3060;&#x3068;&#x300E;&#x6D88;&#x53BB;&#x300F;&#x306F;&#x300E;&#x6D88;&#x3057;&#x3066;&#x306A;&#x304F;&#x3059;&#x3053;&#x3068;&#x300F;&#x3063;&#x3066;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x306E;&#x2026;&#x3002;&#x2026;&#x306A;&#x3093;&#x304B;&#x518D;&#x5EA6;&#x633F;&#x5165;&#x3067;&#x304D;&#x306A;&#x3044;&#x611F;&#x3058;&#x3057;&#x306A;&#x3044;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x524A;&#x9664;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x300E;&#x6587;&#x7AE0;&#x306A;&#x3069;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x3051;&#x305A;&#x308A;&#x3068;&#x308B;&#x3053;&#x3068;&#x300F;&#x300D;&#x300C;&#x305D;&#x308C;&#x306A;&#x3089;&#x308F;&#x304B;&#x308B;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x3069;&#x3046;&#x3057;&#x3088;&#x3046;&#x2026;&#x300D;&#x79C1;&#x304C;&#x982D;&#x3092;&#x62B1;&#x3048;&#x308B;&#x3002;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x3093;&#x3060;&#x308D;&#x3046;&#x2026;&#x300D;EeePC&#x304C;&#x6025;&#x3044;&#x3067;&#x8A00;&#x3046;&#x3002;&#x300C;&#x3042;&#x308F;&#x3066;&#x308B;&#x306A;&#x3002;&#x5C11;&#x3057;&#x843D;&#x3061;&#x7740;&#x3053;&#x3046;&#x3002;&#x6A5F;&#x80FD;&#x306E;&#x9055;&#x3044;&#x306F;&#x308F;&#x304B;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x305F;&#x308A;&#x307E;&#x3048;&#x3058;&#x3083;&#x3093;&#x2026;&#x300D;&#x300C;&#x3060;&#x306A;&#x2026;&#x300D;&#x300C;&#x304F;&#x3060;&#x3089;&#x306A;&#x3044;&#x3053;&#x3068;&#x805E;&#x304B;&#x306A;&#x3044;&#x3067;&#x3088;&#x2026;&#x300D;&#x300C;&#x3059;&#x2026;&#x3059;&#x307E;&#x3093;&#x2026;&#x300D;  </p>
<p>EeePC&#x306F;&#x6012;&#x308A;&#x305F;&#x3044;&#x885D;&#x52D5;&#x3092;&#x3053;&#x3089;&#x3048;&#xFF0C;&#x512A;&#x3057;&#x304F;&#x8A00;&#x3046;&#x3002;&#x300C;&#x3068;&#xFF0C;&#x3068;&#x308A;&#x3042;&#x3048;&#x305A;&#x4ED6;&#x306E;&#x6587;&#x732E;&#x306B;&#x3042;&#x305F;&#x308D;&#x3046;&#x304B;&#x3002;<a href="https://ayatakesi.github.io/emacs/26.1/html/Deletion-and-Killing.html#Deletion-and-Killing" target="_blank">&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x306E;&#x65E5;&#x672C;&#x8A9E;&#x8A33;</a>&#x3067;&#x306F;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x65E5;&#x672C;&#x8A9E;&#x8A33;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x300D;&#x300C;&#x3048;&#x3048;&#x3068;&#x2026;&#x300D;  </p>
<p><br>  </p>
<blockquote>
<p>&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30FC;&#x304B;&#x3089;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x6D88;&#x53BB;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x591A;&#x304F;&#x306F;&#x3001;&#x305D;&#x308C;&#x3092;kill&#x30EA;&#x30F3;&#x30B0;(Kill Ring&#x3092;&#x53C2;&#x7167;)&#x306B;&#x4FDD;&#x5B58;&#x3057;&#x307E;&#x3059;&#x3002;  </p>
</blockquote>
<p><br>  </p>
<blockquote>
<p>&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x3092;&#x6D88;&#x53BB;&#x3057;&#x3066;kill&#x30EA;&#x30F3;&#x30B0;&#x306B;&#x4FDD;&#x5B58;&#x3057;&#x306A;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3001;&#x524A;&#x9664;(delete)&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3068;&#x3057;&#x3066;&#x77E5;&#x3089;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x540D;&#x524D;&#x306B;&#x2018;delete&#x2019;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;  </p>
</blockquote>
<p>&#x300C;&#x3075;&#x3080;&#x3002;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x5B9A;&#x7FA9;&#x306B;&#x5F93;&#x3063;&#x3066;&#x3044;&#x308B;&#x306A;&#x300D;&#x300C;&#x3046;&#x3046;&#x2026;&#x300D;&#x79C1;&#x306E;&#x76EE;&#x304C;&#x6F64;&#x3080;&#x3002;  </p>
<p>&#x300C;&#x2026;&#x305D;&#x3046;&#x3060;!&#x300D;EeePC&#x304C;&#x308F;&#x3056;&#x3068;&#x3089;&#x3057;&#x304F;&#x3072;&#x3089;&#x3081;&#x3044;&#x305F;&#x3088;&#x3046;&#x306B;&#x5927;&#x58F0;&#x3092;&#x51FA;&#x3059;&#x3002;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306F;&#x3069;&#x3046;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#xFF1F;&#x300D;&#x300C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306E;delete&#x3068;kill&#x306E;&#x5B9A;&#x7FA9;&#x3060;&#x3088;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x305D;&#x3046;&#x304B;&#x2026;&#x300D;&#x300C;&#x307B;&#x3089;&#xFF0C;&#x5143;&#x6C17;&#x51FA;&#x305B;&#x3002;&#x5927;&#x4E08;&#x592B;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x3046;&#x3093;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x201C;&#x5220;&#x9664;&#xFF08;delete&#xFF09;&#x201D;&#x548C;&#x201C;&#x79FB;&#x9664;&#xFF08;kill&#xFF09;&#x201D;&#x7684;&#x7528;&#x8BCD;&#x533A;&#x522B;
</code></pre><p>&#x300C;&#x3048;&#x3048;&#x3068;&#xFF0C;&#x5220;&#x9664;&#x306F;&#x300E;&#x524A;&#x9664;&#x300F;&#x2026;&#x3002;&#x79FB;&#x9664;&#x306F;&#xFF0C;&#x300E;&#x53D6;&#x308A;&#x9664;&#x304D;&#x307E;&#x3059;&#x300F;&#x2026;&#x300D;&#x300C;&#x9006;&#x3060;&#x306A;&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x3059;&#x3050;&#x306B;&#x8F9E;&#x66F8;&#x3092;&#x3072;&#x304F;&#x3002;&#x300C;&#x2026;&#x660E;&#x93E1;&#x3060;&#x3068;&#xFF0C;&#x300E;&#x53D6;&#x308A;&#x9664;&#x304F;&#x300F;&#x306F;&#x300E;&#x4E0D;&#x8981;&#x306A;&#x3082;&#x306E;&#x3092;&#x53D6;&#x3063;&#x3066;&#x306A;&#x304F;&#x3059;&#x3002;&#x53D6;&#x308A;&#x53BB;&#x308B;&#x300F;&#x3063;&#x3066;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x2026;&#x3053;&#x308C;&#x3060;&#x3063;&#x305F;&#x3089;&#x2026;&#x5F8C;&#x3067;&#x623B;&#x3059;&#x3063;&#x3066;&#x3044;&#x3046;&#x306E;&#x3082;&#x308F;&#x304B;&#x308B;&#x300D;&#x300C;&#x305D;&#x308C;&#x3058;&#x3083;&#x3042;&#x3053;&#x308C;&#x304B;&#x3089;&#x306F;&#x305D;&#x306E;&#x7406;&#x89E3;&#x3067;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x3081;&#x3060;&#x3088;&#x2026;&#x3060;&#x3063;&#x3066;&#x79C1;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3084;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x3082;&#x3093;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x3050;&#x2026;&#x300D;EeePC&#x306F;&#x300E;&#x3081;&#x3093;&#x3069;&#x304F;&#x305B;&#x3048;&#x306A;&#x3053;&#x3044;&#x3064;&#x2026;&#x300F;&#x3068;&#x8A00;&#x3044;&#x305F;&#x3044;&#x6C17;&#x6301;&#x3061;&#x3092;&#x3053;&#x3089;&#x3048;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x307E;&#x3060;&#x3060;!&#x300D;EeePC&#x304C;&#x3055;&#x3051;&#x3076;&#x3002;&#x300C;<a href="https://www.oreilly.co.jp/books/9784873112770/" target="_blank">&#x5165;&#x9580; GNU Emacs</a>!&#x541B;&#xFF0C;&#x6301;&#x3063;&#x3066;&#x3044;&#x305F;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3046;&#xFF0C;&#x3046;&#x3093;&#x300D;&#x300C;&#x305D;&#x308C;&#x3060;&#x3068;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x300D;&#x300C;&#x3048;&#x2026;&#x300D;&#x300C;&#x305D;&#x3053;&#x306B;&#x7B54;&#x3048;&#x304C;&#x3042;&#x308B;&#x306F;&#x305A;&#x3060;&#x3002;&#x63A2;&#x3057;&#x3060;&#x3057;&#x3066;&#x304F;&#x308C;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x3046;&#x3093;&#x3002;&#x3061;&#x3087;&#x3063;&#x3068;&#x5F85;&#x3063;&#x3066;&#x2026;&#x300D;&#x79C1;&#x304C;&#x68DA;&#x3092;&#x3054;&#x305D;&#x3054;&#x305D;&#x3068;&#x63A2;&#x3057;&#xFF0C;&#x672C;&#x3092;&#x63A2;&#x3057;&#x3060;&#x3059;&#x3002;&#x76EE;&#x6B21;&#x304B;&#x3089;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x307E;&#x3067;&#x3081;&#x304F;&#x3063;&#x305F;&#x3002;  </p>
<p><br>  </p>
<blockquote>
<p>&#x884C;&#x5358;&#x4F4D;&#x3067;&#x306E;&#x524A;&#x9664;&#x3092;&#x884C;&#x3044;&#x305F;&#x3044;&#x5834;&#x5408;&#x306B;&#x306F;&#xFF0C; <strong>C-k</strong> (Emacs&#x30B3;&#x30DE;&#x30F3;&#x30C9; kill-line) &#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059; (p. 27)  </p>
</blockquote>
<p>&#x300C;&#x3075;&#x3080;&#x3002;kill&#x306B;&#x3082;&#x300E;&#x524A;&#x9664;&#x300F;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x308F;&#x3051;&#x3060;&#x306A;&#x3002;&#x672C;&#x306E;&#x8A33;&#x8005;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x76E3;&#x8A33;&#x8005;&#x306F;&#x2026;&#x534A;&#x7530;&#x5148;&#x751F;&#x3002;Emacs&#x306B;&#x591A;&#x8A00;&#x8A9E;&#x51E6;&#x7406;&#x3092;&#x5B9F;&#x88C5;&#x3057;&#x305F;&#x795E;&#x69D8;&#x2026;&#x300D;&#x300C;&#x304F;&#xFF0C;&#x8A73;&#x3057;&#x3044;&#x306A;&#x3002;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x307B;&#x3046;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#xFF1F;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x8A33;&#x8005;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x8A00;&#x308F;&#x308C;&#x308B;&#x307E;&#x307E;&#x306B;&#x691C;&#x7D22;&#x3059;&#x308B;&#x3002;&#x300C;<a href="http://git.savannah.gnu.org/cgit/emacs.git/commit/?id=137e547d38d73097d82571745e954fcf4c18def9" target="_blank">&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306E;&#x8A33;&#x8005;</a>&#x3082;&#x2026;&#x534A;&#x7530;&#x5148;&#x751F;&#x300D;  </p>
<p>&#x300C;&#x306A;&#x3089;&#x5B89;&#x5FC3;&#x3060;&#x300D;EeePC&#x304C;&#x8A00;&#x3044;&#x5207;&#x308B;&#x3002;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;&#x300D;&#x300C;&#x6A5F;&#x80FD;&#x306E;&#x533A;&#x5225;&#x306F;&#x91CD;&#x8981;&#x3060;&#x304C;&#xFF0C;&#x65E5;&#x672C;&#x8A9E;&#x3068;&#x306E;&#x5BFE;&#x5FDC;&#x306F;&#x91CD;&#x8981;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3089;&#x3060;&#x3002;&#x79C1;&#x305F;&#x3061;&#x304C;&#x300E;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x300F;&#x3068;&#x8A00;&#x3046;&#x3068;&#x304D;&#xFF0C;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x306F;&#x3082;&#x306F;&#x3084;&#x96F2;&#x3058;&#x3083;&#x306A;&#x3044;&#x3002;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x7528;&#x8A9E;&#x3060;&#x3002;&#x541B;&#x306F;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x610F;&#x5473;&#x304B;&#x3089;&#x5224;&#x65AD;&#x3057;&#x305F;&#x305B;&#x3044;&#x3067;&#x6DF7;&#x4E71;&#x3057;&#x305F;&#x304C;&#xFF0C;&#x3053;&#x308C;&#x306F;Emacs&#x306E;&#x6A5F;&#x80FD;&#x306B;&#x719F;&#x8A9E;&#x3092;&#x3042;&#x3066;&#x3066;&#x3044;&#x308B;&#x306B;&#x3059;&#x304E;&#x3093;&#x3002;&#x3080;&#x3057;&#x308D;&#x5B89;&#x6613;&#x306A;&#x76F4;&#x8A33;&#x3067;&#x6DF7;&#x4E71;&#x3092;&#x62DB;&#x3044;&#x305F;&#x308A;&#xFF0C;&#x30AB;&#x30BF;&#x30AB;&#x30CA;&#x8A9E;&#x306E;&#x307E;&#x307E;&#x3067;&#x904B;&#x7528;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x300E;&#x30EB;&#x30FC;&#x5927;&#x67F4;&#x3058;&#x3083;&#x306D;&#x3048;&#x304B;&#x300F;&#x306A;&#x3093;&#x3066;&#x63F6;&#x63C4;&#x3055;&#x308C;&#x305A;&#x306B;&#x6E08;&#x3093;&#x3067;&#x3088;&#x304B;&#x3063;&#x305F;&#xFF0C;&#x305D;&#x3046;&#x8003;&#x3048;&#x3088;&#x3046;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x305D;&#xFF0C;&#x305D;&#x3046;&#x304B;&#x306A;&#x2026;&#x300D;&#x79C1;&#x306E;&#x8868;&#x60C5;&#x304C;&#x548C;&#x3089;&#x3050;&#x3002;&#x300C;&#x305D;&#x3046;&#x3060;&#x3002;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3067;&#x300E;&#x6D88;&#x53BB;&#x300F;&#x3068;&#x300E;&#x524A;&#x9664;&#x300F;&#x304C;&#x308F;&#x3056;&#x308F;&#x3056;&#x30AB;&#x30C3;&#x30B3;&#x3067;&#x304F;&#x304F;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x304C;&#x4F55;&#x3088;&#x308A;&#x306E;&#x8A3C;&#x62E0;&#x3060;&#x3002;&#x65E5;&#x672C;&#x8A9E;&#x901A;&#x308A;&#x306E;&#x610F;&#x5473;&#x306A;&#x3089;&#x305D;&#x3093;&#x306A;&#x3053;&#x3068;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306A;&#x3044;&#x304B;&#x3089;&#x306A;&#x300D;&#x300C;&#x305F;&#x3057;&#x304B;&#x306B;&#x2026;&#x300D;  </p>
<p>EeePC&#x306F;&#x8AAC;&#x5F97;&#x306B;&#x624B;&#x5FDC;&#x3048;&#x3092;&#x611F;&#x3058;&#xFF0C;&#x6700;&#x5F8C;&#x306E;&#x4E00;&#x62BC;&#x3057;&#x3092;&#x3057;&#x305F;&#x3002;&#x300C;&#x672C;&#x3067;&#x306F;delete&#x3082;kill&#x3082;&#x300E;&#x524A;&#x9664;&#x300F;&#x3067;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x308B;&#x308F;&#x3051;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x6A5F;&#x80FD;&#x3055;&#x3048;&#x7406;&#x89E3;&#x3057;&#x3066;&#x3044;&#x308C;&#x3070;&#x5927;&#x4E08;&#x592B;!&#x300D;  </p>
<p>&#x300C;&#x305D;&#xFF0C;&#x305D;&#x3046;&#x304B;&#x306A;&#x2026;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x3002;&#x79C1;&#x3092;&#x4FE1;&#x3058;&#x308D;&#x300D;&#x300C;&#x3046;&#xFF0C;&#x3046;&#x3093;&#x3002;&#x2026;&#x3042;&#x308A;&#x304C;&#x3068;&#x306D;&#x300D;  </p>
<p>&#x305D;&#x3046;&#x3057;&#x3066;EeePC&#x304C;&#x4E00;&#x606F;&#x3064;&#x3044;&#x305F;&#xFF0C;&#x6B21;&#x306E;&#x77AC;&#x9593;&#x3060;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x3042;&#x3042;&#x3063;&#x300D;&#x79C1;&#x306F;&#x6025;&#x306B;&#x60B2;&#x9CF4;&#x3092;&#x3042;&#x3052;&#x305F;&#x3002;&#x300C;&#x3069;&#xFF0C;&#x3069;&#x3046;&#x3057;&#x305F;&#x300D;&#x300C;&#x672C;&#x306E;&#x7D22;&#x5F15;&#x3067;&#x2026;&#x300E;&#x524A;&#x9664;: &#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x304B;&#x3089;&#x53D6;&#x308A;&#x9664;&#x304F;&#x3053;&#x3068;&#x3002;&#x30AD;&#x30EB;&#x30EA;&#x30F3;&#x30B0;&#x306B;&#x306F;&#x4FDD;&#x7BA1;&#x3055;&#x308C;&#x306A;&#x3044;&#x300F;&#x3063;&#x3066;&#x66F8;&#x3044;&#x3066;&#x3042;&#x308B;&#x2026;&#x533A;&#x5225;&#x2026;&#x3057;&#x3066;&#x308B;&#x2026;&#x3088;&#x2026;&#x300D;  </p>
<p>EeePC&#x3092;&#x6CE3;&#x304D;&#x305D;&#x3046;&#x306A;&#x9854;&#x3067;&#x898B;&#x4E0A;&#x3052;&#xFF0C;&#x4EE5;&#x524D;&#x306B;&#x3082;&#x5897;&#x3057;&#x3066;&#x602F;&#x3048;&#x308B;&#x79C1;&#x3002;&#x300E;&#x7D22;&#x5F15;&#x8AAD;&#x3080;&#x306A;&#x3093;&#x3066;&#xFF0C;&#x4F59;&#x8A08;&#x306A;&#x3053;&#x3068;&#x3092;&#x2026;&#x300F;&#x305D;&#x3046;&#x8A00;&#x3044;&#x305F;&#x3044;&#x306E;&#x3092;&#x3053;&#x3089;&#x3048;&#xFF0C;EeePC&#x306F;&#x305D;&#x308C;&#x304B;&#x3089;&#x3057;&#x3070;&#x3089;&#x304F;&#x79C1;&#x3092;&#x52B1;&#x307E;&#x3059;&#x3053;&#x3068;&#x306B;&#x5168;&#x6027;&#x80FD;&#x3092;&#x5272;&#x304F;&#x3053;&#x3068;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;  </p>
<p><br><br>&#x7D50;&#x5C40;&#xFF0C;&#x79C1;&#x305F;&#x3061;&#x306F;&#x30CD;&#x30C3;&#x30C8;&#x3067;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x7528;&#x8A9E;&#x306E;&#x5272;&#x5408;&#x3092;&#x3082;&#x3068;&#x306B;&#xFF0C;delete&#x3092;&#x524A;&#x9664;&#xFF0C;kill&#x3092;&#x30AD;&#x30EB;&#x3068;&#x3057;&#x3066;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x9032;&#x3081;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08.html" class="navigation navigation-prev " aria-label="Previous page: 08 - ドレミファ挿入">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10.html" class="navigation navigation-next " aria-label="Next page: 10 - お前を消す88の方法">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"09 - ことばダイエット","level":"4.2","depth":1,"next":{"title":"10 - お前を消す88の方法","level":"4.3","depth":1,"path":"10.md","ref":"10.md","articles":[]},"previous":{"title":"08 - ドレミファ挿入","level":"4.1","depth":1,"path":"08.md","ref":"08.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"09.md","mtime":"2018-08-14T14:28:11.768Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T15:30:04.230Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

