
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>11 - お前を元に戻す1つの方法 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12.html" />
    
    
    <link rel="prev" href="10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >11 - お前を元に戻す1つの方法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="11---&#x304A;&#x524D;&#x3092;&#x5143;&#x306B;&#x623B;&#x3059;1&#x3064;&#x306E;&#x65B9;&#x6CD5;">11 - &#x304A;&#x524D;&#x3092;&#x5143;&#x306B;&#x623B;&#x3059;1&#x3064;&#x306E;&#x65B9;&#x6CD5;</h1>
<p>&#x300C;&#x300E;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x304A;&#x524D;&#x3068;&#x6226;&#x3046;&#x3053;&#x3068;&#x3060;!&#x300F;&#x771F;&#x69CD;&#x30B8;&#x30E3;&#x30E9;&#x30C4;&#x3092;&#x69CB;&#x3048;&#xFF0C;&#x30F4;&#x30A7;&#x30EA;&#x30AA;&#x306F;&#x543C;&#x3048;&#x305F;&#x3002;&#x305D;&#x306E;&#x77DB;&#x5148;&#x306F;&#xFF0C;&#x4ECA;&#x3084;&#x6975;&#x7114;&#x306E;&#x9B54;&#x795E;&#x3068;&#x5316;&#x3057;&#x305F;&#x30B7;&#x30D0;&#x30DE;&#x30EB;&#x306B;&#x5411;&#x3051;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x4E92;&#x3044;&#x306B;&#x6D41;&#x308C;&#x308B;&#x6C88;&#x9ED9;&#x3002;&#x3059;&#x308B;&#x3068;&#x305D;&#x306E;&#x3068;&#x304D;&#xFF0C;&#x8056;&#x970A;&#x304C;&#x6700;&#x5F8C;&#x306E;&#x9418;&#x3092;&#x9CF4;&#x3089;&#x3057;&#xFF0C;&#x300D;  </p>
<p>&#x300C;&#x76DB;&#x308A;&#x4E0A;&#x304C;&#x308B;&#x306E;&#x306F;&#x3044;&#x3044;&#x304B;&#x3089;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x9032;&#x3081;&#x3088;&#x3046;&#x304B;&#x300D;&#x8AAD;&#x66F8;&#x3092;&#x697D;&#x3057;&#x3080;&#x79C1;&#x306B;&#xFF0C;EeePC&#x304C;&#x6C34;&#x3092;&#x5DEE;&#x3059;&#x3002;&#x300C;&#x3048;&#x3048;&#x30FC;&#x3002;&#x3053;&#x308C;&#x304B;&#x3089;&#x3044;&#x3044;&#x3068;&#x3053;&#x308D;&#x306A;&#x306E;&#x306B;&#x300D;&#x300C;&#x4F55;&#x304C;&#x3044;&#x3044;&#x3068;&#x3053;&#x306A;&#x3093;&#x3060;&#x3002;&#x307E;&#x3060;&#x534A;&#x5206;&#x3082;&#x9032;&#x3093;&#x3067;&#x2026;&#x300D;&#x300C;&#x3053;&#x308C;&#x304B;&#x3089;&#x4E8C;&#x4EBA;&#x306E;&#x6700;&#x5F8C;&#x306E;&#x6226;&#x3044;&#x304C;&#x59CB;&#x307E;&#x308B;&#x3063;&#x3066;&#x3068;&#x304D;&#x306B;&#xFF0C;&#x6700;&#x5F8C;&#x306E;&#x5BE9;&#x5224;&#x304C;&#x59CB;&#x307E;&#x3063;&#x3061;&#x3083;&#x3046;&#x3093;&#x3060;&#x3088;!&#x300D;&#x300C;&#x6700;&#x5F8C;&#x306E;&#x5BE9;&#x5224;&#xFF1F;&#x300D;  </p>
<p>&#x8A00;&#x3063;&#x3066;EeePC&#x306F;&#x5F8C;&#x6094;&#x3057;&#x305F;&#x3002;&#x300C;&#x6975;&#x661F;&#x795E;&#x306F;&#x611A;&#x304B;&#x306A;&#x4EBA;&#x985E;&#x3068;&#x3082;&#x3069;&#x3082;&#x4E16;&#x754C;&#x3092;&#x6EC5;&#x307C;&#x305D;&#x3046;&#x3068;&#x3057;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x30AB;&#x30F3;&#x30CA;&#x306E;&#x8AAC;&#x5F97;&#x306B;&#x5FDC;&#x3058;&#x3066;&#xFF0C;&#x7336;&#x4E88;&#x3092;&#x4E03;&#x65E5;&#x9593;&#x3060;&#x3051;&#x4E0E;&#x3048;&#x305F;&#x306E;&#x3002;&#x305D;&#x308C;&#x3060;&#x3051;&#x306E;&#x4FA1;&#x5024;&#x3092;&#x793A;&#x3057;&#x3066;&#x307F;&#x308D;&#xFF0C;&#x3063;&#x3066;&#x306D;&#x3002;&#x305D;&#x308C;&#x3067;&#x30F4;&#x30A7;&#x30EA;&#x30AA;&#x305F;&#x3061;&#x306F;&#x53CD;&#x7406;&#x306E;&#x6CD5;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x6642;&#x9593;&#x306E;&#x6D41;&#x308C;&#x3092;&#x7DE9;&#x3084;&#x304B;&#x306B;&#x3057;&#x3066;&#xFF0C;&#x306A;&#x3093;&#x3068;&#x304B;&#x5FC3;&#x9B54;&#x4E03;&#x8056;&#xFF0C;&#x3064;&#x307E;&#x308A;&#x5E7B;&#x5922;&#x754C;&#x306E;&#x30A2;&#x30A4;&#x30B7;&#x30E3;&#xFF0C;&#x5E7B;&#x9B3C;&#x754C;&#x306E;&#x30A4;&#x30AA;&#xFF0C;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x305D;&#x306E;&#x8A71;&#x306F;&#x4ECA;&#x5EA6;&#x805E;&#x3053;&#x3046;&#x300D;&#x300C;&#x30C0;&#x30E1;&#x3060;&#x3088;!&#x4ECA;&#xFF0C;&#x5341;&#x4E09;&#x60D1;&#x661F;&#x304C;&#x534A;&#x5F27;&#x3092;&#x63CF;&#x3044;&#x3066;&#x5FC3;&#x9B54;&#x306E;&#x529B;&#x304C;&#x5F31;&#x307E;&#x3063;&#x3066;&#x308B;&#x304B;&#x3089;&#x3053;&#x305D;&#x5012;&#x305B;&#x308B;&#x306E;&#x306B;!&#x4E00;&#x4EBA;&#x4E00;&#x4EBA;&#x304C;&#x4E09;&#x6226;&#x795E;&#x3068;&#x540C;&#x3058;&#x304F;&#x3089;&#x3044;&#x306E;&#x529B;&#x3092;&#x6301;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x3088;&#xFF1F;&#x305D;&#x308C;&#x3067;&#x3082;&#x306A;&#x3093;&#x3068;&#x304B;&#x4E03;&#x67F1;&#x5012;&#x3057;&#x305F;&#x306F;&#x305A;&#x306A;&#x306E;&#x306B;&#x5996;&#x6C17;&#x304C;&#x304A;&#x3055;&#x307E;&#x3089;&#x306A;&#x3044;&#x306E;&#x3002;&#x306A;&#x3093;&#x3067;&#x304B;&#x308F;&#x304B;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x3044;&#x3084;&#x300D;&#x300C;&#x5FC3;&#x9B54;&#x4E03;&#x8056;&#x306B;&#x306F;&#x306A;&#x3093;&#x3068;!&#x516B;&#x67F1;&#x76EE;&#x304C;&#x3044;&#x305F;&#x3093;&#x3060;&#x3088;!&#x300D;&#x300C;&#x2026;&#x3042;&#xFF0C;&#x3042;&#x3042;&#x300D;&#x300C;&#x3057;&#x304B;&#x3082;&#x305D;&#x308C;&#x304C;&#x3082;&#x3046;&#x9A5A;&#x3044;&#x305F;&#x306E;&#x306A;&#x3093;&#x306E;&#x3063;&#x3066;&#xFF0C;&#x2026;&#x8AB0;&#x3060;&#x304B;&#x308F;&#x304B;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x3044;&#xFF0C;&#x3044;&#x3084;&#xFF0C;&#x308F;&#x304B;&#x308A;&#x305F;&#x304F;&#x3082;&#x306A;&#x2026;&#x300D;&#x300C;&#x3042;&#x306E;&#x30B7;&#x30D0;&#x30DE;&#x30EB;&#x3060;&#x3063;&#x305F;&#x3093;&#x3060;&#x3088;!&#x4E09;&#x6226;&#x795E;&#x3068;&#x306E;&#x6226;&#x3044;&#x3067;&#x6B7B;&#x3093;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x305F;&#x3042;&#x306E;&#x30B7;&#x30D0;&#x30DE;&#x30EB;&#x304C;!&#x3082;&#x3046;&#x79C1;&#x5B09;&#x3057;&#x304F;&#x3063;&#x3066;&#x3002;&#x3067;&#x3082;&#x306D;&#x2026;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x304B;&#x3089;EeePC&#x306F;&#x307F;&#x3063;&#x3061;&#x308A;&#x3068;&#x300E;&#x6975;&#x661F;&#x51CC;&#x96F2;&#x8A18;&#x300F;&#x306E;&#x9B45;&#x529B;&#x3092;&#x805E;&#x304B;&#x3055;&#x308C;&#xFF0C;&#x305D;&#x306E;CPU&#x306F;&#x898B;&#x4E8B;&#x306B;&#x51B7;&#x3048;&#x5207;&#x3063;&#x305F;&#x3002;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x53D6;&#x308A;&#x6D88;&#x3057;(UNDO)
================

&#x3082;&#x3057;&#x3001;&#x6587;&#x7AE0;&#x3092;&#x5909;&#x66F4;&#x3057;&#x305F;&#x5F8C;&#x3067;&#x305D;&#x306E;&#x5909;&#x66F4;&#x306F;&#x9593;&#x9055;&#x3044;&#x3060;&#x3063;&#x305F;&#x3068;&#x601D;&#x3063;&#x305F;&#x3089;&#x3001;&#x53D6;&#x308A;&#x6D88;&#x3057;
&#xFF08;undo&#xFF09;&#x30B3;&#x30DE;&#x30F3;&#x30C9; C-x u &#x3067;&#x305D;&#x306E;&#x5909;&#x66F4;&#x3092;&#x53D6;&#x308A;&#x6D88;&#x3059;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x2026;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x4F55;&#x304B;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x5225;&#x306B;&#x300D;&#x300C;&#x541B;&#x306F;C-x u&#x3092;&#x4F7F;&#x3063;&#x3066;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;&#x308F;&#x304B;&#x308B;&#x306E;&#x300D;&#x300C;&#x305D;&#x308C;&#x304F;&#x3089;&#x3044;&#x30AD;&#x30FC;&#x5165;&#x529B;&#x3092;&#x898B;&#x3066;&#x3044;&#x308C;&#x3070;&#x308F;&#x304B;&#x308B;&#x300D;&#x300C;&#x3044;&#x3064;&#x3082;&#x76E3;&#x8996;&#x3057;&#x3066;&#x308B;&#x306E;&#xFF1F;&#x30D8;&#x30F3;&#x30BF;&#x30A4;&#x300D;&#x300C;&#x3082;&#x3046;&#xFF0C;&#x6A5F;&#x5ACC;&#x3092;&#x76F4;&#x3057;&#x3066;&#x304F;&#x308C;&#x3088;&#x3002;&#x3059;&#x307E;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;&#x4ECA;&#x5EA6;&#x304B;&#x3089;&#x306F;&#x3061;&#x3083;&#x3093;&#x3068;&#x8A71;&#x3092;&#x805E;&#x304F;&#x304B;&#x3089;&#x300D;&#x300C;&#x2026;&#x307B;&#x3093;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x7D04;&#x675F;&#x3059;&#x308B;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x901A;&#x5E38;&#x3001;C-x u &#x306F;&#x4E00;&#x3064;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x3088;&#x308B;&#x5909;&#x66F4;&#x3092;&#x53D6;&#x308A;&#x6D88;&#x3057;&#x307E;&#x3059;&#x3002;&#x7D9A;&#x3051;&#x3066;&#x4F55;&#x5EA6;&#x3082; C-x
u &#x3092;&#x884C;&#x3048;&#x3070;&#x305D;&#x306E;&#x305F;&#x3073;&#x306B;&#x4E00;&#x3064;&#x524D;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x53D6;&#x308A;&#x6D88;&#x3057;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;

&#x305F;&#x3060;&#x3057;&#x3053;&#x308C;&#x306B;&#x306F;&#x4F8B;&#x5916;&#x304C;&#x4E8C;&#x3064;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x307E;&#x305A;&#x3001;&#x6587;&#x7AE0;&#x3092;&#x5909;&#x66F4;&#x3057;&#x306A;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x53D6;&#x308A;
&#x6D88;&#x3057;&#x306B;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x79FB;&#x52D5;&#x3084;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x305D;&#x308C;&#x306B;&#x5F53;&#x305F;&#x308A;&#x307E;&#x3059;&#x3002;
&#x305D;&#x308C;&#x304B;&#x3089;&#x3001;&#x6587;&#x5B57;&#x306E;&#x633F;&#x5165;&#xFF08;&#x81EA;&#x5DF1;&#x633F;&#x5165;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#xFF09;&#x306F; 20 &#x500B;&#x4E00;&#x307E;&#x3068;&#x3081;&#x3067;&#x6271;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;
&#x3053;&#x308C;&#x306F;&#x6587;&#x5B57;&#x306E;&#x633F;&#x5165;&#x3092;&#x53D6;&#x308A;&#x6D88;&#x3059;&#x305F;&#x3081;&#x306E; C-x u &#x306E;&#x56DE;&#x6570;&#x3092;&#x6E1B;&#x3089;&#x3059;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;

&gt;&gt; &#x3053;&#x306E;&#x884C;&#x3092;C-k&#x3067;&#x6D88;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x305D;&#x3057;&#x3066;&#x3001;C-x u &#x3067;&#x623B;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x79C1;&#x306F;C-x u&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B; <strong>C-/</strong> &#x3092;&#x4F7F;&#x3046;&#x3002;&#x9023;&#x6253;&#x3067;&#x304D;&#x308B;&#x304B;&#x3089;&#x4FBF;&#x5229;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x9593;&#x9055;&#x3063;&#x3066;&#x30A2;&#x30F3;&#x30C9;&#x30A5; (undo) &#x3057;&#x3061;&#x3083;&#x3063;&#x305F;&#x3068;&#x304D;&#x3082;&#x53D6;&#x308A;&#x6D88;&#x3057;&#x3067;&#x304D;&#x3066;&#xFF0C;redo&#x3063;&#x3066;&#x3044;&#x3046;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C; <strong>C-g C-/</strong> &#x3067;redo&#x3067;&#x304D;&#x308B;&#x300D;&#x300C;C-g&#x306F;&#x56F0;&#x3063;&#x305F;&#x3068;&#x304D;&#x306E;C-g&#x304B;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x305D;&#x3002;&#x53D6;&#x308A;&#x6D88;&#x3057;&#x3092;&#x53D6;&#x308A;&#x6D88;&#x3059;&#x3063;&#x3066;&#x611F;&#x3058;&#x3002;&#x3055;&#x3089;&#x306B;&#x9593;&#x9055;&#x3063;&#x3066;redo&#x3057;&#x3061;&#x3083;&#x3063;&#x305F;&#x3068;&#x304D;&#x3082;C-g C-/&#x3067;&#x5143;&#x306B;&#x623B;&#x305B;&#x308B;&#x300D;  </p>
<p><br>  </p>
<pre><code>C-_ &#x3082;&#x53D6;&#x308A;&#x6D88;&#x3057;&#xFF08;undo&#xFF09;&#x3092;&#x884C;&#x306A;&#x3046;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;&#x6A5F;&#x80FD;&#x306F;&#x3001;C-x u &#x3068;&#x540C;&#x3058;&#x3067;&#x3059;&#x304C;&#x3001;
&#x7D9A;&#x3051;&#x3066;&#x4F55;&#x5EA6;&#x3082;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3088;&#x308A;&#x4FBF;&#x5229;&#x3067;&#x3059;&#x3002;C-_ &#x306E;&#x554F;&#x984C;&#x306F;&#x3001;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x3088;&#x3063;
&#x3066;&#x306F;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x306E;&#x304B;&#x5206;&#x308A;&#x3065;&#x3089;&#x3044;&#x4E8B;&#x3067;&#x3059;&#x3002;&#x3060;&#x304B;&#x3089; C-x u &#x304C;&#x3042;&#x308B;&#x306E;&#x3067;
&#x3059;&#x3002;&#x7AEF;&#x672B;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x3001;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x62BC;&#x3057;&#x305F;&#x307E;&#x307E; / &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068; C-_
&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x305F;&#x3053;&#x3068;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;

C-_ &#x3084; C-x u &#x306F;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3092;&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x56DE;&#x6570;&#x3068;&#x89E3;&#x91C8;&#x3057;&#x307E;&#x3059;&#x3002;

&#x6587;&#x7AE0;&#x306E;&#x524A;&#x9664;&#x3082;&#x6587;&#x7AE0;&#x306E;&#x6D88;&#x53BB;&#x3068;&#x540C;&#x69D8;&#x306B;&#x53D6;&#x308A;&#x6D88;&#x305B;&#x307E;&#x3059;&#x3002;&#x524A;&#x9664;&#x3068;&#x6D88;&#x53BB;&#x306E;&#x9055;&#x3044;&#x306F;&#x518D;&#x5165;&#x3067;&#x304D;
&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x306E;&#x9055;&#x3044;&#x3060;&#x3051;&#x3067;&#x3001;&#x53D6;&#x308A;&#x6D88;&#x3057;&#x306B;&#x306F;&#x95A2;&#x4FC2;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;
</code></pre><p>&#x300C;&#x30A2;&#x30F3;&#x30C9;&#x30A5;&#x3082;C-u&#x3067;&#x304D;&#x308B;&#x307F;&#x305F;&#x3044;&#x300D;&#x300C;C-u 8 C-/&#x307F;&#x305F;&#x3044;&#x306B;&#x304B;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x4ECA;&#x3084;&#x3063;&#x305F;&#x3089;&#x3067;&#x304D;&#x305F;&#x300D;  </p>
<p><br><br>&#x300C;&#x6B21;&#x306E;&#x9805;&#x76EE;&#x306F;&#x300E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x300F;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x4ECA;&#x56DE;&#x306F;&#x3053;&#x3053;&#x307E;&#x3067;&#x306B;&#x3057;&#x3066;&#x304A;&#x3053;&#x3046;&#x304B;&#x300D;&#x300C;&#x3046;&#x3080;&#x3002;&#x2026;&#x305D;&#x3046;&#x3044;&#x3048;&#x3070;&#x541B;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3068;&#x306F;&#x4F55;&#x3060;&#xFF0C;&#x3068;&#x805E;&#x304B;&#x308C;&#x305F;&#x3089;&#x3069;&#x3046;&#x7B54;&#x3048;&#x308B;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x3046;&#x3093;&#xFF0C;&#x305D;&#x308C;&#x305A;&#x3063;&#x3068;&#x524D;&#x304B;&#x3089;&#x8003;&#x3048;&#x3066;&#x305F;&#x3093;&#x3060;&#x300D;&#x300C;&#x524D;&#x304B;&#x3089;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3002;&#x66F8;&#x985E;&#xFF0C;&#x3063;&#x3066;&#x3044;&#x3046;&#x8868;&#x73FE;&#x306F;&#x3082;&#x3046;&#x9069;&#x3055;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x52D5;&#x753B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3068;&#x304B;&#x3042;&#x308B;&#x3057;&#x300D;&#x300C;&#x78BA;&#x304B;&#x306B;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x3082;&#x3063;&#x3068;&#x62BD;&#x8C61;&#x7684;&#x306B;&#xFF0C;&#x300E;&#x610F;&#x5473;&#x306E;&#x3042;&#x308B;&#x60C5;&#x5831;&#x306E;&#x5358;&#x4F4D;&#x300F;&#x306E;&#x3053;&#x3068;&#x3060;&#x3088;&#xFF0C;&#x3063;&#x3066;&#x8A00;&#x3063;&#x3066;&#x7406;&#x89E3;&#x3057;&#x3066;&#x304F;&#x308C;&#x305F;&#x3089;&#x3044;&#x3044;&#x306A;&#xFF0C;&#x3068;&#x601D;&#x3063;&#x3066;&#x307E;&#x3059;&#x3002;&#x3042;&#x3063;&#x3066;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x3051;&#x3069;&#x300D;&#x300C;&#x60C5;&#x5831;&#x306E;&#x5358;&#x4F4D;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x60C5;&#x5831;&#x306F;&#x30D0;&#x30E9;&#x30D0;&#x30E9;&#x306E;&#x307E;&#x307E;&#x3058;&#x3083;&#x4F55;&#x306E;&#x5F79;&#x306B;&#x3082;&#x305F;&#x305F;&#x306A;&#x3044;&#x3002;&#x3060;&#x304B;&#x3089;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#xFF0C;&#x60C5;&#x5831;&#x3092;&#x307E;&#x3068;&#x3081;&#x305F;&#x3082;&#x306E;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3063;&#x3066;&#x3044;&#x3046;&#x306E;&#x3002;&#x3069;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3075;&#x3080;&#xFF0C;&#x3067;&#x306F;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x306F;&#x3069;&#x3046;&#x306A;&#x308B;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3082;&#x3069;&#x3093;&#x3069;&#x3093;&#x5897;&#x3048;&#x3066;&#x3044;&#x304F;&#x3068;&#xFF0C;&#x3042;&#x308B;&#x7A0B;&#x5EA6;&#x30EB;&#x30FC;&#x30EB;&#x306B;&#x306E;&#x3063;&#x3068;&#x3063;&#x3066;&#x5206;&#x3051;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x51FA;&#x3066;&#x304F;&#x308B;&#x304B;&#x3089;&#xFF0C;&#x305D;&#x306E;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x3082;&#x3068;&#x306B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4ED5;&#x5206;&#x3051;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x3092;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x3063;&#x3066;&#x3044;&#x3046;&#x3093;&#x3060;&#x3002;&#x306A;&#x3093;&#x3066;&#x306D;&#x300D;  </p>
<p>&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3082;&#x30D5;&#x30A9;&#x30EB;&#x30C0;&#x3082;&#x4EBA;&#x9593;&#x304C;&#x51E6;&#x7406;&#x3057;&#x3084;&#x3059;&#x3044;&#x3088;&#x3046;&#x60C5;&#x5831;&#x3092;&#x307E;&#x3068;&#x3081;&#x3066;&#x3044;&#x308B;&#x3060;&#x3051;&#x3067;&#xFF0C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3060;&#x3063;&#x305F;&#x3089;&#x4F55;&#x767E;&#x30AE;&#x30AC;&#x3082;&#x3042;&#x308B;1&#x500B;&#x306E;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306E;&#x307E;&#x307E;&#x81EA;&#x7531;&#x81EA;&#x5728;&#x306B;&#x51E6;&#x7406;&#x3067;&#x304D;&#x308B;&#x3002;&#x3067;&#x3082;&#x305D;&#x308C;&#x3060;&#x3068;&#x4EBA;&#x9593;&#x304B;&#x3089;&#x306F;&#x308F;&#x304B;&#x308A;&#x306B;&#x304F;&#x3044;&#x304B;&#x3089;&#xFF0C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x65E5;&#x4ED8;&#x3054;&#x3068;&#x306B;&#x5206;&#x3051;&#x305F;&#x308A;&#xFF0C;&#x3082;&#x3057;&#x304F;&#x306F;&#x30D0;&#x30E9;&#x30D0;&#x30E9;&#x306A;&#x60C5;&#x5831;&#x306B;ID&#x3092;&#x7D10;&#x3065;&#x3051;&#x3057;&#x3066;1&#x3064;&#x306B;&#x307E;&#x3068;&#x3081;&#x305F;&#x308A;&#x3059;&#x308B;&#x300D;  </p>
<p>&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x306A;&#x3002;&#x2026;&#x3075;&#x3080;&#x3002;&#x79C1;&#x306F;&#x7D0D;&#x5F97;&#x3057;&#x305F;&#x300D;&#x300C;&#x307B;&#x3093;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5F79;&#x5272;&#x3059;&#x3079;&#x3066;&#x3092;&#x30AB;&#x30D0;&#x30FC;&#x3057;&#x305F;&#x8AAC;&#x660E;&#x3068;&#x306F;&#x601D;&#x308F;&#x306A;&#x3044;&#x304C;&#x300D;&#x300C;&#x3060;&#x3088;&#x306D;&#x300D;&#x300C;&#x3060;&#x304C;&#x541B;&#x304C;&#x81EA;&#x5206;&#x306A;&#x308A;&#x306B;&#x8AD6;&#x7406;&#x7684;&#x306A;&#x8A00;&#x8449;&#x3092;&#x4F5C;&#x308D;&#x3046;&#x3068;&#x3059;&#x308B;&#xFF0C;&#x305D;&#x306E;&#x59FF;&#x52E2;&#x306F;&#x304B;&#x3051;&#x304C;&#x3048;&#x306E;&#x306A;&#x3044;&#x3053;&#x3068;&#x3060;&#x3068;&#x79C1;&#x306F;&#x8003;&#x3048;&#x308B;&#x300D;&#x300C;&#x3046;&#xFF0C;&#x306A;&#x3093;&#x304B;&#x306F;&#x305A;&#x304B;&#x3057;&#x3044;&#x306A;&#x300D;&#x300C;&#x304A;&#x305D;&#x3089;&#x304F;&#x541B;&#x304C;&#x4EE5;&#x524D;&#xFF0C;&#x524A;&#x9664;&#x3068;&#x6D88;&#x53BB;&#x306E;&#x9055;&#x3044;&#x3067;&#x6DF7;&#x4E71;&#x3057;&#x305F;&#x306E;&#x3082;&#xFF0C;&#x81EA;&#x5206;&#x306E;&#x4E2D;&#x3067;&#x7406;&#x89E3;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x305F;&#x304B;&#x3089;&#x3060;&#x308D;&#x3046;&#x3002;&#x305D;&#x308C;&#x3067;&#x541B;&#x306F;&#x82E6;&#x3057;&#x3093;&#x3060;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x3051;&#x308C;&#x3069;&#x3082;&#xFF0C;&#x308F;&#x304B;&#x308D;&#x3046;&#x3068;&#x3059;&#x308B;&#x3053;&#x3068;&#xFF0C;&#x8AD6;&#x7406;&#x3092;&#x7D44;&#x307F;&#x7ACB;&#x3066;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x3053;&#x3068;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x3068;&#x3066;&#x3082;&#x5927;&#x4E8B;&#x306A;&#x3053;&#x3068;&#x306A;&#x3093;&#x3060;&#x3002;&#x541B;&#x306F;&#x826F;&#x3044;&#x3053;&#x3068;&#x3092;&#x3057;&#x305F;&#x3093;&#x3060;&#x3088;&#x3002;&#x3060;&#x304B;&#x3089;&#x3082;&#x3063;&#x3068;&#x81EA;&#x5206;&#x306B;&#x81EA;&#x4FE1;&#x3092;&#x3082;&#x3063;&#x3066;&#x307B;&#x3057;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x3042;&#x308A;&#x304C;&#x3068;&#x3046;&#x3002;&#x306A;&#x3093;&#x3060;&#x304B;&#x3046;&#x308C;&#x3057;&#x3044;&#x306A;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10.html" class="navigation navigation-prev " aria-label="Previous page: 10 - お前を消す88の方法">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12.html" class="navigation navigation-next " aria-label="Next page: 12 - アポクリファイル">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"11 - お前を元に戻す1つの方法","level":"4.4","depth":1,"next":{"title":"12 - アポクリファイル","level":"5.1","depth":1,"path":"12.md","ref":"12.md","articles":[]},"previous":{"title":"10 - お前を消す88の方法","level":"4.3","depth":1,"path":"10.md","ref":"10.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"11.md","mtime":"2018-08-15T13:07:05.864Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T09:17:13.044Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

