
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>12 - アポクリファイル · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter active" data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >12 - アポクリファイル</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="12---&#x30A2;&#x30DD;&#x30AF;&#x30EA;&#x30D5;&#x30A1;&#x30A4;&#x30EB;">12 - &#x30A2;&#x30DD;&#x30AF;&#x30EA;&#x30D5;&#x30A1;&#x30A4;&#x30EB;</h1>
<p>&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x6700;&#x5F8C;&#x307E;&#x3067;&#x78BA;&#x8A8D;&#x3057;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x300E;&#x30B3;&#x30D4;&#x30FC;&#x300F;&#x306B;&#x3042;&#x305F;&#x308B;&#x6A5F;&#x80FD;&#x304C;&#x89E3;&#x8AAC;&#x3055;&#x308C;&#x3066;&#x306A;&#x304B;&#x3063;&#x305F;&#x306E;&#x3067;&#x3053;&#x3053;&#x3067;&#x7D39;&#x4ECB;&#x3057;&#x3066;&#x304A;&#x304D;&#x307E;&#x3059;&#x300D;&#x300C;&#x3088;&#x308D;&#x3057;&#x304F;&#x300D;&#x300C; <strong>&#x3059;&#x3054;&#x304F;&#x91CD;&#x8981;&#x3067;&#x3059;</strong> &#x300D;&#x300C;&#x304A;&#x2026;&#x304A;&#x3046;&#x300D;  </p>
<pre><code>    &#x30DE;&#x30FC;&#x30AF;&#x958B;&#x59CB;: C-SPC

    &#x9069;&#x5F53;&#x306B;&#x7BC4;&#x56F2;&#x6307;&#x5B9A;

    &#x30AB;&#x30C3;&#x30C8;: C-w
    &#x30B3;&#x30D4;&#x30FC;: M-w
</code></pre><p>&#x300C;&#x4EE5;&#x4E0A;&#x3067;&#x3059;&#x300D;&#x300C;&#x30B3;&#x30D4;&#x30FC;&#x306E;&#x5834;&#x5408;&#x306F;C-&#x304C;M-&#x306B;&#x7F6E;&#x304D;&#x63DB;&#x308F;&#x3063;&#x305F;&#x3060;&#x3051;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x3042;&#x3068;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x306F;&#x540C;&#x3058;&#x3002;C-y&#x3067;&#x8CBC;&#x308A;&#x4ED8;&#x3051; (yank) &#x3068;&#x304B;&#xFF0C;&#x30AD;&#x30EB;&#x30EA;&#x30F3;&#x30B0;&#x3082;&#x30AB;&#x30C3;&#x30C8;&#x3068;&#x30B3;&#x30D4;&#x30FC;&#x306F;&#x5171;&#x6709;&#x3067;&#x3059;&#x300D;&#x300C;&#x3088;&#x3057;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#xFF0C;C-SPC&#x3082;C-g&#x3067;&#x30AD;&#x30E3;&#x30F3;&#x30BB;&#x30EB;&#x3067;&#x304D;&#x308B;&#x306E;&#x306F;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3088;&#x306D;&#xFF1F;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3067;&#x306F;&#x66F8;&#x304B;&#x308C;&#x3066;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;&#x305C;&#x3072;&#x899A;&#x3048;&#x3066;&#x304A;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x300D;  </p>
<p><br><br>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306E;&#x610F;&#x5473;&#x304C;&#x5168;&#x304F;&#x308F;&#x304B;&#x3089;&#x3093;&#x306E;&#x3060;&#x304C;&#x300D;&#x300C;&#x30A2;&#x30DD;&#x30AF;&#x30EA;&#x30D5;&#x30A1;&#x306F;&#x30C7;&#x30A4;&#x30C9;&#x30E9;&#x306E;&#x541B;&#x4E3B;&#x30FB;Hermaeus Mora&#x304C;&#x652F;&#x914D;&#x3059;&#x308B;&#x9818;&#x57DF;&#x306E;&#x540D;&#x524D;&#x3002;&#x77E5;&#x8B58;&#x3092;&#x6C42;&#x3081;&#x308B;&#x8005;&#x306F;&#x3044;&#x305A;&#x308C;&#x30A2;&#x30DD;&#x30AF;&#x30EA;&#x30D5;&#x30A1;&#x306B;&#x305F;&#x3069;&#x308A;&#x3064;&#x304D;&#xFF0C;&#x3084;&#x304C;&#x3066;&#x72C2;&#x6C17;&#x306B;&#x3068;&#x3089;&#x308F;&#x308C;&#x3066;&#x982D;&#x304C;&#x304A;&#x304B;&#x3057;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x306C;&#x300D;&#x300C;&#x307E;&#x3059;&#x307E;&#x3059;&#x308F;&#x304B;&#x3089;&#x3093;&#x3002;&#x7AE0;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#xFF1F;&#x300D;&#x300C;<a href="https://ja.wikiquote.org/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%83%89%E3%83%AA%E3%83%92%E3%83%BB%E3%83%8B%E3%83%BC%E3%83%81%E3%82%A7" target="_blank">&#x6DF1;&#x6DF5;&#x3063;&#x3066;&#x3044;&#x3063;&#x3064;&#x3082;&#x8997;&#x304B;&#x308C;&#x3066;&#x3070;&#x304B;&#x308A;&#x3060;&#x304B;&#x3089;</a>&#x300D;&#x300C;&#x2026;&#x7279;&#x306B;&#x610F;&#x5473;&#x306F;&#x306A;&#x3044;&#x3093;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x8A9E;&#x5442;&#x304C;&#x3088;&#x304F;&#x3066;&#x305D;&#x308C;&#x3063;&#x307D;&#x3044;&#x306E;&#x3092;&#x3064;&#x3051;&#x3066;&#x308B;&#x3060;&#x3051;&#x3002;&#x3060;&#x3063;&#x3066;&#x8AB0;&#x3082;&#x7AE0;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306A;&#x3093;&#x3066;&#x898B;&#x306A;&#x3044;&#x3082;&#x3093;&#x300D;&#x300C;&#x60B2;&#x3057;&#x3044;&#x3053;&#x3068;&#x3044;&#x3046;&#x306A;&#x3088;&#x2026;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;
==========

&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3044;&#x308B;&#x6587;&#x7AE0;&#x3092;&#x6052;&#x4E45;&#x7684;&#x306A;&#x7269;&#x306B;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x305D;&#x308C;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x4FDD;&#x5B58;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;
&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3055;&#x3082;&#x306A;&#x3044;&#x3068;&#x3001;Emacs &#x306E;&#x7D42;&#x4E86;&#x3068;&#x540C;&#x6642;&#x306B;&#x305D;&#x308C;&#x306F;&#x306A;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3044;&#x307E;&#x3059;&#x3002;
&#x6587;&#x7AE0;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#xFF08;&#x4FDD;&#x5B58;&#xFF09;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x524D;&#x306B;&#x3001;&#x307E;&#x305A;&#x30D5;&#x30A1;&#x30A4;
&#x30EB;&#x3092;&#x958B;&#x304B;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#xFF08;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092; &quot;visit&quot; &#x3059;&#x308B;&#x3068;&#x3082;&#x8A00;&#x3044;&#x307E;&#x3059;&#xFF09;&#x3002;

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F; (find) &#x3068;&#x306F;&#x3001;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x4E2D;&#x8EAB;&#x3092; Emacs &#x3067;&#x898B;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;
&#x5473;&#x3057;&#x307E;&#x3059;&#x3002;&#x8272;&#x3005;&#x306A;&#x610F;&#x5473;&#x3067;&#x3001;&#x305D;&#x308C;&#x306F;&#x3042;&#x306A;&#x305F;&#x304C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x81EA;&#x8EAB;&#x3092;&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x306E;&#x69D8;
&#x3067;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;Emacs &#x3067;&#x884C;&#x3046;&#x5909;&#x66F4;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x8FC4;&#x306F;&#x6052;&#x4E45;&#x7684;&#x306A;&#x3082;&#x306E;&#x3068;
&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x305D;&#x308C;&#x3092;&#x671B;&#x307E;&#x306A;&#x3044;&#x306E;&#x306B;&#x3001;&#x9014;&#x4E2D;&#x307E;&#x3067;&#x5909;&#x66F4;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x6B8B;&#x308B;
&#x306E;&#x3092;&#x907F;&#x3051;&#x308B;&#x305F;&#x3081;&#x3067;&#x3059;&#x3002;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x5F8C;&#x3067;&#x3055;&#x3048;&#x3001;&#x5909;&#x66F4;&#x3057;&#x305F;&#x3082;&#x306E;&#x304C;&#x9593;&#x9055;&#x3063;&#x3066;&#x3044;&#x305F;&#x6642;&#x306E;
&#x305F;&#x3081;&#x306B;&#x3001;&#x5143;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x540D;&#x524D;&#x3092;&#x5909;&#x3048;&#x3066;&#x6B8B;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;

&#x753B;&#x9762;&#x306E;&#x4E00;&#x756A;&#x4E0B;&#x8FD1;&#x304F;&#x306B;&#x3001;&quot;-J:-- TUTORIAL.ja&quot; &#x306E;&#x69D8;&#x306A;&#x6587;&#x5B57;&#x5217;&#x3067;&#x59CB;&#x307E;&#x308A; &quot;----&quot; &#x3067;
&#x7D42;&#x3063;&#x3066;&#x3044;&#x308B;&#x884C;&#x304C;&#x3042;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;&#x901A;&#x5E38;&#x306F;&#x753B;&#x9762;&#x306E;&#x3053;&#x306E;&#x90E8;&#x5206;&#x306B;&#x73FE;&#x5728;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A1;&#x30A4;
&#x30EB;&#x306E;&#x540D;&#x524D;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x4ECA;&#x306F; &quot;TUTORIAL.ja&quot; &#x3068;&#x3044;&#x3046;&#x540D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF08;&#x3053;
&#x308C;&#x306F; Emacs &#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x306E;&#x3042;&#x306A;&#x305F;&#x7528;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3067;&#x3059;&#xFF09;&#x3092;&#x958B;&#x3044;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;Emacs &#x3067;
&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#x3068;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x304C;&#x3053;&#x306E;&#x90E8;&#x5206;&#x306B;&#x73FE;&#x308C;&#x307E;&#x3059;&#x3002;

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#x305F;&#x3081;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3053;&#x308C;&#x307E;&#x3067;&#x5B66;&#x3093;&#x3060;&#x3082;&#x306E;&#x3068;&#x306F;&#x9055;&#x3044;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;
&#x524D;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x308C;&#x3092;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x300C;&#x7AEF;&#x672B;&#x304B;&#x3089;&#x5F15;&#x6570;&#x3092;&#x8AAD;&#x307F;&#x8FBC;
&#x3080;&#x300D;&#x3068;&#x8A00;&#x3044;&#x307E;&#x3059;&#x3002;&#x4ECA;&#x306E;&#x5834;&#x5408;&#x306F;&#x5F15;&#x6570;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3067;&#x3059;&#x3002;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;

      C-x C-f   &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F; (find)

&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068;&#x3001;Emacs &#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3092;&#x805E;&#x3044;&#x3066;&#x304D;&#x307E;&#x3059;&#x3002;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;
&#x306F;&#x753B;&#x9762;&#x306E;&#x6700;&#x4E0B;&#x884C;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x6700;&#x4E0B;&#x884C;&#x306F;&#x3001;&#x3053;&#x3046;&#x3044;&#x3046;&#x5165;&#x529B;&#x306E;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x3063;&#x3066;
&#x3044;&#x308B;&#x6642;&#x306F;&#x3001;&#x30DF;&#x30CB;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;&#x901A;&#x5E38;&#x306E;&#x7DE8;&#x96C6;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3092;&#x7DE8;&#x96C6;
&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x4F55;&#x304B;&#x8A00;&#x3046;&#x3053;&#x3068;&#x306F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x300E;&#x6B69;&#x304F;&#x3068;&#x306F;&#x4F55;&#x304B;&#x300F;&#x306B;&#x3064;&#x3044;&#x3066;&#x8AAC;&#x660E;&#x3055;&#x308C;&#x3066;&#x308B;&#x611F;&#x3058;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x81EA;&#x5206;&#x306E;&#x306A;&#x304B;&#x3067;&#x975E;&#x8A00;&#x8A9E;&#x7684;&#x306B;&#x7406;&#x89E3;&#x3057;&#x3066;&#x3044;&#x308B;&#x3082;&#x306E;&#x3092;&#x76F8;&#x624B;&#x306B;&#x4F1D;&#x3048;&#x308B;&#x306E;&#x304C;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x5927;&#x5909;&#x304B;&#xFF0C;&#x3053;&#x308C;&#x8AAD;&#x3080;&#x3068;&#x4F1D;&#x308F;&#x3063;&#x3066;&#x304F;&#x308B;&#x300D;&#x300C;&#x307B;&#x3046;&#x3002;&#x3069;&#x3046;&#x5927;&#x5909;&#x306A;&#x3093;&#x3060;&#x300D;&#x300C;&#x4F1D;&#x3048;&#x305F;&#x3044;&#x60C5;&#x5831;&#x306E;&#x6838;&#x3092;&#x62BD;&#x51FA;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x62BD;&#x8C61;&#x5316;&#x3068;&#xFF0C;&#x6BD4;&#x55A9;&#x3092;&#x307E;&#x3058;&#x3048;&#x3066;&#x76F8;&#x624B;&#x306B;&#x4F1D;&#x3048;&#x308B;&#x305F;&#x3081;&#x306E;&#x5177;&#x4F53;&#x5316;&#x3002;&#x76F8;&#x53CD;&#x3059;&#x308B;&#x4E8C;&#x3064;&#x306E;&#x6280;&#x8853;&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x306A;&#x3044;&#x3068;&#x81EA;&#x5206;&#x306E;&#x8A00;&#x3044;&#x305F;&#x3044;&#x3053;&#x3068;&#x304C;&#x76F8;&#x624B;&#x306B;&#x4F1D;&#x3048;&#x3089;&#x308C;&#x306A;&#x304F;&#x3066;&#xFF0C;&#x3059;&#x3054;&#x304F;&#x5927;&#x5909;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x3067;&#x3082;&#xFF0C;&#x79C1;&#x306F;&#x305D;&#x308C;&#x3092;&#x78E8;&#x3044;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x300D;&#x300C;&#x3044;&#x3044;&#x5FC3;&#x304C;&#x3051;&#x3060;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x306E;&#x5165;&#x529B;&#x4E2D;&#xFF08;&#x3042;&#x308B;&#x3044;&#x306F;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30DF;&#x30CB;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x5165;&#x529B;&#x4E2D;&#xFF09;&#x306B; C-g &#x306B;&#x3088;&#x3063;
&#x3066;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x30AD;&#x30E3;&#x30F3;&#x30BB;&#x30EB;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-x C-f &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x304B;&#x3089; C-g &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30DF;&#x30CB;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x304C;
   &#x53D6;&#x308A;&#x6D88;&#x3055;&#x308C;&#x3001;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x305F;&#x30B3;&#x30DE;&#x30F3;&#x30C9; C-x C-f &#x81EA;&#x4F53;&#x3082;&#x53D6;&#x308A;&#x6D88;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;
   &#x3060;&#x304B;&#x3089;&#x3001;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x4F55;&#x3082;&#x958B;&#x304B;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3092;&#x5165;&#x529B;&#x3057;&#x305F;&#x3089;&#x3001;&lt;Return&gt;&#x30AD;&#x30FC;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x5165;&#x529B;&#x3092;&#x5B8C;&#x4E86;&#x3055;&#x305B;&#x307E;&#x3059;&#x3002;&#x305D;&#x3046;
&#x3059;&#x308B;&#x3068;&#x3001;C-x C-f &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x8D70;&#x308A;&#x59CB;&#x3081;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304D;&#x307E;&#x3059;&#x3002;&#x30DF;&#x30CB;&#x30D0;&#x30C3;
&#x30D5;&#x30A1;&#x306F; C-x C-f &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x7D42;&#x4E86;&#x3068;&#x3068;&#x3082;&#x306B;&#x6D88;&#x3048;&#x307E;&#x3059;&#x3002;

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5185;&#x5BB9;&#x304C;&#x753B;&#x9762;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x5185;&#x5BB9;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
&#x52A0;&#x3048;&#x305F;&#x5909;&#x66F4;&#x3092;&#x6052;&#x4E45;&#x7684;&#x306A;&#x3082;&#x306E;&#x306B;&#x3057;&#x305F;&#x3051;&#x308C;&#x3070;&#x3001;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;

      C-x C-s   &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;

&#x3053;&#x308C;&#x306F; Emacs &#x304C;&#x4FDD;&#x6301;&#x3057;&#x3066;&#x3044;&#x308B;&#x6587;&#x7AE0;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x30B3;&#x30D4;&#x30FC;&#x3057;&#x307E;&#x3059;&#x3002;&#x521D;&#x3081;&#x3066;&#x3053;&#x308C;&#x3092;
&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3068;&#x304D;&#x306F;&#x3001;&#x5143;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x65B0;&#x3057;&#x3044;&#x540D;&#x524D;&#x306B;&#x4ED8;&#x3051;&#x66FF;&#x3048;&#x308B;&#x306E;&#x3067;&#x3001;&#x305D;&#x306E;&#x5185;&#x5BB9;&#x306F;&#x5931;
&#x308F;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;&#x305D;&#x306E;&#x65B0;&#x3057;&#x3044;&#x540D;&#x524D;&#x306F;&#x5143;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x306E;&#x6700;&#x5F8C;&#x306B; &quot;~&quot; &#x3092;&#x3064;&#x3051;&#x305F;&#x3082;
&#x306E;&#x3067;&#x3059;&#x3002;

&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x7D42;&#x308F;&#x308B;&#x3068;&#x3001;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x5272;&#x3068;&#x983B;&#x7E41;&#x306B;&#x30BB;&#x30FC;
&#x30D6;&#x3057;&#x305F;&#x65B9;&#x304C;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#xFF08;&#x300C;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x300D;&#x306E;&#x7BC0;&#x3082;&#x53C2;&#x7167;&#x306E;&#x3053;&#x3068;&#xFF09;&#x3002;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;&#x843D;
&#x3061;&#x3066;&#x3082;&#x305B;&#x3063;&#x304B;&#x304F;&#x306E;&#x4F5C;&#x696D;&#x304C;&#x30D1;&#x30A2;&#x306B;&#x306A;&#x3089;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3002;

&gt;&gt; C-x C-s &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x3053;&#x306E;&#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x753B;&#x9762;&#x6700;&#x4E0B;&#x6BB5;&#x306B; &quot;Wrote ...TUTORIAL.ja&quot; &#x3068;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;
</code></pre><p><strong>&#x5272;&#x3068;&#x983B;&#x7E41;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x65B9;&#x304C;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;</strong>  </p>
<p>&#x300C;&#x3044;&#x3044;&#x3067;&#x3059;&#x304B;&#xFF1F;&#x300D;  </p>
<p><span style="font-size: 150%;">&#x5272;&#x3068;&#x983B;&#x7E41;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x65B9;&#x304C;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;</span>  </p>
<p>&#x300C;&#x3082;&#x3046;&#x3044;&#x3061;&#x3069;&#x8A00;&#x3044;&#x307E;&#x3059;&#x300D;&#x300C;&#x304A;&#x2026;&#x304A;&#x3044;&#x300D;  </p>
<p><br><br><span style="font-size: 200%;">&#x5272;&#x3068;&#x983B;&#x7E41;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x65B9;&#x304C;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;</span>  </p>
<p><br><br>&#x300C;&#x30B2;&#x30FC;&#x30E0;&#x306F;&#x3044;&#x3064;&#x3067;&#x3082;&#x30EA;&#x30BB;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x308B;&#x306A;&#x3093;&#x3066;&#x6614;&#x306E;&#x8A71;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x3051;&#x308C;&#x3069;&#x3082;Emacs&#x306F;&#x6614; (1976) &#x304B;&#x3089;&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x306A;&#x306E;&#x3067;&#x3053;&#x307E;&#x3081;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308C;&#x3070;&#x30EA;&#x30BB;&#x30C3;&#x30C8;&#x3067;&#x304D;&#x307E;&#x3059;&#x300D;&#x300C;&#x305D;&#x2026;&#x305D;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;Git&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x308B;&#x3068;&#x78D0;&#x77F3;&#x3067;&#x3059;&#x300D;&#x300C;&#x305F;&#x3057;&#x304B;&#x306B;&#x300D;&#x300C;Emacs&#x3067;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x305F;&#x3073;&#x306B;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059; (<a href="https://github.com/ryuslash/git-auto-commit-mode" target="_blank">git-auto-commit-mode</a>)&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x3059;&#x3054;&#x3044;&#x300D;&#x300C;&#x3051;&#x308C;&#x3069;&#x3082;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x30B3;&#x30DF;&#x30C3;&#x30C8;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x305B;&#x3093;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x6700;&#x5F8C;&#x306B;&#x3082;&#x3046;&#x4E00;&#x5EA6;&#x8A00;&#x3044;&#x307E;&#x3059;&#x300D;  </p>
<p><br><br><span style="font-size: 200%;">&#x4F60;&#x6700;&#x597D;&#x517B;&#x6210;&#x7ECF;&#x5E38;&#x5B58;&#x76D8;&#x7684;&#x4E60;&#x60EF;</span>  </p>
<p>&#x300C;&#x3053;&#x306E;&#x6587;&#x8A00;&#xFF0C;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306B;&#x3082;&#x3042;&#x308B;&#x306E;&#x306B;&#x306A;&#x305C;&#x304B;&#x82F1;&#x8A9E;&#x7248;&#x306B;&#x306F;&#x306A;&#x3044;&#x300D;&#x300C;&#x306A;&#x3093;&#x3060;&#x3063;&#x3066;!&#xFF1F;&#x300D;  </p>
<p><br>  </p>
<pre><code>    &#x65E2;&#x5B58;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304D;&#x3001;&#x5185;&#x5BB9;&#x3092;&#x898B;&#x3001;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x30D5;&#x30A1;
    &#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;Emacs &#x3067;&#x65B0;&#x3057;&#x3044;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4F5C;&#x308B;&#x306B;&#x306F;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x3057;
    &#x307E;&#x3059;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304D;&#x307E;&#x3059;&#x3002;&#x6700;&#x521D;&#x306F;&#x7A7A;&#x3063;&#x307D;&#x3067;&#x3059;&#x306D;&#x3002;&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;
    &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x305F;&#x6642;&#x306B;&#x521D;&#x3081;&#x3066;&#x65B0;&#x3057;&#x3044;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x4F5C;&#x3089;&#x308C;&#x3001;&#x4ECA;&#x307E;&#x3067;&#x5165;
    &#x529B;&#x3057;&#x305F;&#x5185;&#x5BB9;&#x304C;&#x305D;&#x308C;&#x306B;&#x66F8;&#x304D;&#x8FBC;&#x307E;&#x308C;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x4EE5;&#x964D;&#x306F;&#x3001;&#x3042;&#x306A;&#x305F;&#x306F;&#x65E2;&#x5B58;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;
    &#xFF08;&#x305F;&#x3063;&#x305F;&#x4ECA;&#x4F5C;&#x3089;&#x308C;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF09;&#x3092;&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x601D;&#x3063;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="11.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 11 - お前を元に戻す1つの方法">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"12 - アポクリファイル","level":"5.1","depth":1,"previous":{"title":"11 - お前を元に戻す1つの方法","level":"4.4","depth":1,"path":"11.md","ref":"11.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"12.md","mtime":"2018-08-15T06:50:14.120Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-15T06:51:02.004Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

