
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>13 - 見るもの統べて · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="14.html" />
    
    
    <link rel="prev" href="12.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >13 - 見るもの統べて</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="13---&#x898B;&#x308B;&#x3082;&#x306E;&#x7D71;&#x3079;&#x3066;">13 - &#x898B;&#x308B;&#x3082;&#x306E;&#x7D71;&#x3079;&#x3066;</h1>
<p>&#x300C;&#x7D71; (&#x3059;) &#x3079;&#x3066;&#x300D;&#x300C;&#x30D5;&#x30EA;&#x30AC;&#x30CA;&#x3064;&#x3051;&#x306A;&#x3044;&#x3068;&#x8AAD;&#x3081;&#x306A;&#x3044;&#x3088;&#x3046;&#x306A;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306B;&#x3059;&#x308B;&#x306A;&#x3088;&#x2026;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#x9069;&#x5F53;&#x306B;&#x5909;&#x63DB;&#x3057;&#x305F;&#x3089;&#x304B;&#x3063;&#x3053;&#x3088;&#x304B;&#x3063;&#x305F;&#x3093;&#x3060;&#x3082;&#x3093;&#x300D;&#x300C;&#x2026;&#x6700;&#x521D;&#x306F;&#x300E;&#x5168;&#x3066;&#x300F;&#x306B;&#x3059;&#x308B;&#x3064;&#x3082;&#x308A;&#x3060;&#x3063;&#x305F;&#x3093;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;<a href="http://openlab.ring.gr.jp/skk/ddskk-ja.html" target="_blank">skk</a>&#x3067;&#x5909;&#x63DB;&#x4F4D;&#x7F6E;&#x307E;&#x3061;&#x304C;&#x3048;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x304B;&#x3048;&#x3063;&#x3066;&#x6DF1;&#x3044;&#x610F;&#x5473;&#x3042;&#x308A;&#x305D;&#x3046;&#x306A;&#x540D;&#x524D;&#x306B;&#x306A;&#x3063;&#x305F;&#x300D;&#x300C;&#x610F;&#x5473;&#x306A;&#x3044;&#x306E;&#x304B;&#x2026;&#x300D;&#x300C;&#x5B9F;&#x306F;&#x591A;&#x5C11;&#x3042;&#x308B;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;  </p>
<p><br><br>&#x300C;&#x306A;&#x3093;&#x3068;!&#x524D;&#x56DE;&#x306F;C-x C-f&#x3068;C-x C-s&#x306E;2&#x3064;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x7D39;&#x4ECB;&#x3060;&#x3051;&#x3067;&#x7D42;&#x308F;&#x3063;&#x3066;&#x3057;&#x307E;&#x3044;&#x307E;&#x3057;&#x305F;!&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x3071;&#x3061;&#x3071;&#x3061;&#x3071;&#x3061;&#x30FC;&#x300D;&#x300C;&#x3082;&#x3063;&#x3068;&#x30B5;&#x30AF;&#x30B5;&#x30AF;&#x9032;&#x307E;&#x3093;&#x306E;&#x304B;&#x300D;&#x300C;&#x79C1;&#x3082;&#x9032;&#x3081;&#x305F;&#x3044;&#x2026;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x3067;&#x3082;&#x304F;&#x3060;&#x3089;&#x306A;&#x3044;&#x8A71;&#x3092;&#x3057;&#x306A;&#x3044;&#x3068;&#x982D;&#x304C;&#x304A;&#x304B;&#x3057;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x3093;&#x3058;&#x3083;&#x3046;&#x2026;&#x300D;&#x300C;&#x3082;&#xFF0C;&#x3082;&#x3057;&#x3084;&#x541B;&#x306F;&#x3059;&#x3067;&#x306B;&#x30A2;&#x30DD;&#x30AF;&#x30EA;&#x30D5;&#x30A1;&#x306B;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x771F;&#x9854;&#x306B;&#x306A;&#x308B;&#x306A;&#x3088;&#x2026;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x79C1;&#x304C;&#x3064;&#x307E;&#x3089;&#x306A;&#x3044;&#x3053;&#x3068;&#x8A00;&#x3063;&#x3066;&#x308B;&#x307F;&#x305F;&#x3044;&#x3060;&#x308D;&#x2026;&#x300D;&#x300C;&#x79C1;&#x3068;&#x95A2;&#x308F;&#x308B;&#x3068;&#x304D;&#x306F;&#x5E38;&#x306B;&#x5203;&#x3092;&#x5411;&#x3051;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3068;&#x5FC3;&#x304C;&#x3051;&#x3088;&#x300D;&#x300C;&#x2026;&#x306F;&#x3044;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30D0;&#x30C3;&#x30D5;&#x30A1;
==========

&#xFF12;&#x3064;&#x76EE;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092; C-x C-f &#x3067;&#x958B;&#x3044;&#x3066;&#x3082;&#x3001;&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F; Emacs &#x5185;&#x90E8;&#x306B;&#x6B8B;&#x3063;
&#x305F;&#x307E;&#x307E;&#x3067;&#x3059;&#x3002;&#x305D;&#x3063;&#x3061;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x623B;&#x308B;&#x306B;&#x306F;&#x3082;&#x3046;&#x4E00;&#x5EA6; C-x C-f &#x3067;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;
&#x3092;&#x958B;&#x3051;&#x3070;&#x3088;&#x3044;&#x306E;&#x3067;&#x3059;&#x3002;&#x3053;&#x3046;&#x3084;&#x3063;&#x3066;&#x3001;&#x5E7E;&#x3064;&#x3082;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092; Emacs &#x3067;&#x958B;&#x304F;&#x3053;&#x3068;&#x304C;
&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&gt;&gt; &quot;foo&quot; &#x3068;&#x3044;&#x3046;&#x540D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4F5C;&#x308A;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;C-x C-f foo &lt;Return&gt; &#x3067;&#x3059;&#x3002;
   &#x4F55;&#x304B;&#x6587;&#x7AE0;&#x3092;&#x5165;&#x308C;&#x3001;&#x7DE8;&#x96C6;&#x3057;&#x3001;C-x C-s &#x3067; &quot;foo&quot; &#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   &#x6700;&#x5F8C;&#x306B; C-x C-f TUTORIAL.ja &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;
   &#x5165;&#x9580;&#x30AC;&#x30A4;&#x30C9;&#x306B;&#x623B;&#x308A;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;&#x82F1;&#x8A9E;&#x7248;&#x3068;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x3060;&#x3068;foo&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x5F8C;&#x3067;&#x4F5C;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x308B;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x91CD;&#x8981;&#x306A;&#x306E;&#x306F;&#x3053;&#x306E;&#x6B21;&#x304B;&#x3089;&#x300D;&#x300C;&#x304A;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x3044;&#x3048;&#x3070;foo&#x3068;&#x304B;hoge&#x3063;&#x3066;&#x6163;&#x308C;&#x306A;&#x3044;&#x3046;&#x3061;&#x306F;&#x7D50;&#x69CB;&#x3072;&#x3063;&#x304B;&#x304B;&#x308B;&#x540D;&#x524D;&#x3060;&#x3088;&#x306D;&#x300D;&#x300C;&#x3069;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x52C9;&#x5F37;&#x3057;&#x3088;&#x3046;&#x3063;&#x3066;&#x3068;&#x304D;&#x306B;&#xFF0C;&#x300E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x5148;&#x306F;/home/foo&#x300F;&#x3068;&#x304B;&#x3002;&#x305D;&#x308C;&#x3067;&#x300E;&#x305D;&#x306E;&#x3088;&#x3046;&#x306A;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x300F;&#x3063;&#x3066;&#x8FD4;&#x3063;&#x3066;&#x304D;&#x3066;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x304B;&#x3089;&#x3064;&#x307E;&#x3093;&#x306A;&#x304F;&#x306A;&#x3063;&#x3066;&#x96FB;&#x6E90;&#x5207;&#x3063;&#x3066;&#x30B3;&#x30BF;&#x30C4;&#x3067;&#x30DF;&#x30AB;&#x30F3;&#x98DF;&#x3079;&#x308B;&#x300D;&#x300C;&#x3053;&#x305F;&#x3064;&#x306F;&#x77E5;&#x3089;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x5909;&#x6570;&#x3068;&#x3044;&#x3046;&#x6982;&#x5FF5;&#x3092;&#x7406;&#x89E3;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x3046;&#x3061;&#x306F;&#x96E3;&#x3057;&#x3044;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;&#x300C;&#x3053;&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306F;&#x81EA;&#x5206;&#x306E;Emacs&#x74B0;&#x5883;&#x306B;&#x3042;&#x308F;&#x305B;&#x3066;&#x8A18;&#x8FF0;&#x3092;&#x5909;&#x3048;&#x3066;&#x304F;&#x308C;&#x308B;&#x304B;&#x3089;&#x89AA;&#x5207;&#x300D;&#x300C;&#x3042;&#x308A;&#x304C;&#x305F;&#x3044;&#x300D;  </p>
<p><br>  </p>
<pre><code>Emacs &#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5185;&#x5BB9;&#x3092;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#xFF08;buffer&#xFF09;&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x3082;&#x306E;&#x306E;&#x4E2D;&#x306B;&#x683C;&#x7D0D;&#x3057;&#x3066;
&#x3044;&#x307E;&#x3059;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#x3068;&#x65B0;&#x3057;&#x3044;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;Emacs &#x304C;&#x73FE;&#x5728;&#x6301;&#x3063;&#x3066;&#x3044;
&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x898B;&#x308B;&#x306B;&#x306F;&#x3001;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;

      C-x C-b   &#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x898B;&#x308B;

&gt;&gt; C-x C-b &#x3092;&#x8A66;&#x3057;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

&#x5404;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x304C;&#x3069;&#x3093;&#x306A;&#x540D;&#x524D;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x3001;&#x305D;&#x308C;&#x304C;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x304C;
&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x898B;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;Emacs &#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x5185;&#x306B;&#x3042;&#x308B;&#x6587;&#x7AE0;&#x306F;&#x3069;&#x308C;&#x3082;&#x3001;&#x3044;
&#x305A;&#x308C;&#x304B;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x4E00;&#x90E8;&#x3067;&#x3059;&#x3002;

&gt;&gt; C-x 1 &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x6D88;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;Emacs&#x306F;&#x958B;&#x3044;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x9589;&#x3058;&#x308B;&#x307E;&#x3067;&#x5168;&#x90E8;&#x3072;&#x3089;&#x304D;&#x3063;&#x3071;&#x306A;&#x3057;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;C-x C-b&#x3067;&#x4E00;&#x89A7;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x30BF;&#x30D6;&#x8868;&#x793A;&#x3059;&#x308B;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059; (<a href="https://github.com/dholm/tabbar" target="_blank">tabbar</a>)&#x300D;  </p>
<p>&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3068;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x9055;&#x3044;&#x306B;&#x3064;&#x3044;&#x3066;&#x6559;&#x3048;&#x3066;&#x304F;&#x308C;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3048;&#x3048;&#x3068;&#xFF0C;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306F;&#x60C5;&#x5831;&#x3092;&#x5C55;&#x958B;&#x3057;&#x3066;&#x3044;&#x308B;&#x300E;&#x72B6;&#x614B;&#x300F;&#x3092;&#x3044;&#x3044;&#x307E;&#x3059;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x30D4;&#x30AF;&#x30CB;&#x30C3;&#x30AF;&#x3067;&#x30EC;&#x30B8;&#x30E3;&#x30FC;&#x30B7;&#x30FC;&#x30C8;&#x5E83;&#x3052;&#x3066;&#x308B;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#xFF0C;&#x3068;&#x304B;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x6301;&#x3061;&#x7269;&#x3067;&#xFF0C;&#x5FC5;&#x8981;&#x306A;&#x3082;&#x306E;&#x3092;&#x30B7;&#x30FC;&#x30C8;&#x306B;&#x5E83;&#x3052;&#x3066;&#x308B;&#x3002;&#x3053;&#x306E;&#x300E;&#x72B6;&#x614B;&#x300F;&#x304C;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x300D;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x300D;&#x300C;&#x305F;&#x3044;&#x3066;&#x3044;&#x306F;&#x30B7;&#x30FC;&#x30C8;&#x4E00;&#x679A;&#x3067;&#x8DB3;&#x308A;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x5FC5;&#x8981;&#x306A;&#x3089;&#x4F55;&#x679A;&#x3067;&#x3082;&#x5E83;&#x3052;&#x3089;&#x308C;&#x308B;&#x306E;&#x304C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306E;&#x3044;&#x3044;&#x3068;&#x3053;&#x308D;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;  </p>
<p><br><br>&#x300C;&#x3053;&#x3053;&#x304B;&#x3089;&#x306F;&#x898B;&#x308B;&#x3082;&#x306E; (&#x30D0;&#x30C3;&#x30D5;&#x30A1;) &#x3092;&#x7D71;&#x3079;&#x308B;&#x65B9;&#x6CD5;&#x306E;&#x7D39;&#x4ECB;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x3053;&#x3053;&#x3067;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x304C;&#x95A2;&#x308F;&#x3063;&#x3066;&#x304F;&#x308B;&#x308F;&#x3051;&#x3060;&#x306A;&#x300D;&#x300C;&#x4ECA;&#x8A00;&#x308F;&#x306A;&#x3044;&#x3068;&#x5FD8;&#x308C;&#x3061;&#x3083;&#x3046;&#x304B;&#x3089;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x304C;&#x8907;&#x6570;&#x3042;&#x3063;&#x3066;&#x3082;&#x3001;&#x3042;&#x308B;&#x6642;&#x70B9;&#x3067;&#x306F;&#x305D;&#x306E;&#x4E00;&#x3064;&#x3060;&#x3051;&#x304C;&#x300C;&#x73FE;&#x5728;&#x300D;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3067;
&#x3059;&#x3002;&#x305D;&#x308C;&#x306F;&#x3042;&#x306A;&#x305F;&#x304C;&#x7DE8;&#x96C6;&#x4E2D;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3067;&#x3059;&#x3002;&#x3082;&#x3057;&#x4ED6;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x7DE8;&#x96C6;&#x3057;&#x305F;&#x3051;&#x308C;
&#x3070;&#x3001;&#x305D;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x5207;&#x66FF;&#x3048;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;
&#x306B;&#x5207;&#x66FF;&#x3048;&#x308B;&#x306B;&#x306F;&#x3001;&#x307E;&#x305F; C-x C-f &#x3067;&#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x3051;&#x3070;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x3067;&#x3082;&#x3001;
&#x3082;&#x3063;&#x3068;&#x7C21;&#x5358;&#x306A;&#x65B9;&#x6CD5;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;C-x b &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;&#x3053;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;
&#x3066;&#x3001;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x540D;&#x524D;&#x3092;&#x5165;&#x529B;&#x3059;&#x308C;&#x3070;&#x826F;&#x3044;&#x306E;&#x3067;&#x3059;&#x3002;

&gt;&gt; C-x b foo &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x3001; &quot;foo&quot; &#x3068;&#x3044;&#x3046;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;
   &quot;foo&quot; &#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x623B;&#x3063;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x308C;&#x304B;&#x3089; C-x b TUTORIAL.ja
   &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x3001;&#x3053;&#x306E;&#x30AC;&#x30A4;&#x30C9;&#x306B;&#x623B;&#x308A;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

&#x666E;&#x901A;&#x306F;&#x3001;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x540D;&#x524D;&#x3068;&#x305D;&#x308C;&#x304C;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#xFF08;&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x540D;
&#x306E;&#x90E8;&#x5206;&#x3092;&#x9664;&#x3044;&#x3066;&#xFF09;&#x306F;&#x540C;&#x3058;&#x3067;&#x3059;&#x3002;&#x4F8B;&#x5916;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;C-x C-b &#x3067;&#x4F5C;&#x3063;&#x305F;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30EA;
&#x30B9;&#x30C8;&#x306F;&#x5E38;&#x306B;&#x5404;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x540D;&#x524D;&#x3092;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x82F1;&#x8A9E;&#x7248;&#x3068;&#x4E2D;&#x56FD;&#x8A9E;&#x7248;&#x306F;&#x3053;&#x3053;&#x3067;C-x C-f foo &lt;Return&gt; &#x3067;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x958B;&#x304F;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x3042;&#x3068;&#xFF0C;&#x3053;&#x3053;&#x306B;&#x3082;&#x66F8;&#x304B;&#x308C;&#x3066;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x57FA;&#x672C;&#x7684;&#x306B;&#x306F;&#x4E00;&#x5EA6;&#x306B;&#x3072;&#x3068;&#x3064;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x8907;&#x6570;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x540C;&#x6642;&#x306B;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x3082;&#x3042;&#x308B;&#x3051;&#x3069;&#xFF0C;<a href="https://mm.hyuki.net/n/neb44dd5e6e30" target="_blank">&#x6B73;&#x3092;&#x3068;&#x308B;&#x3068;&#x305F;&#x304F;&#x3055;&#x3093;&#x306E;&#x3082;&#x306E;&#x3092;&#x540C;&#x6642;&#x306B;&#x6271;&#x3046;&#x306E;&#x304C;&#x96E3;&#x3057;&#x304F;&#x306A;&#x308B;</a>&#x305D;&#x3046;&#x306A;&#x306E;&#x3067;&#xFF0C;&#x3054;&#x5229;&#x7528;&#x306F;&#x8A08;&#x753B;&#x7684;&#x306B;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x3053;&#x306E;&#x3078;&#x3093;&#xFF0C;&#x541B;&#x306F;&#x5143;&#x3005;&#x3072;&#x3068;&#x3064;&#x306E;&#x3082;&#x306E;&#x3057;&#x304B;&#x6271;&#x3048;&#x306A;&#x3044;&#x304B;&#x3089;&#x5B89;&#x5FC3;&#x3060;&#x306D;&#x300D;&#x300C;&#x898B;&#x304F;&#x3073;&#x308B;&#x306A;&#x3002;&#x305F;&#x3057;&#x304B;&#x306B;&#x79C1;&#x306F;&#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30B3;&#x30A2; (Atom N270) &#x3060;&#x304C;&#xFF0C;&#x30CF;&#x30A4;&#x30D1;&#x30FC;&#x30B9;&#x30EC;&#x30C3;&#x30C7;&#x30A3;&#x30F3;&#x30B0;&#x3067;2&#x3064;&#x306E;&#x4ED5;&#x4E8B;&#x3082;&#x540C;&#x6642;&#x306B;&#x3067;&#x304D;&#x308B;&#x3093;&#x3060;&#x305E;&#x300D;&#x300C;&#x2026;&#x304B;&#x308F;&#x3044;&#x3044;&#x300D;&#x300C;&#x306A;&#xFF0C;&#x306A;&#x3093;&#x3060;&#x6025;&#x306B;!&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x3042;&#x306A;&#x305F;&#x304C; Emacs &#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3067;&#x898B;&#x308B;&#x6587;&#x7AE0;&#x306F;&#x3069;&#x308C;&#x3082;&#x3001;&#x3044;&#x305A;&#x308C;&#x304B;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x4E00;
&#x90E8;&#x3067;&#x3059;&#x3002;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x7121;&#x3044;&#x3082;&#x306E;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;
&quot;*Buffer List*&quot; &#x3068;&#x3044;&#x3046;&#x540D;&#x524D;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x306E;&#x30D0;&#x30C3;
&#x30D5;&#x30A1;&#x306F;&#x3042;&#x306A;&#x305F;&#x304C; C-x C-b &#x3067;&#x4F5C;&#x3063;&#x305F;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x4FDD;&#x6301;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3067;
&#x3059;&#x3002;&quot;*Messages*&quot; &#x3068;&#x3044;&#x3046;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3082;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x6301;&#x3061;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306F;&#x3001;
Emacs &#x304C;&#x6700;&#x4E0B;&#x884C;&#x306B;&#x8868;&#x793A;&#x3059;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x4FDD;&#x6301;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;

&gt;&gt; C-x b *Messages* &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x898B;&#x3066;&#x307F;
   &#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x308C;&#x304B;&#x3089; C-x b TUTORIAL.ja &lt;Return&gt; &#x3067;&#x3053;&#x306E;&#x30AC;&#x30A4;&#x30C9;&#x306B;&#x623B;&#x3063;&#x3066;
   &#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;Emacs&#x81EA;&#x8EAB;&#x304C;&#x4F5C;&#x3063;&#x305F;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306F;&#x540D;&#x524D;&#x306B;&#x7279;&#x5FB4;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x305D;&#x306E;1&#x3002;&#x30A2;&#x30B9;&#x30BF;&#x30EA;&#x30B9;&#x30AF; (*) &#x3067;&#x631F;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x3053;&#x3053;&#x3067;&#x3044;&#x3046;*Messages*&#x3068;&#x304B;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x305D;&#x306E;2&#x3002;&#x30B3;&#x30ED;&#x30F3; (:) &#x304C;&#x3064;&#x3044;&#x3066;&#x308B;&#x3002;magit: Emacs-tutorial&#x3068;&#x304B;&#x300D;&#x300C;&#x308F;&#x304B;&#x3063;&#x305F;&#x300D;&#x300C;&#x3053;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306F;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306A;&#x3044;&#x306E;&#x3067;&#x5B89;&#x5FC3;&#x3057;&#x3066;&#x306D;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x3042;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5185;&#x5BB9;&#x306B;&#x306A;&#x3093;&#x3089;&#x304B;&#x306E;&#x5909;&#x66F4;&#x3092;&#x52A0;&#x3048;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089;&#x4ED6;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x3044;&#x3066;
&#x3082;&#x3001;&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x307E;&#x3060;&#x30BB;&#x30FC;&#x30D6;&#x3055;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;&#x5909;&#x66F4;&#x306F; Emacs &#x306E;&#x5185;&#x90E8;&#x3001;&#x305D;&#x306E;&#x30D5;&#x30A1;
&#x30A4;&#x30EB;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x4E2D;&#x306B;&#x6B8B;&#x3063;&#x305F;&#x307E;&#x307E;&#x3067;&#x3059;&#x3002;&#xFF12;&#x756A;&#x76EE;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;
&#x3092;&#x4F5C;&#x3063;&#x305F;&#x308A;&#x3001;&#x7DE8;&#x96C6;&#x3057;&#x305F;&#x308A;&#x3057;&#x3066;&#x3082;&#x3001;&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x306F;&#x4F55;&#x306E;&#x5F71;&#x97FF;&#x3082;&#x3042;
&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3053;&#x308C;&#x306F;&#x3068;&#x3066;&#x3082;&#x5F79;&#x306B;&#x7ACB;&#x3061;&#x307E;&#x3059;&#x304C;&#x3001;&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x30BB;&#x30FC;&#x30D6;
&#x3059;&#x308B;&#x4F55;&#x304B;&#x4FBF;&#x5229;&#x306A;&#x65B9;&#x6CD5;&#x304C;&#x5FC5;&#x8981;&#x3060;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002; C-x C-s &#x3067;&#x30BB;&#x30FC;&#x30D6;&#x3059;
&#x308B;&#x305F;&#x3081;&#x306B; C-x C-f &#x3067;&#x5143;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x623B;&#x308B;&#x306E;&#x306F;&#x5384;&#x4ECB;&#x3067;&#x3059;&#x3002;&#x305D;&#x3053;&#x3067;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;
&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;

   C-x s   &#x4F55;&#x308C;&#x304B;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;

C-x s &#x306F;&#x3001;&#x307E;&#x3060;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x5909;&#x66F4;&#x304C;&#x3042;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x305D;&#x308C;&#x305E;&#x308C;&#x306B;&#x3064;&#x3044;&#x3066;&#x3001;&#x305D;&#x308C;
&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x3092;&#x805E;&#x3044;&#x3066;&#x304D;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x4E00;&#x884C;&#x6587;&#x7AE0;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x304B;&#x3089; C-x s &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   TUTORIAL.ja &#x3068;&#x3044;&#x3046;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x805E;&#x3044;&#x3066;&#x304F;&#x308B;&#x306F;&#x305A;&#x3067;&#x3059;&#x3002;
   &#x300C;&#x306F;&#x3044;&#x300D;&#x3068;&#x7B54;&#x3048;&#x308B;&#x305F;&#x3081;&#x306B; &quot;y&quot; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x3053;&#x308C;&#x306F;&#x3069;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x3048;&#xFF1F;&#x306A;&#x306B;&#x304C;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF0C;2&#x756A;&#x76EE;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF0C;&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x4F55;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x308F;&#x304B;&#x3063;&#x305F;&#x3002;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x306D;&#x300D;&#x300C;&#x983C;&#x3080;&#x300D;  </p>
<p>&#x300C;C-x C-f a.txt &#x3067; &quot;a.txt&quot; &#x3063;&#x3066;&#x3044;&#x3046;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x4F5C;&#x308B;&#x3068;&#x3059;&#x308B;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x9014;&#x4E2D;&#x3067;&#x79C1;&#x304C;&#x4F55;&#x304B;&#x601D;&#x3044;&#x3064;&#x3044;&#x3066;&#xFF0C;C-x C-f memo.txt &#x3063;&#x3066;&#x3044;&#x3046;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x4F5C;&#x3063;&#x3066;&#xFF0C;&#x4F55;&#x304B;&#x66F8;&#x3044;&#x3066;C-x C-s&#x3067;&#x4FDD;&#x5B58;&#x3059;&#x308B;&#x300D;&#x300C;&#x3046;&#x3080;&#x300D;&#x300C;&#x3053;&#x306E;&#x3068;&#x304D;memo.txt&#x306F;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;a.txt&#x306F;&#x307B;&#x3063;&#x305F;&#x3089;&#x304B;&#x3057;&#x306B;&#x3055;&#x308C;&#x305F;&#x307E;&#x307E;&#x306A;&#x306E;&#xFF0C;&#x308F;&#x304B;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x305D;&#x3046;&#x304B;&#x3002;C-x C-s&#x304C;&#x4FDD;&#x5B58;&#x3059;&#x308B;&#x306E;&#x306F;&#x4ECA;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3060;&#x3051;&#x306A;&#x3093;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;&#x3060;&#x304B;&#x3089;C-x s&#x3067;&#x307E;&#x3060;&#x4FDD;&#x5B58;&#x3057;&#x3066;&#x306A;&#x3044;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x3092;&#x4FDD;&#x5B58;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3093;&#x3060;&#x3088;&#x300D;  </p>
<p><br><br>&#x300C;&#x3088;&#x304F;&#x308F;&#x304B;&#x3063;&#x305F;&#x3002;&#x3060;&#x304C;&#x541B;&#x306F;C-x s&#x3092;&#x4F7F;&#x3063;&#x3066;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;&#x305D;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x77E5;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x304B;&#x3089;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x3042;&#x3068;&#xFF0C;  <span style="font-size: 120%;">&#x5272;&#x3068;&#x983B;&#x7E41;&#x306B;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x65B9;&#x304C;&#x826F;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;</span> &#x3060;&#x304B;&#x3089;&#x3002;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3066;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x79FB;&#x52D5;&#x3059;&#x308B;&#x30AF;&#x30BB;&#x304C;&#x8EAB;&#x306B;&#x3064;&#x3044;&#x3066;&#x308B;&#x304B;&#x3089;&#x300E;&#x4FDD;&#x5B58;&#x3057;&#x3066;&#x306A;&#x3044;&#x3088;!&#x300F;&#x3063;&#x3066;&#x8B66;&#x544A;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x3082;&#x307B;&#x3068;&#x3093;&#x3069;&#x306A;&#x3044;&#x3057;&#x300D;&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#x306A;&#x3002;&#x3053;&#x307E;&#x3081;&#x306A;&#x30BB;&#x30FC;&#x30D6;&#x304C;&#x91CD;&#x8981;&#x3060;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x304B;&#x300D;&#x300C;&#x305D;&#x306E;&#x3068;&#x304A;&#x308A;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="12.html" class="navigation navigation-prev " aria-label="Previous page: 12 - アポクリファイル">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="14.html" class="navigation navigation-next " aria-label="Next page: 14 - コマゴマとしたコマンド">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"13 - 見るもの統べて","level":"5.2","depth":1,"next":{"title":"14 - コマゴマとしたコマンド","level":"5.3","depth":1,"path":"14.md","ref":"14.md","articles":[]},"previous":{"title":"12 - アポクリファイル","level":"5.1","depth":1,"path":"12.md","ref":"12.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"13.md","mtime":"2018-08-15T17:30:30.224Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-16T08:40:07.592Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

