
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>14 - コマゴマとしたコマンド · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="15.html" />
    
    
    <link rel="prev" href="13.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="21.html">
            
                <a href="21.html">
            
                    
                    21 - 答えは目の前にある
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="22.html">
            
                <a href="22.html">
            
                    
                    22 - 旅立ち
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">エピローグ</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="23.html">
            
                <a href="23.html">
            
                    
                    23 - そして
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.2" data-path="24.html">
            
                <a href="24.html">
            
                    
                    24 - それから
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.3" data-path="25.html">
            
                <a href="25.html">
            
                    
                    あとがき
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >14 - コマゴマとしたコマンド</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="14---&#x30B3;&#x30DE;&#x30B4;&#x30DE;&#x3068;&#x3057;&#x305F;&#x30B3;&#x30DE;&#x30F3;&#x30C9;">14 - &#x30B3;&#x30DE;&#x30B4;&#x30DE;&#x3068;&#x3057;&#x305F;&#x30B3;&#x30DE;&#x30F3;&#x30C9;</h1>
<p>&#x300C;&#x524D;&#x3005;&#x56DE;&#x3063;&#x3066;&#x30B3;&#x30DE;&#x30F3;&#x30C9;2&#x3064;&#x3057;&#x304B;&#x7D39;&#x4ECB;&#x3057;&#x306A;&#x304B;&#x3063;&#x305F;&#x3058;&#x3083;&#x3093;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x524D;&#x56DE;&#x3044;&#x304F;&#x3064;&#x304B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x7D39;&#x4ECB;&#x3057;&#x305F;&#x3058;&#x3083;&#x3093;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x79C1;&#x304C;&#x3075;&#x3060;&#x3093;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x306E;&#x3063;&#x3066;C-x b&#x3060;&#x3051;&#x306A;&#x3093;&#x3060;&#x300D;&#x300C;&#x3048;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x304C;&#x9032;&#x3080;&#x3054;&#x3068;&#x306B;&#x3069;&#x3093;&#x3069;&#x3093;&#x5C55;&#x958B;&#x304C;&#x9045;&#x304F;&#x306A;&#x3063;&#x3066;&#x308B;&#x3088;&#x3046;&#x306A;&#x6C17;&#x304C;&#x3057;&#x3066;&#x300D;&#x300C;&#x3046;&#x2026;&#x3046;&#x3080;&#x300D;  </p>
<p>&#x300C;&#x51FA;&#x53E3;&#x304C;&#x898B;&#x3048;&#x306A;&#x3044;&#x6CBC;&#x3092;&#x6B69;&#x304D;&#x3064;&#x3065;&#x3051;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x4E0D;&#x5B89;&#x3092;&#x611F;&#x3058;&#x308B;&#x300D;&#x300C;&#x3044;&#x307E;&#xFF0C;&#x5168;&#x4F53;&#x306E;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x306A;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x534A;&#x5206;&#x3061;&#x3087;&#x3063;&#x3068;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x3068;&#x308A;&#x3042;&#x3048;&#x305A;&#x5148;&#x306B;&#x9032;&#x3082;&#x3046;&#x3002;&#x8DB3;&#x3092;&#x8E0F;&#x307F;&#x51FA;&#x3055;&#x306A;&#x3051;&#x308C;&#x3070;&#x30B4;&#x30FC;&#x30EB;&#x306B;&#x305F;&#x3069;&#x308A;&#x3064;&#x304B;&#x306A;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x30B4;&#x30FC;&#x30EB;&#x3063;&#x3066;&#x3069;&#x3053;&#x306B;&#x3042;&#x308B;&#x3093;&#x3060;&#x308D;&#x3046;&#x306D;&#x2026;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x541B;&#xFF0C;&#x898B;&#x3048;&#x308B;&#xFF1F;&#x300D;  </p>
<p><br><br>&#x300C;&#x898B;&#x3048;&#x308B;&#x300D;&#x300C;&#x3048;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#xFF0C;&#x30B9;&#x30BF;&#x30FC;&#x30C8;&#x5730;&#x70B9;&#x306F;&#x3082;&#x3046;&#x898B;&#x3048;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x2026;&#x3046;&#x3093;&#x300D;&#x300C;&#x79C1;&#x305F;&#x3061;&#x306F;&#x305D;&#x308C;&#x3060;&#x3051;&#x9032;&#x3093;&#x3067;&#x304D;&#x305F;&#x3093;&#x3060;&#x3002;&#x3060;&#x304B;&#x3089;&#x3044;&#x305A;&#x308C;&#x30B4;&#x30FC;&#x30EB;&#x306F;&#x898B;&#x3048;&#x3066;&#x304F;&#x308B;&#x3002;&#x9593;&#x9055;&#x3044;&#x306A;&#x304F;&#x300D;  </p>
<p><br><br>&#x300C;Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306B;&#x3053;&#x308C;&#x3060;&#x3051;&#x771F;&#x9762;&#x76EE;&#x306B;&#x53D6;&#x308A;&#x7D44;&#x3093;&#x3067;&#x308B;&#x306E;&#x3063;&#x3066;&#x3055;&#xFF0C;&#x79C1;&#x305F;&#x3061;&#x304C;&#x521D;&#x3081;&#x3066;&#x306A;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x3042;&#x3002;&#x30B4;&#x30FC;&#x30EB;&#x307E;&#x3067;&#x8D70;&#x308A;&#x629C;&#x3051;&#x308C;&#x3070;&#xFF0C;&#x9593;&#x9055;&#x3044;&#x306A;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x884C;&#x3053;&#x3046;&#x3002;&#x4E00;&#x7DD2;&#x306B;!&#x300D;&#x300C;&#x3042;&#x3042;!&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x62E1;&#x5F35;
================

Emacs &#x306B;&#x306F;&#x3001;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x6587;&#x5B57;&#x3084;&#x30E1;&#x30BF;&#x6587;&#x5B57;&#x306B;&#x5272;&#x5F53;&#x3066;&#x3089;&#x308C;&#x308B;&#x3088;&#x308A;&#x3082;&#x305A;&#x3063;&#x3068;&#x305A;&#x3063;&#x3068;
&#x591A;&#x304F;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x3092;&#x6271;&#x3046;&#x305F;&#x3081;&#x306B;&#x3001;&#x62E1;&#x5F35;&#xFF08;eXtend&#xFF09;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;
&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x306B;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#xFF12;&#x3064;&#x306E;&#x7A2E;&#x985E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;

   C-x     &#x6587;&#x5B57;&#x306B;&#x3088;&#x308B;&#x62E1;&#x5F35;&#x3002;&#x7D9A;&#x3051;&#x3066;&#x4E00;&#x6587;&#x5B57;&#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;
   M-x     &#x540D;&#x524D;&#x306B;&#x3088;&#x308B;&#x62E1;&#x5F35;&#x3002;&#x7D9A;&#x3051;&#x3066;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x540D;&#x524D;&#x3092;&#x5165;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;

&#x3053;&#x308C;&#x3089;&#x306F;&#x3001;&#x4E00;&#x822C;&#x7684;&#x306B;&#x306F;&#x4FBF;&#x5229;&#x3060;&#x3051;&#x308C;&#x3069;&#x3082;&#x3001;&#x3053;&#x308C;&#x307E;&#x3067;&#x898B;&#x3066;&#x304D;&#x305F;&#x3082;&#x306E;&#x307B;&#x3069;&#x306F;&#x983B;&#x7E41;&#x306B;&#x7528;
&#x3044;&#x3089;&#x308C;&#x306A;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;C-x C-f &#xFF08;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#xFF09;&#x3084; C-x C-s&#xFF08;&#x30D5;&#x30A1;&#x30A4;&#x30EB;
&#x3092;&#x30BB;&#x30FC;&#x30D6;&#xFF09;&#x306F;&#x3053;&#x306E;&#x4EF2;&#x9593;&#x3067;&#x3059;&#x3002;&#x4ED6;&#x306B;&#x3001;C-x C-c&#xFF08;Emacs &#x3092;&#x7D42;&#x4E86;&#xFF09;&#x3082;&#x305D;&#x3046;&#x3067;&#x3059;&#x3002;C-x
C-c &#x306B;&#x95A2;&#x3057;&#x3066;&#x306F;&#x3001;&#x305D;&#x308C;&#x307E;&#x3067;&#x306B;&#x52A0;&#x3048;&#x305F;&#x5909;&#x66F4;&#x304C;&#x7121;&#x304F;&#x306A;&#x308B;&#x306E;&#x3092;&#x5FC3;&#x914D;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x3042;&#x308A;&#x307E;
&#x305B;&#x3093;&#x3002;Emacs &#x3092;&#x7D42;&#x4E86;&#x3055;&#x305B;&#x308B;&#x524D;&#x306B;&#x3001;&#x5909;&#x66F4;&#x3055;&#x308C;&#x305F;&#x5404;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;
&#x805E;&#x3044;&#x3066;&#x304D;&#x307E;&#x3059;&#x304B;&#x3089;&#x3002;
</code></pre><p>&#x300C;&#x610F;&#x6C17;&#x63DA;&#x3005;&#x3068;&#x6B69;&#x304D;&#x3060;&#x3057;&#x305F;&#x79C1;&#x305F;&#x3061;&#x306E;&#x524D;&#x306B;&#x8868;&#x308C;&#x305F;&#x306E;&#x306F;&#xFF0C;&#x3053;&#x308C;&#x304B;&#x3089;&#x69D8;&#x3005;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x8972;&#x3044;&#x304B;&#x304B;&#x3063;&#x3066;&#x304F;&#x308B;&#x3067;&#x3042;&#x308D;&#x3046;&#xFF0C;&#x305D;&#x3046;&#x4E88;&#x611F;&#x3055;&#x305B;&#x308B;&#x8A18;&#x8FF0;&#x3067;&#x3042;&#x3063;&#x305F;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x3082;&#x306F;&#x3084;&#x6E80;&#x8EAB;&#x5275;&#x75CD;&#x306E;&#x79C1;&#x305F;&#x3061;&#x306B;&#x751F;&#x304D;&#x306E;&#x3073;&#x308B;&#x8853;&#x306F;&#x6B8B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3060;&#x308D;&#x3046;&#x304B;&#x300D;&#x300C;&#x5F85;&#x3066;&#x3002;&#x307E;&#x3060;&#x305D;&#x3046;&#x3068;&#x6C7A;&#x307E;&#x3063;&#x305F;&#x308F;&#x3051;&#x3058;&#x3083;&#x306A;&#x3044;&#x3002;&#x5148;&#x306B;&#x9032;&#x3082;&#x3046;&#x300D;&#x300C;&#x305D;&#x3046;&#x3057;&#x3066;&#x79C1;&#x3092;&#x4FC3;&#x3059;EeePC&#x3002;&#x3060;&#x304C;&#x305D;&#x306E;&#x8868;&#x60C5;&#x306B;&#x306F;&#x4E0D;&#x5B89;&#x304C;&#x5E83;&#x304C;&#x3063;&#x3066;&#x3044;&#x308B;&#x300D;&#x300C;&#x5F85;&#x3066;&#x3002;&#x52DD;&#x624B;&#x306B;&#x5224;&#x65AD;&#x3059;&#x308B;&#x306A;&#x300D;  </p>
<p><br>  </p>
<pre><code>If you are using a graphical display, you don&apos;t need any special
command to move from Emacs to another application.  You can do this
with the mouse or with window manager commands.  However, if you&apos;re
using a text terminal which can only show one application at a time,
you need to &quot;suspend&quot; Emacs to move to any other application.
</code></pre><blockquote>
<p>&#x3082;&#x3057;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30AB;&#x30EB;&#x30C7;&#x30A3;&#x30B9;&#x30D7;&#x30EC;&#x30A4;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#xFF0C;Emacs&#x304B;&#x3089;&#x4ED6;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3046;&#x3064;&#x308B;&#x305F;&#x3081;&#x306E;&#x7279;&#x6B8A;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x5FC5;&#x8981;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x30DE;&#x30A6;&#x30B9;&#x3084;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x30DE;&#x30CD;&#x30FC;&#x30B8;&#x30E3;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x3057;&#x304B;&#x3057;&#xFF0C;&#x3082;&#x3057;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x7AEF;&#x672B;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x3066;&#x4E00;&#x5EA6;&#x306B;&#x3072;&#x3068;&#x3064;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x8868;&#x793A;&#x3067;&#x304D;&#x306A;&#x3044;&#x306E;&#x306A;&#x3089;&#xFF0C;&#x4ED6;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3046;&#x3064;&#x308B;&#x305F;&#x3081;&#x306B;Emacs&#x3092;&#x300C;&#x4E2D;&#x65AD;&#x300D;&#x3055;&#x305B;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;  </p>
</blockquote>
<p><br>  </p>
<pre><code>C-z &#x306F;&#x300C;&#x4E00;&#x6642;&#x7684;&#x306B;&#x300D; Emacs &#x3092;&#x629C;&#x3051;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;&#x307E;&#x305F;&#x540C;&#x3058; Emacs &#x30BB;&#x30C3;&#x30B7;&#x30E7;
** C-z has been rebound, but you can use C-x C-z instead [More] **
&#x30F3;&#x306B;&#x623B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&#x305D;&#x308C;&#x304C;&#x3067;&#x304D;&#x308B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x4E0A;&#x306A;&#x3089;&#x3001;C-z &#x306F; Emacs &#x3092;&#x300C;&#x4E2D;&#x65AD;&#x300D;&#x3055;&#x305B;&#x307E;&#x3059;&#x3002;&#x3064;&#x307E;&#x308A;
Emacs &#x3092;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3053;&#x3068;&#x306A;&#x304F;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30B7;&#x30A7;&#x30EB;&#x306B;&#x623B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x5927;&#x65B9;&#x306E;&#x6A19;
&#x6E96;&#x7684;&#x306A;&#x30B7;&#x30A7;&#x30EB;&#x306A;&#x3089;&#x3001;&#x300C;fg&#x300D; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3082;&#x3057;&#x304F;&#x306F; &#x300C;%emacs&#x300D; &#x306B;&#x3088;&#x3063;&#x3066; Emacs &#x3092;&#x518D;&#x958B;
&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;

&#x300C;&#x4E2D;&#x65AD;&#x300D;&#x6A5F;&#x80FD;&#x3092;&#x5B9F;&#x88C5;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x3001;C-z &#x306F; Emacs &#x306E;&#x4E0B;&#x3067;&#x8D70;&#x308B;&#x30B5;&#x30D6;
&#x30B7;&#x30A7;&#x30EB;&#x3092;&#x4F5C;&#x308A;&#x3001;&#x4ED6;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x8D70;&#x3089;&#x305B;&#x3066;&#x304B;&#x3089;&#x307E;&#x305F; Emacs &#x306B;&#x623B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;
&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x5834;&#x5408;&#x672C;&#x5F53;&#x306B; Emacs &#x304B;&#x3089;&#x629C;&#x3051;&#x51FA;&#x308B;&#x308F;&#x3051;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x306E;
&#x3067;&#x3001;&#x30B7;&#x30A7;&#x30EB;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E; &#x300C;exit&#x300D; &#x304C;&#x305D;&#x306E;&#x30B5;&#x30D6;&#x30B7;&#x30A7;&#x30EB;&#x304B;&#x3089; Emacs &#x306B;&#x623B;&#x308B;&#x666E;&#x901A;&#x306E;&#x3084;
&#x308A;&#x65B9;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3042;&#x308C;&#xFF1F;&#x79C1;C-z&#x3063;&#x3066;&#x4F55;&#x306B;&#x5272;&#x308A;&#x3042;&#x3066;&#x3066;&#x305F;&#x3063;&#x3051;&#x2026;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x3042;&#xFF0C;<a href="https://ja.osdn.net/projects/gnupack/" target="_blank">gnupack</a>&#x3060;&#x3068;C-z&#x306F;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x30C0;&#x30A6;&#x30F3; (C-v) &#x306B;&#x306A;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;C-z&#x306F;&#xFF0C;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;Caps Lock&#x306B;&#x5165;&#x308C;&#x66FF;&#x3048;&#x3066;&#x305F;&#x308A;&#xFF0C;&#x5C0F;&#x6307;&#x306E;&#x4ED8;&#x3051;&#x6839;&#x3067;&#x62BC;&#x3057;&#x3066;&#x305F;&#x308A;&#x3059;&#x308B;&#x4EBA;&#x3060;&#x3068;&#x697D;&#x3060;&#x3068;&#x601D;&#x3046;&#x3002;&#x3051;&#x3069;&#x79C1;&#x306F;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30AD;&#x30FC;&#x3092;&#x7121;&#x5909;&#x63DB;&#x306B;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3066;&#x308B;&#x304B;&#x3089;&#x300D;&#x300C;&#x3058;&#x3083;&#x3042;Caps Lock&#x306F;&#x4F55;&#x306E;&#x30AD;&#x30FC;&#x306B;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#xFF1F;&#x307E;&#x3055;&#x304B;&#x305D;&#x306E;&#x307E;&#x307E;&#x306A;&#x308F;&#x3051;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;<a href="https://github.com/jamcha-aa/xkb" target="_blank">skk&#x306E;sticky shift&#x30AD;&#x30FC;&#x306B;&#x3057;&#x3066;&#x307E;&#x3059;</a>&#x300D;&#x300C;&#x3088;&#x304F;&#x308F;&#x304B;&#x3089;&#x3093;&#x304C;&#x6709;&#x52B9;&#x306B;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x3093;&#x3060;&#x306A;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x541B;&#x306F;&#x3053;&#x3053;&#x3067;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x65B9;&#x6CD5;&#x3092;&#x4F7F;&#x3046;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;Emacs&#x306E;&#x4E2D;&#x65AD;&#xFF1F;&#x521D;&#x3081;&#x3066;&#x898B;&#x305F;&#x304B;&#x3082;&#x300D;&#x300C;&#x304A;&#x3044;&#x300D;&#x300C;&#x3082;&#x3057;&#x304F;&#x306F;&#x306F;&#x308B;&#x304B;&#x6614;&#x306B;&#x898B;&#x3066;&#x5FD8;&#x308C;&#x305F;&#x304B;&#x300D;&#x300C;&#x56F0;&#x3089;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x30B7;&#x30A7;&#x30EB;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306A;&#x3089;Emacs&#x306E;&#x4E2D;&#x304B;&#x3089;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3057;&#xFF0C;<a href="https://github.com/tmux/tmux/wiki" target="_blank">tmux</a>&#x3068;&#x304B;&#x4F7F;&#x3048;&#x3070;&#x30BF;&#x30FC;&#x30DF;&#x30CA;&#x30EB;&#x306E;&#x4E2D;&#x3067;&#x3082;&#x753B;&#x9762;&#x5206;&#x5272;&#x3067;&#x304D;&#x308B;&#x3057;&#x300D;&#x300C;&#x3084;&#x3089;&#x306A;&#x3044;&#x7406;&#x7531;&#x306A;&#x3089;&#x3044;&#x304F;&#x3089;&#x3067;&#x3082;&#x4F5C;&#x308C;&#x308B;&#x3053;&#x3068;&#x3092;&#x5FD8;&#x308C;&#x308B;&#x306A;&#x3088;&#x300D;&#x300C;&#x3054;&#x3081;&#x3093;&#x306A;&#x3055;&#x3044;&#x3002;C-x C-z&#x3067;&#x629C;&#x3051;&#x3066;&#xFF0C;fg&#x3067;&#x5FA9;&#x5E30;&#x306D;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x3002;&#x3053;&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306F;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3059;&#x308B;&#x305F;&#x3081;&#x3067;&#x306F;&#x306A;&#x304F;&#x3066;&#xFF0C;&#x65B0;&#x3057;&#x3044;&#x3053;&#x3068;&#x3092;&#x5B66;&#x3076;&#x305F;&#x3081;&#x306B;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x5FD8;&#x308C;&#x308B;&#x306A;&#x3088;&#x300D;&#x300C;&#x308F;&#x304B;&#x308A;&#x307E;&#x3057;&#x305F;&#x5148;&#x751F;!&#x300D;  </p>
<p><br>  </p>
<pre><code>C-x C-c &#x306F;&#x30ED;&#x30B0;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3088;&#x3046;&#x3068;&#x601D;&#x3046;&#x6642;&#x306B;&#x4F7F;&#x3046;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x30E1;&#x30FC;&#x30EB;&#x30C4;&#x30FC;&#x30EB;&#xFF08;mail
&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x7B49;&#xFF09;&#x3084;&#x305D;&#x306E;&#x4ED6;&#x306E;&#x69D8;&#x3005;&#x306A;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x304C;&#x8D77;&#x52D5;&#x3057;&#x305F; Emacs
&#x304B;&#x3089;&#x629C;&#x3051;&#x51FA;&#x308B;&#x5834;&#x5408;&#x306B;&#x4F7F;&#x3046;&#x306E;&#x3082;&#x6B63;&#x3057;&#x3044;&#x3084;&#x308A;&#x65B9;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F; Emacs
&#x306E;&#x4E2D;&#x65AD;&#x306B;&#x3069;&#x3046;&#x5BFE;&#x51E6;&#x3057;&#x3066;&#x826F;&#x3044;&#x304B;&#x77E5;&#x3089;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#x3089;&#x3002;
</code></pre><p>&#x300C;Emacs&#x4F7F;&#x3044;&#x59CB;&#x3081;&#x305F;&#x9803;&#x306F;&#x4F55;&#x304B;&#x3042;&#x3063;&#x305F;&#x3089;C-x C-c&#x3067;&#x7D42;&#x4E86;&#x3057;&#x3066;&#x3082;&#x3044;&#x3044;&#x304B;&#x3082;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;&#x3068;&#x308A;&#x3042;&#x3048;&#x305A;&#x306F;&#x3058;&#x3081;&#x306F;C-x C-c&#x3068;C-g&#x899A;&#x3048;&#x3066;&#x304A;&#x3051;&#x3070;&#x306A;&#x3093;&#x3068;&#x304B;&#x306A;&#x308B;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x30C9;&#x30E9;&#x30C3;&#x30B0;&#x30A2;&#x30F3;&#x30C9;&#x30C9;&#x30ED;&#x30C3;&#x30D7;&#x3067;&#x958B;&#x304F;&#x3057;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x7684;&#x306B;&#x306F;&#x611F;&#x5FC3;&#x3057;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x307E;&#x3042;&#xFF0C;&#x3044;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p><br>  </p>
<pre><code>C-x &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x305F;&#x304F;&#x3055;&#x3093;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x307E;&#x3067;&#x306B;&#x3001;&#x4EE5;&#x4E0B;&#x3092;&#x5B66;&#x3073;&#x307E;&#x3057;&#x305F;&#x3002;

      C-x C-f   &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x958B;&#x304F;&#xFF08;Find&#xFF09;
      C-x C-s   &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30BB;&#x30FC;&#x30D6;&#xFF08;Save&#xFF09;
      C-x C-b   &#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x30A2;&#x30C3;&#x30D7;
      C-x C-c   Emacs &#x3092;&#x7D42;&#x4E86;
      C-x 1     &#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3092;&#xFF11;&#x3064;&#x306B;&#x3059;&#x308B;&#xFF08;&#x3064;&#x307E;&#x308A;&#x4ED6;&#x306E;&#x30A6;&#x30A3;&#x30F3;&#x30C9;&#x30A6;&#x3092;&#x5168;&#x90E8;&#x6D88;&#x3059;&#xFF09;
      C-x u      &#x53D6;&#x308A;&#x6D88;&#x3057;
</code></pre><p>&#x300C;&#x3053;&#x3093;&#x306A;&#x306B;&#x3042;&#x3063;&#x305F;&#x3063;&#x3051;&#xFF1F;&#x300D;&#x300C;&#x304A;&#x3044;!&#x300D;&#x300C;&#x3042;&#x3068;C-x u&#x306F;C-/&#x306E;&#x65B9;&#x304C;&#x4FBF;&#x5229;&#x3060;&#x3088;!&#x304A;&#x5FD8;&#x308C;&#x306A;&#x304F;!&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x540D;&#x524D;&#x306B;&#x3088;&#x308B;&#x62E1;&#x5F35;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x306F;&#x3001;&#x3042;&#x307E;&#x308A;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3082;&#x306E;&#x3084;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x3057;&#x304B;&#x4F7F;
&#x308F;&#x306A;&#x3044;&#x3082;&#x306E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x305F;&#x3068;&#x3048;&#x3070; replace-string &#x3067;&#x3059;&#x304C;&#x3001;&#x3053;&#x308C;&#x306F;&#x6587;&#x5B57;&#x5217;&#x3092;&#x7F6E;
&#x63DB;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;M-x &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068;&#x3001;Emacs &#x306F;&#x753B;&#x9762;&#x306E;&#x6700;&#x4E0B;&#x884C;&#x306B; M-x &#x3068;&#x8868;&#x793A;
&#x3057;&#x5165;&#x529B;&#x3092;&#x4FC3;&#x3059;&#x306E;&#x3067;&#x3001;&#x305D;&#x3053;&#x306B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x540D;&#x524D;&#xFF08;&#x3053;&#x306E;&#x5834;&#x5408; &quot;replace-string&quot;&#xFF09;&#x3092;
&#x5165;&#x308C;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&quot;repl s&lt;TAB&gt;&quot; &#x3068;&#x3060;&#x3051;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x3068; Emacs &#x304C;&#x30B3;&#x30DE;
&#x30F3;&#x30C9;&#x540D;&#x3092;&#x88DC;&#x5B8C;&#x3057;&#x3066;&#x304F;&#x308C;&#x307E;&#x3059;&#x3002;&#xFF08;&lt;TAB&gt; &#x306F;&#x30BF;&#x30D6;&#x30AD;&#x30FC;&#x3067;&#x3059;&#x3002;&#x666E;&#x901A;&#x306F;&#x3001;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306E;
&#x5DE6;&#x7AEF;&#x3001;CapsLock &#x3082;&#x3057;&#x304F;&#x306F; Shift &#x30AD;&#x30FC;&#x306E;&#x8FD1;&#x304F;&#x306B;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#xFF09;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x540D;&#x3092;&#x5165;&#x308C;
&#x305F;&#x3089; &lt;Return&gt; &#x3092;&#x6253;&#x3063;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;

&quot;Replace string&quot; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x306F;&#x5F15;&#x6570;&#x304C;&#x4E8C;&#x3064;&#x5FC5;&#x8981;&#x3067;&#x3059;&#x3002;&#x3069;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3092;&#x3069;&#x3046;&#x7F6E;&#x63DB;
&#x3059;&#x308B;&#x304B;&#x3067;&#x3059;&#x3002;&#x5404;&#x5F15;&#x6570;&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x305F;&#x3073;&#x306B; &lt;Return&gt; &#x3092;&#x6253;&#x3063;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;

&gt;&gt; &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x3053;&#x3053;&#x304B;&#x3089;&#xFF12;&#x884C;&#x4E0B;&#x306E;&#x7A7A;&#x884C;&#x306B;&#x79FB;&#x52D5;&#x3055;&#x305B;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
   M-x repl s&lt;Return&gt;changed&lt;Return&gt;Altered&lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;

   &#x3053;&#x306E;&#x884C;&#x304C;&#x3069;&#x3046;&#x5909;&#x308F;&#x308B;&#x304B;(changed)&#x898B;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x3042;&#x306A;&#x305F;&#x306F;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x4EE5;&#x964D;&#x5168;&#x90E8;&#x306E;
   c-h-a-n-g-e-d &#x3068;&#x3044;&#x3046;&#x8A9E;&#x3092; &quot;altered&quot; &#x306B;&#x5909;&#x3048;&#x305F;&#x306E;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x5148;&#x751F;!&#x767A;&#x8A00;&#x3092;&#x3057;&#x3066;&#x3082;&#x3088;&#x308D;&#x3057;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;!&#x300D;&#x300C;&#x4F55;&#x304B;&#x306D;&#x3002;&#x8A00;&#x3063;&#x3066;&#x307F;&#x305F;&#x307E;&#x3048;&#x300D;&#x300C;&#x2026;&#x305D;&#x308C;&#x304C;&#x541B;&#x306E;&#x601D;&#x3046;&#x300E;&#x5148;&#x751F;&#x300F;&#x306A;&#x306E;&#xFF1F;&#x300D;&#x300C;&#x9055;&#x3046;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x60AA;&#x3044;&#x3053;&#x3068;&#x3057;&#x305F;&#x5B50;&#x4F9B;&#x306E;&#x982D;&#x3092;&#x9769;&#x9774;&#x3067;&#x3072;&#x3063;&#x3071;&#x305F;&#x3044;&#x305F;&#x308A;&#x3059;&#x308B;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x9774;&#x306F;&#x4F7F;&#x308F;&#x3093;&#x3002;&#x3076;&#x539A;&#x3044;&#x8F9E;&#x66F8;&#x3060;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x8A71;&#x3092;&#x623B;&#x305D;&#x3046;&#x304B;&#x3002;&#x4F55;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x4ECA;&#x307E;&#x3067;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x88DC;&#x5B8C;&#x306F;&#x30BF;&#x30D6;&#x3067;&#x304A;&#x3053;&#x306A;&#x3063;&#x3066;&#x307E;&#x3057;&#x305F;&#x3002;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x30AD;&#x30FC;&#x3067;&#x3082;&#x88DC;&#x5B8C;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x306A;&#x3093;&#x3066;&#x521D;&#x3081;&#x3066;&#x77E5;&#x3063;&#x305F;&#x300D;&#x300C;&#x4ECA;&#x5F8C;&#x306F;&#x4F7F;&#x3046;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x6163;&#x308C;&#x308B;&#x304B;&#x3057;&#x3070;&#x3089;&#x304F;&#x8A66;&#x3057;&#x3066;&#x307F;&#x308B;&#x300D;  </p>
<p>&#x300C;&#x4ED6;&#x306B;&#x306F;&#xFF1F;&#x300D;&#x300C;Emacs&#x3067;&#x306F;&#x30BF;&#x30D6;&#x30AD;&#x30FC;&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B;C-i&#x3092;&#x4F7F;&#x3046;&#x3002;<a href="https://github.com/k1LoW/emacs-drill-instructor/wiki" target="_blank">&#x9B3C;&#x8ECD;&#x66F9;.el</a>&#x3092;&#x5165;&#x308C;&#x308B;&#x3068;&#x935B;&#x3048;&#x3066;&#x304F;&#x308C;&#x308B;&#x3002;&#x3067;&#x3082;&#x79C1;&#x306F;&#x30BF;&#x30D6;&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3044;&#x307E;&#x3059;!&#x300D;&#x300C;&#x304A;&#x3044;!&#x307E;&#x305F;&#x77E2;&#x5370;&#x30AD;&#x30FC;&#x307F;&#x305F;&#x3044;&#x306A;&#x8A00;&#x3044;&#x8A33;&#x3059;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;<a href="https://github.com/ch11ng/exwm" target="_blank">exwm</a>&#x3067;&#x3075;&#x3064;&#x3046;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3082;&#x4F7F;&#x3046;&#x304B;&#x3089;C-i&#x304C;&#x66B4;&#x767A;&#x3059;&#x308B;&#x3068;&#x56F0;&#x308B;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3080;&#x2026;&#x305D;&#x308C;&#x306A;&#x3089;&#x3057;&#x3087;&#x3046;&#x304C;&#x306A;&#x3044;&#xFF0C;&#x306E;&#x304B;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x3042;&#x3068;&#x3072;&#x3068;&#x3064;&#x300D;&#x300C;&#xFF1F;&#x300D;&#x300C;M-x replace-string&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B; <strong>M-%</strong> &#x304C;&#x4F7F;&#x3048;&#x308B;&#x3002;&#x7F6E;&#x63DB;&#x306F;&#x3088;&#x304F;&#x4F7F;&#x3046;&#x304B;&#x3089;&#x899A;&#x3048;&#x308B;&#x3068;&#x4FBF;&#x5229;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x3042;&#xFF0C;&#x3082;&#x3046;&#x3072;&#x3068;&#x3064;!&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;&#x7269;&#x66F8;&#x304D;&#x306E;&#x4EBA;&#x5411;&#x3051;&#x306E;&#x6A5F;&#x80FD;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;C-SPC&#x3067;&#x7BC4;&#x56F2;&#x6307;&#x5B9A;&#x3057;&#x3066; <strong>M-=</strong> &#x3059;&#x308B;&#x3068;&#xFF0C;&#x4E00;&#x756A;&#x4E0B; (&#x30A8;&#x30B3;&#x30FC;&#x30A8;&#x30EA;&#x30A2;) &#x306B;&#x6587;&#x5B57;&#x6570;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x300D;&#x300C;&#x307B;&#x3046;&#x3002;&#x3053;&#x308C;&#x306F;&#x541B;&#x306E;&#x305F;&#x3081;&#x306B;&#x3042;&#x308B;&#x3088;&#x3046;&#x306A;&#x6A5F;&#x80FD;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x3053;&#x308C;&#x77E5;&#x3063;&#x3066;&#x304B;&#x3089;&#x305A;&#x3063;&#x3068;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x3002;&#x3059;&#x3054;&#x304F;&#x4FBF;&#x5229;&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3080;&#xFF0C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x30B5;&#x30A4;&#x30BA;&#x306F;&#x3068;&#x3082;&#x304B;&#x304F;&#xFF0C;&#x6587;&#x5B57;&#x6570;&#x306F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x306A;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;<a href="http://www.stallman.org/" target="_blank">&#x3053;&#x306E;Emacs&#x4F5C;&#x3063;&#x305F;&#x4EBA;</a>&#x306F;<a href="https://lists.gnu.org/archive/html/emacs-devel/2013-11/msg00515.html" target="_blank">Emacs&#x306B;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x6A5F;&#x80FD;&#x3092;&#x6301;&#x305F;&#x305B;&#x305F;&#x3044;</a>&#x3063;&#x3066;<a href="https://lists.gnu.org/archive/html/emacs-devel/2018-03/msg00089.html" target="_blank">&#x305A;&#x3063;&#x3068;&#x8A00;&#x3063;&#x3066;&#x308B;</a>&#x304B;&#x3089;&#xFF0C;&#x6587;&#x7AE0;&#x66F8;&#x304F;&#x306E;&#x306B;&#x5F79;&#x7ACB;&#x3064;&#x6A5F;&#x80FD;&#x304C;&#x3064;&#x3044;&#x3066;&#x308B;&#x306E;&#x304B;&#x3082;&#x300D;&#x300C;&#x3053;&#x306E;Emacs&#xFF1F;&#x300D;&#x300C;<a href="http://finseth.com/emacs.html" target="_blank">Emacs&#x306F;&#x3044;&#x308D;&#x3093;&#x306A;&#x7A2E;&#x985E;&#x304C;&#x3042;&#x308B;&#x304B;&#x3089;</a>&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="13.html" class="navigation navigation-prev " aria-label="Previous page: 13 - 見るもの統べて">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="15.html" class="navigation navigation-next " aria-label="Next page: 15 - 癒しの泉">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"14 - コマゴマとしたコマンド","level":"5.3","depth":1,"next":{"title":"15 - 癒しの泉","level":"6.1","depth":1,"path":"15.md","ref":"15.md","articles":[]},"previous":{"title":"13 - 見るもの統べて","level":"5.2","depth":1,"path":"13.md","ref":"13.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"14.md","mtime":"2018-08-16T08:42:32.607Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T19:17:58.747Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

