
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>15 - 癒しの泉 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="16.html" />
    
    
    <link rel="prev" href="14.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter active" data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="21.html">
            
                <a href="21.html">
            
                    
                    21 - 答えは目の前にある
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="22.html">
            
                <a href="22.html">
            
                    
                    22 - 旅立ち
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">エピローグ</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="23.html">
            
                <a href="23.html">
            
                    
                    23 - そして
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.2" data-path="24.html">
            
                <a href="24.html">
            
                    
                    24 - それから
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >15 - 癒しの泉</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="15---&#x7652;&#x3057;&#x306E;&#x6CC9;">15 - &#x7652;&#x3057;&#x306E;&#x6CC9;</h1>
<p>&#x79C1;&#x304C;&#x4F55;&#x5EA6;&#x3082;&#x54B3;&#x8FBC;&#x3080;&#x306E;&#x3067;EeePC&#x304C;&#x5FC3;&#x914D;&#x3059;&#x308B;&#x3002;&#x300C;&#x304A;&#x3044;&#x3002;&#x5927;&#x4E08;&#x592B;&#x304B;&#x3002;&#x7121;&#x7406;&#x3059;&#x308B;&#x306A;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x75B2;&#x308C;&#x3066;&#x308B;&#x306E;&#x304B;&#x306A;&#x2026;&#x300D;&#x300C;&#x3075;&#x3089;&#x3075;&#x3089;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3002;Emacs&#x306E;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3067;&#x5012;&#x308C;&#x308B;&#x3084;&#x3064;&#x306A;&#x3093;&#x3066;&#x898B;&#x305F;&#x3053;&#x3068;&#x306A;&#x3044;&#x305E;&#x300D;&#x300C;&#x3048;&#x30FC;&#x2026;&#xFF1F;&#x305D;&#x308C;&#x3088;&#x308A;&#x3055;&#x3041;&#x2026;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3057;&#x3066;&#x308B;&#x4EBA;&#x3060;&#x3063;&#x3066;&#x2026;&#x898B;&#x305F;&#x3053;&#x3068;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x2026;&#xFF1F;&#x300D;&#x300C;&#x304A;&#x3044;&#xFF0C;&#x5197;&#x8AC7;&#x8A00;&#x3063;&#x3066;&#x308B;&#x6687;&#x304C;&#x3042;&#x3063;&#x305F;&#x3089;&#x4F11;&#x3081;&#x2026;&#x300D;&#x300C;&#x3078;&#x3078;&#x2026;&#x3053;&#x308C;&#x3067;&#x6C17;&#x3092;&#x5931;&#x3063;&#x305F;&#x3089;&#x2026;Emacs&#x306E;&#x4F1D;&#x8AAC;&#x304C;&#x2026;&#x3072;&#x3068;&#x3064;&#x5897;&#x3048;&#x308B;&#x2026;&#x304B;&#x306A;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x304A;&#x3044;!&#x3057;&#x3063;&#x304B;&#x308A;&#x3057;&#x308D;!&#x304A;&#x3044;!&#x304A;&#x30FC;&#x3044;!&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x7CF8;&#x306E;&#x5207;&#x308C;&#x305F;&#x4EBA;&#x5F62;&#x306E;&#x3088;&#x3046;&#x306B;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306B;&#x5012;&#x308C;&#x3053;&#x3093;&#x3060;&#x3002;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;
============

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5909;&#x66F4;&#x3092;&#x52A0;&#x3048;&#x3066;&#x307E;&#x3060;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001;&#x305D;&#x308C;&#x3089;&#x306E;&#x5909;&#x66F4;&#x306F;&#x8A08;&#x7B97;&#x6A5F;&#x304C;
&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3059;&#x308B;&#x3068;&#x5931;&#x308F;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x305D;&#x3046;&#x3044;&#x3046;&#x4E8B;&#x614B;&#x3092;&#x907F;&#x3051;&#x308B;&#x305F;
&#x3081;&#x3001;&#x7DE8;&#x96C6;&#x4E2D;&#x306E;&#x5404;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x3064;&#x3044;&#x3066;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x5B9A;&#x671F;&#x7684;&#x306B;&#x66F8;&#x304B;&#x308C;&#x307E;&#x3059;&#x3002;
&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x982D;&#x3068;&#x304A;&#x5C3B;&#x306B; # &#x304C;&#x4ED8;&#x3044;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070; &quot;hello.c&quot; &#x3068;&#x3044;
&#x3046;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F; &quot;#hello.c#&quot; &#x3067;&#x3059;&#x3002;&#x901A;&#x5E38;&#x306E;&#x65B9;&#x6CD5;&#x3067;&#x30D5;&#x30A1;&#x30A4;
&#x30EB;&#x3092;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x3068;&#x304D;&#x306B;&#x3001;&#x305D;&#x3046;&#x3044;&#x3046;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x6D88;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;

&#x8A08;&#x7B97;&#x6A5F;&#x304C;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x3055;&#x308C;&#x305F;&#x7DE8;&#x96C6;&#x3092;&#x56DE;&#x5FA9;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;
&#x307E;&#x3059;&#x3002;&#x666E;&#x901A;&#x306B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#xFF08;&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3044;&#x305F;&#x3082;&#x306E;&#x3067;&#x3001;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3058;&#x3083;&#x3042;&#x308A;&#x307E;
&#x305B;&#x3093;&#xFF09;&#x3092;&#x958B;&#x304D;&#x3001;&#x305D;&#x308C;&#x304B;&#x3089; M-x recover file &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3059;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;&#x78BA;
&#x8A8D;&#x3092;&#x6C42;&#x3081;&#x3066;&#x304D;&#x307E;&#x3059;&#x306E;&#x3067;&#x3001;yes&lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x3055;&#x308C;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x56DE;
&#x5FA9;&#x3057;&#x307E;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3042;&#x308C;&#x2026;&#xFF1F;&#x300D;&#x9854;&#x3092;&#x4E0A;&#x3052;&#x308B;&#x79C1;&#x3002;&#x76F4;&#x5F8C;&#xFF0C;&#x982C;&#x3092;&#x88C2;&#x304B;&#x308C;&#x308B;&#x3088;&#x3046;&#x306A;&#x6FC0;&#x75DB;&#x304C;&#x306F;&#x3057;&#x308B;&#x3002;&#x300C;&#x3044;&#x305F;&#x3063;&#x2026;&#x300D;  </p>
<p>EeePC&#x304C;&#x5927;&#x7B11;&#x3044;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x300C;&#x541B;&#x306E;&#x9854;&#x3002;&#x93E1;&#x3067;&#x898B;&#x3066;&#x307F;&#x308D;&#x3002;&#x3072;&#x3069;&#x3044;&#x3082;&#x3093;&#x3060;&#x300D;&#x8A00;&#x308F;&#x308C;&#x308B;&#x307E;&#x307E;&#xFF0C;&#x30E2;&#x30CB;&#x30BF;&#x306E;&#x6A2A;&#x306B;&#x7F6E;&#x3044;&#x305F;&#x30DF;&#x30CB;&#x30FC;&#x30DE;&#x30A6;&#x30B9;&#x306E;&#x93E1;&#x3067;&#x9854;&#x3092;&#x898B;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x3046;&#x308F;&#x3063;&#x300D;&#x79C1;&#x306E;&#x9854;&#x306B;&#x306F;&#xFF0C;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x306E;&#x8DE1;&#x304C;&#x683C;&#x5B50;&#x72B6;&#x306B;&#x304F;&#x3063;&#x304D;&#x308A;&#x3068;&#x6B8B;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x300C;&#x306F;&#x3041;&#x2026;&#x3069;&#x3046;&#x3057;&#x3088;&#x3046;&#x2026;&#x300D;&#x56F0;&#x3063;&#x305F;&#x9854;&#x3067;EeePC&#x3092;&#x898B;&#x308B;&#x3002;EeePC&#x306F;&#x610F;&#x5730;&#x60AA;&#x305D;&#x3046;&#x306B;&#x8A00;&#x3063;&#x305F;&#x3002;&#x300C;&#x3057;&#x3070;&#x3089;&#x304F;&#x306F;&#x5916;&#x306B;&#x51FA;&#x3089;&#x308C;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x306A;&#x3041;&#x300D;&#x300C;&#x3048;&#x30FC;&#xFF0C;&#x56F0;&#x308B;&#x3088;&#x2026;&#x300D;&#x300C;&#x3044;&#x3044;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF0C;&#x4F11;&#x3080;&#x53E3;&#x5B9F;&#x304C;&#x3067;&#x304D;&#x305F;&#x3093;&#x3060;&#x3057;&#x306A;&#x300D;&#x300C;&#x305D;&#x3093;&#x306A;&#xFF0C;&#x4F11;&#x3081;&#x306A;&#x3044;&#x3063;&#x3066;&#x300D;  </p>
<p>&#x300C;&#x3044;&#x3084;&#xFF0C;&#x541B;&#x306F;&#x4F11;&#x3081;&#x300D;&#x6025;&#x306B;EeePC&#x304C;&#x771F;&#x5263;&#x306A;&#x53E3;&#x8ABF;&#x306B;&#x306A;&#x308B;&#x3002;&#x300C;&#x541B;&#x306F;&#x75B2;&#x308C;&#x304D;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x5341;&#x5206;&#x306B;&#x4F53;&#x8ABF;&#x3082;&#x56DE;&#x5FA9;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x306E;&#x306B;&#xFF0C;&#x79C1;&#x306B;&#x306F;&#x308A;&#x3064;&#x3044;&#x3066;&#x7121;&#x8336;&#x3070;&#x304B;&#x308A;&#x3057;&#x3066;&#x300D;&#x300C;&#x2026;&#x3060;&#x3063;&#x3066;&#xFF0C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x304C;&#x2026;&#x300D;&#x300C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x306F;&#x541B;&#x306E;&#x3053;&#x308C;&#x304B;&#x3089;&#x306E;&#x5192;&#x967A;&#x3092;&#x652F;&#x3048;&#x308B;&#x3082;&#x306E;&#x3060;&#x3002;&#x305D;&#x3053;&#x3067;&#x529B;&#x3064;&#x304D;&#x305F;&#x3089;&#xFF0C;&#x4F55;&#x306E;&#x610F;&#x5473;&#x3082;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x305D;&#x3046;&#x3060;&#x3051;&#x3069;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x7121;&#x7406;&#x3092;&#x3057;&#x3066;&#x306F;&#x304B;&#x3069;&#x308B;&#x306F;&#x305A;&#x304C;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x7279;&#x306B;&#x3053;&#x308C;&#x306F;&#x982D;&#x3092;&#x4F7F;&#x3046;&#x3082;&#x306E;&#x306A;&#x3093;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x3046;&#x3093;&#x2026;&#x300D;&#x300C;&#x3057;&#x3063;&#x304B;&#x308A;&#x4F11;&#x3093;&#x3067;&#xFF0C;&#x982D;&#x3092;&#x3059;&#x3063;&#x304D;&#x308A;&#x3055;&#x305B;&#x3066;&#x304B;&#x3089;&#xFF0C;&#x307E;&#x305F;&#x3084;&#x308C;&#x3070;&#x3044;&#x3044;&#x3002;&#x30AA;&#x30F3;&#x30E9;&#x30A4;&#x30F3;&#x30B2;&#x30FC;&#x30E0;&#x3068;&#x9055;&#x3063;&#x3066;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x304C;&#x7D42;&#x308F;&#x308B;&#x3082;&#x306E;&#x3067;&#x3082;&#x306A;&#x3044;&#x3093;&#x3060;&#x3002;&#x305D;&#x3046;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x2026;&#x3046;&#x3093;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x307B;&#x3089;&#x3002;&#x5E03;&#x56E3;&#x306B;&#x6A2A;&#x306B;&#x306A;&#x3063;&#x3066;&#x300D;&#x300C;&#x3044;&#xFF0C;&#x3044;&#x3044;&#x3088;&#x81EA;&#x5206;&#x3067;&#x3084;&#x308B;&#x304B;&#x3089;&#x300D;&#x300C;&#x306F;&#x3044;&#xFF0C;&#x307A;&#x3093;&#x304E;&#x3093;&#x3055;&#x3093;&#x300D;&#x300C;&#x3084;&#xFF0C;&#x3084;&#x3081;&#x3066;&#x3088;&#x6065;&#x305A;&#x304B;&#x3057;&#x3044;&#x306A;&#x300D;&#x300C;&#x97F3;&#x697D;&#x306F;&#x8981;&#x308B;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3048;&#xFF0C;&#x3048;&#x3048;&#x3068;&#xFF0C;&#x3058;&#x3083;&#x3042;&#xFF0C;&#x30BD;&#x30D5;&#x30C8;&#x30B8;&#x30E3;&#x30BA;&#x2026;&#x300D;&#x300C;&#x307E;&#x304B;&#x305B;&#x308D;&#x300D;  </p>
<p>&#x79C1;&#x304C;&#x96FB;&#x6C17;&#x3092;&#x6D88;&#x3059;&#x3068;&#xFF0C;&#x8EFD;&#x3084;&#x304B;&#x306A;&#x30D4;&#x30A2;&#x30CE;&#xFF0C;&#x30C8;&#x30E9;&#x30F3;&#x30DA;&#x30C3;&#x30C8;&#x306E;&#x67D4;&#x3089;&#x304B;&#x3044;&#x97F3;&#x8272;&#x304C;&#x79C1;&#x3092;&#x5305;&#x3080;&#x3002;&#x307E;&#x308B;&#x3067;&#x591C;&#x306E;&#x30D1;&#x30D6;&#x3067;&#x7720;&#x304F;&#x306A;&#x3063;&#x305F;&#x5B50;&#x4F9B;&#x306E;&#x3088;&#x3046;&#x306B;&#xFF0C;&#x79C1;&#x306F;&#x6E29;&#x304B;&#x3044;&#x7720;&#x308A;&#x306E;&#x4E2D;&#x306B;&#x843D;&#x3061;&#x3066;&#x3044;&#x3063;&#x305F;&#x3002;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30A8;&#x30B3;&#x30FC;&#x30A8;&#x30EA;&#x30A2;
==============

&#x3082;&#x3057;&#x3086;&#x3063;&#x304F;&#x308A;&#x3068;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x6253;&#x3063;&#x305F;&#x306A;&#x3089;&#x3070;&#x3001;&#x753B;&#x9762;&#x306E;&#x4E0B;&#x306E;&#x30A8;&#x30B3;&#x30FC;&#x30A8;&#x30EA;&#x30A2;&#x3068;&#x547C;&#x3070;&#x308C;
&#x308B;&#x5834;&#x6240;&#x306B;&#x6253;&#x3063;&#x305F;&#x3082;&#x306E;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x30A8;&#x30B3;&#x30FC;&#x30A8;&#x30EA;&#x30A2;&#x306F;&#x753B;&#x9762;&#x306E;&#x6700;&#x4E0B;&#x884C;&#x3067;&#x3059;&#x3002;
</code></pre><p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="14.html" class="navigation navigation-prev " aria-label="Previous page: 14 - コマゴマとしたコマンド">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="16.html" class="navigation navigation-next " aria-label="Next page: 16 - メジャーの厚い壁">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"15 - 癒しの泉","level":"6.1","depth":1,"next":{"title":"16 - メジャーの厚い壁","level":"6.2","depth":1,"path":"16.md","ref":"16.md","articles":[]},"previous":{"title":"14 - コマゴマとしたコマンド","level":"5.3","depth":1,"path":"14.md","ref":"14.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"15.md","mtime":"2018-08-15T17:30:30.228Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T18:06:09.538Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

