
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>16 - メジャーの厚い壁 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="15.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >16 - メジャーの厚い壁</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="16---&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x306E;&#x539A;&#x3044;&#x58C1;">16 - &#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x306E;&#x539A;&#x3044;&#x58C1;</h1>
<p>&#x300C;&#x3055;&#x307E;&#x3056;&#x307E;&#x306A;&#x82E6;&#x96E3;&#x3092;&#x300D;&#x300C;&#x5BC4;&#x308A;&#x9053;&#x306A;&#x300D;&#x300C;&#x306E;&#x308A;&#x3053;&#x3048;&#x3066;&#x79C1;&#x305F;&#x3061;&#x306F;&#x9032;&#x3093;&#x3067;&#x304D;&#x305F;&#x3002;&#x3057;&#x304B;&#x3057;&#xFF0C;&#x79C1;&#x305F;&#x3061;&#x306E;&#x524D;&#x306B;&#x6700;&#x5927;&#x306E;&#x6575;&#x304C;&#x7ACB;&#x3061;&#x306F;&#x3060;&#x304B;&#x3063;&#x305F;!&#x300D;&#x300C;&#x6575;&#x3063;&#x3066;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x300E;&#x79C1;&#xFF0C;&#x3069;&#x3046;&#x3057;&#x3066;&#x3082;&#x541B;&#x306B;&#x8A00;&#x3063;&#x3066;&#x304A;&#x304D;&#x305F;&#x3044;&#x3053;&#x3068;&#x304C;&#x3042;&#x3063;&#x305F;&#x3093;&#x3060;&#x2026;&#x300F;&#x3082;&#x306F;&#x3084;&#x52D5;&#x304F;&#x4F53;&#x529B;&#x3082;&#x6B8B;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x79C1;&#x306F;&#xFF0C;&#x868A;&#x306E;&#x9CF4;&#x304F;&#x3088;&#x3046;&#x306A;&#x58F0;&#x3067;EeePC&#x306B;&#x8A9E;&#x308A;&#x304B;&#x3051;&#x308B;&#x300D;&#x300C;&#x52D5;&#x3051;&#x306A;&#x3044;&#x306E;&#x306F;&#x30C1;&#x30E3;&#x30FC;&#x30CF;&#x30F3;&#x98DF;&#x3079;&#x3059;&#x304E;&#x305F;&#x304B;&#x3089;&#x3060;&#x308D;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x306D;&#x3048;&#xFF0C;&#x3061;&#x3083;&#x3093;&#x3068;&#x805E;&#x3044;&#x3066;&#x3088;&#xFF0C;&#x771F;&#x5263;&#x306A;&#x30B7;&#x30FC;&#x30F3;&#x306A;&#x3093;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x3042;&#x30FC;&#x2026;&#x3086;&#xFF0C;&#x300E;&#x907A;&#x8A00;&#x306A;&#x3089;&#x304A;&#x65AD;&#x308A;&#x3060;&#x305C;&#x300F;&#x2026;&#x3002;&#x3060;&#x305C;&#x3063;&#xFF0C;&#x3066;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x300E;&#x3075;&#x3075;&#x3063;&#x2026;&#x6700;&#x5F8C;&#x307E;&#x3067;&#x2026;&#x610F;&#x5730;&#x60AA;&#x306A;&#x3093;&#x3060;&#x304B;&#x3089;&#x2026;&#x300F;&#x79C1;&#x304C;&#x30B4;&#x30DB;&#x30B4;&#x30DB;&#x3068;&#x305B;&#x304D;&#x3053;&#x3080;&#x3002;&#x8D64;&#x3044;&#x96EB;&#x304C;&#x53E3;&#x304B;&#x3089;&#x3053;&#x307C;&#x308C;&#x308B;&#x300D;&#x300C;&#x304A;&#x304A;&#x3052;&#x3055;&#x3059;&#x304E;&#x308B;&#x3060;&#x308D;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x300E;&#x305C;&#x2026;&#x524D;&#x56DE;&#x2026;&#x8A08;&#x7B97;&#x6A5F;&#x3063;&#x3066;&#x66F8;&#x304B;&#x308C;&#x3066;&#x305F;&#x3067;&#x3057;&#x3087;&#x2026;&#x305D;&#x308C;&#x3067;&#x2026;&#x3069;&#x3046;&#x3057;&#x3066;&#x3082;&#x8A00;&#x3044;&#x305F;&#x3044;&#x3053;&#x3068;&#x304C;&#x3042;&#x3063;&#x3066;&#x2026;&#x300F;&#x300D;&#x300C;&#x81EA;&#x52D5;&#x30BB;&#x30FC;&#x30D6;&#x306E;&#x3068;&#x3053;&#x308D;&#x3060;&#x306A;&#x3002;&#x4F55;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x300E;&#x307E;&#x2026;Mac OS9&#x307E;&#x3067;&#x2026;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x305F;&#x2026;&#x96FB;&#x5353;&#x2026;&#x8A08;&#x2026;&#x7B97;&#x6A5F;&#x2026;&#x3063;&#x3066;&#x2026;&#x3044;&#x3046;&#x3093;&#x3060;&#x2026;&#x3051;&#x3069;&#x2026;&#x300F;&#x300D;&#x300C;&#x2026;&#x3042;&#xFF0C;&#x3042;&#x3042;&#x2026;&#x300D;&#x300C;&#x300E;&#x3042;&#x308C;&#x2026;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x2026;&#x3057;&#x305F;&#x306E;&#x304C;&#x2026;&#x30B9;&#x30C6;&#x30A3;&#x30FC;&#x30D6;&#x2026;&#x30B8;&#x30E7;&#x30D6;&#x2026;&#x30BA;&#x2026;&#x300F;  </p>
<p>&#x305D;&#x306E;&#x8A00;&#x8449;&#x3092;&#x6700;&#x5F8C;&#x306B;&#xFF0C;&#x79C1;&#x306F;&#x9759;&#x304B;&#x306B;&#x76EE;&#x3092;&#x9589;&#x3058;&#x305F;&#x3002;&#x305D;&#x306E;&#x9854;&#x306F;&#x7A4F;&#x3084;&#x304B;&#x306A;&#x3082;&#x306E;&#x3060;&#x3063;&#x305F;&#x3002;&#x307E;&#x308B;&#x3067;&#xFF0C;&#x7720;&#x3063;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306B;&#x2026;&#x300D;  </p>
<p><br><br>&#x300C;&#x2026;&#x304A;&#x3044;&#xFF0C;&#x3055;&#x3063;&#x3055;&#x3068;&#x8D77;&#x304D;&#x308D;&#x3002;&#x307B;&#x3089;&#xFF0C;&#x5148;&#x306B;&#x9032;&#x3080;&#x305E;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#xFF0A;&#x30E2;&#x30FC;&#x30C9;&#x30E9;&#x30A4;&#x30F3;
==============

&#x30A8;&#x30B3;&#x30FC;&#x30A8;&#x30EA;&#x30A2;&#x306E;&#x3059;&#x3050;&#x4E0A;&#x306E;&#x884C;&#x306F;&#x3001;&#x30E2;&#x30FC;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3068;&#x547C;&#x3073;&#x307E;&#x3059;&#x3002;&#x30E2;&#x30FC;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306F;&#x3053;&#x3093;
&#x306A;&#x98A8;&#x306B;&#x898B;&#x3048;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;

-J:**-  TUTORIAL.ja       (Fundamental)--L670--58%----------------

&#x3053;&#x306E;&#x884C;&#x306F; Emacs &#x306E;&#x72B6;&#x614B;&#x53CA;&#x3073;&#x7DE8;&#x96C6;&#x4E2D;&#x306E;&#x6587;&#x7AE0;&#x306B;&#x3064;&#x3044;&#x3066;&#x6709;&#x76CA;&#x306A;&#x60C5;&#x5831;&#x3092;&#x4E0E;&#x3048;&#x3066;&#x304F;&#x308C;&#x307E;
&#x3059;&#x3002;

&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3082;&#x3046;&#x5206;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x306D;&#x3002;&#x305D;&#x308C;&#x306F;&#x3042;&#x306A;&#x305F;&#x304C;&#x958B;&#x3044;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3067;
&#x3059;&#x3002;-NN%-- &#x306F;&#x6587;&#x7AE0;&#x4E2D;&#x306E;&#x73FE;&#x5728;&#x4F4D;&#x7F6E;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x6587;&#x7AE0;&#x306E; NN% &#x304C;&#x753B;&#x9762;&#x6700;&#x4E0A;&#x6BB5;&#x3088;
&#x308A;&#x524D;&#x306B;&#x3042;&#x308B;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;&#x3082;&#x3057;&#x6587;&#x7AE0;&#x306E;&#x6700;&#x521D;&#x306E;&#x884C;&#x304C;&#x753B;&#x9762;&#x306B;&#x3042;&#x308B;&#x6642;&#x306B;&#x306F; --00%--
&#x306E;&#x4EE3;&#x308A;&#x306B; --Top-- &#x3068;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x6587;&#x7AE0;&#x306E;&#x6700;&#x5F8C;&#x306E;&#x884C;&#x304C;&#x753B;&#x9762;&#x306B;&#x3042;&#x308B;&#x6642;&#x306B;&#x306F;
--Bot-- &#x3068;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;&#x3082;&#x3057;&#x753B;&#x9762;&#x306B;&#x5168;&#x90E8;&#x53CE;&#x307E;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x3088;&#x3046;&#x306A;&#x77ED;&#x3044;&#x6587;&#x7AE0;&#x3092;&#x898B;&#x3066;
&#x3044;&#x308B;&#x3068;&#x304D;&#x306B;&#x306F; --All-- &#x3068;&#x8868;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;

L &#x3068;&#x305D;&#x308C;&#x306B;&#x7D9A;&#x304F;&#x6570;&#x5B57;&#x306F;&#x73FE;&#x5728;&#x306E;&#x884C;&#x756A;&#x53F7;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;

&#x5148;&#x982D;&#x8FD1;&#x304F;&#x306E;&#x661F;&#x5370;&#x306F;&#x3001;&#x3042;&#x306A;&#x305F;&#x304C;&#x6587;&#x7AE0;&#x3092;&#x5909;&#x66F4;&#x3057;&#x305F;&#x3053;&#x3068;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;
&#x958B;&#x3044;&#x305F;&#x76F4;&#x5F8C;&#x3084;&#x3001;&#x30BB;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x76F4;&#x5F8C;&#x306F;&#x3001;&#x305D;&#x306E;&#x90E8;&#x5206;&#x306B;&#x306F;&#x661F;&#x5370;&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B;&#x30C0;&#x30C3;&#x30B7;&#x30E5; &#x300C;-&#x300D;
&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;

&#x62EC;&#x5F27;&#x306B;&#x56F2;&#x307E;&#x308C;&#x305F;&#x90E8;&#x5206;&#x306F;&#x3069;&#x3093;&#x306A;&#x7DE8;&#x96C6;&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x3044;&#x308B;&#x304B;&#x3092;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;
&quot;Fundamental&quot; &#x3068;&#x3044;&#x3046;&#x30E2;&#x30FC;&#x30C9;&#x3001;&#x3053;&#x308C;&#x304C;&#x73FE;&#x5728;&#x306E;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x300C;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;
&#x30C9;&#xFF08;major mode&#xFF09;&#x300D;&#x306E;&#x4E00;&#x4F8B;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x3055;&#x3063;&#x304D;&#x6700;&#x5927;&#x306E;&#x6575;&#x3063;&#x3066;&#x8A00;&#x3063;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x3042;&#x308C;&#xFF0C;&#x307E;&#x3093;&#x3056;&#x3089;&#x5618;&#x3067;&#x3082;&#x306A;&#x304F;&#x3066;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x30E2;&#x30FC;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x7AE0;&#x306F;Emacs&#x3092;&#x69CB;&#x6210;&#x3059;&#x308B;&#x90E8;&#x54C1;&#x306E;&#x8AAC;&#x660E;&#x3060;&#x304B;&#x3089;&#x4F55;&#x3082;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x306A;&#x3044;&#x306E;&#x300D;&#x300C;&#x2026;&#x305D;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x3069;&#x3046;&#x305B;&#x3060;&#x304B;&#x3089;&#x307E;&#x3093;&#x3056;&#x3089;&#x306E;&#x8A9E;&#x6E90;&#x3067;&#x3082;&#x8AAC;&#x660E;&#x3057;&#x3088;&#x3046;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3044;&#x3084;&#x2026;&#x3044;&#x3044;&#x300D;  </p>
<p><br>  </p>
<pre><code>Emacs &#x306B;&#x306F;&#x591A;&#x304F;&#x306E;&#x7A2E;&#x985E;&#x306E;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;Lisp mode &#x3084;Text mode
&#x306E;&#x3088;&#x3046;&#x306B;&#x3001;&#x3069;&#x3093;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x8A00;&#x8A9E;&#x3084;&#x3069;&#x3093;&#x306A;&#x7A2E;&#x985E;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x7DE8;&#x96C6;&#x4E2D;&#x304B;&#x3092;&#x610F;&#x5473;&#x3059;&#x308B;&#x3082;
&#x306E;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3044;&#x3064;&#x3067;&#x3082;&#x5FC5;&#x305A;&#x3044;&#x305A;&#x308C;&#x304B;&#x306E;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x72B6;&#x614B;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x3069;&#x306E;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x3044;&#x308B;&#x306E;&#x304B;&#x306F;&#x3001;&#x30E2;&#x30FC;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x73FE;&#x5728;&#x306F; &quot;Fundamental&quot; &#x3068;
&#x8868;&#x793A;&#x3057;&#x3066;&#x3044;&#x308B;&#x90E8;&#x5206;&#x3092;&#x898B;&#x308C;&#x3070;&#x5206;&#x308A;&#x307E;&#x3059;&#x3002;

&#x5404;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306F;&#x5E7E;&#x3064;&#x304B;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306B;&#x7570;&#x306A;&#x308B;&#x632F;&#x308B;&#x821E;&#x3044;&#x3092;&#x3055;&#x305B;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;
&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x30EA;&#x30B9;&#x30C8;&#x4E2D;&#x306B;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x5165;&#x308C;&#x308B;&#x305F;&#x3081;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30B3;&#x30E1;&#x30F3;&#x30C8;
&#x306E;&#x5F62;&#x5F0F;&#xFF08;&#x30B7;&#x30F3;&#x30BF;&#x30C3;&#x30AF;&#x30B9;&#xFF09;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x8A00;&#x8A9E;&#x306B;&#x3088;&#x3063;&#x3066;&#x7570;&#x306A;&#x308A;&#x3001;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;
&#x306F;&#x3001;&#x305D;&#x308C;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x8A00;&#x8A9E;&#x306B;&#x5408;&#x3063;&#x305F;&#x5F62;&#x5F0F;&#x3067;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x633F;&#x5165;&#x3057;&#x307E;&#x3059;&#x3002;&#x5404;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;
&#x30C9;&#x306F;&#x62E1;&#x5F35;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x540D;&#x524D;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3064;&#x307E;&#x308A;&#x305D;&#x306E;&#x62E1;&#x5F35;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30E1;
&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x3092;&#x5207;&#x308A;&#x63DB;&#x3048;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;M-x fundamental-mode &#x3068;&#x3044;&#x3046;&#x306E;
&#x306F; Fundamental &#x30E2;&#x30FC;&#x30C9;&#x306B;&#x5207;&#x308A;&#x63DB;&#x3048;&#x308B;&#x305F;&#x3081;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;

&#x3082;&#x3057;&#x3001;&#x901A;&#x5E38;&#x306E;&#x82F1;&#x8A9E;&#x3084;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x6587;&#x7AE0;&#xFF08;&#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x3088;&#x3046;&#x306A;&#xFF09;&#x3092;&#x7DE8;&#x96C6;&#x3059;&#x308B;&#x306E;&#x306A;&#x3089;
&#x3070;&#x3001;Text mode &#x3092;&#x4F7F;&#x3044;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
&gt;&gt; M-x text-mode &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x307F;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x3063;&#x3066;&#x96E3;&#x3057;&#x305D;&#x3046;&#x306A;&#x540D;&#x524D;&#x3064;&#x3044;&#x3066;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x5927;&#x62B5;&#x306F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x958B;&#x3051;&#x3070;&#x305D;&#x308C;&#x306B;&#x9069;&#x3057;&#x305F;&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;  </p>
<p>&#x300C;&#x306D;&#x3048;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;Lisp&#x3063;&#x3066;&#x5358;&#x8A9E;&#x304C;&#x51FA;&#x3066;&#x304D;&#x305F;&#x304B;&#x3089;Bernard Greenberg&#x306E;&#x8A71;&#x3092;&#x3057;&#x305F;&#x304F;&#x306A;&#x3063;&#x305F;&#x300D;&#x300C;&#x2026;&#x6211;&#x6162;&#x3067;&#x304D;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3067;&#x304D;&#x306A;&#x3044;&#x300D;&#x300C;&#x2026;&#x76EE;&#x304C;&#x672C;&#x6C17;&#x3060;&#x306A;&#x3002;&#x3058;&#x3083;&#x3042;&#x3057;&#x3087;&#x3046;&#x304C;&#x306A;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x307E;&#x305A;Emacs&#x306F;&#x7DE8;&#x96C6;&#x6A5F;&#x80FD;&#x306E;&#x3064;&#x3044;&#x305F;Lisp&#x30DE;&#x30B7;&#x30F3;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x5510;&#x7A81;&#x3059;&#x304E;&#x3066;&#x308F;&#x304B;&#x3089;&#x3093;&#x305E;&#x300D;&#x300C;Emacs&#x306B;&#x3068;&#x3063;&#x3066;Lisp&#x8A00;&#x8A9E;&#x306F;&#x30AA;&#x30DE;&#x30B1;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#xFF0C;<a href="https://ayatakesi.github.io/emacs/26.1/html/Intro.html#Intro" target="_blank">Emacs&#x306E;&#x4E2D;&#x8EAB;&#x306F;&#x307B;&#x3068;&#x3093;&#x3069;Lisp&#x3067;&#x66F8;&#x304B;&#x308C;&#x3066;&#x308B;&#x306E;</a>&#x3002;&#x5DE5;&#x5834;&#x3067;&#x4F5C;&#x3089;&#x308C;&#x305F;&#x88FD;&#x54C1;&#x3092;&#x81EA;&#x5206;&#x597D;&#x307F;&#x306B;&#x3059;&#x308B;&#x306E;&#x306F;&#x9650;&#x754C;&#x304C;&#x3042;&#x308B;&#x3051;&#x3069;&#xFF0C;3D&#x30D7;&#x30EA;&#x30F3;&#x30BF;&#x304C;&#x3042;&#x308C;&#x3070;&#x8A2D;&#x8A08;&#x56F3;&#x6B21;&#x7B2C;&#x3067;&#x4F55;&#x3067;&#x3082;&#x4F5C;&#x308C;&#x308B;&#x3058;&#x3083;&#x3093;&#xFF0C;&#x3066;&#x3044;&#x3046;&#x9006;&#x8EE2;&#x306E;&#x767A;&#x60F3;&#x3057;&#x305F;&#x306E;&#x304C;Emacs&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3080;&#x3002;Lisp&#x30DE;&#x30B7;&#x30F3;&#x304C;&#x4ECA;&#x306E;&#x305F;&#x3068;&#x3048;&#x3067;&#x3044;&#x3046;3D&#x30D7;&#x30EA;&#x30F3;&#x30BF;&#x3060;&#x306A;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3002;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x3042;&#x307E;&#x308A;&#x77E5;&#x3089;&#x308C;&#x3066;&#x306A;&#x3044;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;<a href="https://www.gnu.org/gnu/rms-lisp.ja.html" target="_blank">&#x305D;&#x306E;&#x767A;&#x60F3;&#x3092;&#x6700;&#x521D;&#x306B;&#x5B9F;&#x73FE;&#x3057;&#x305F;</a>&#x306E;&#x304C;Greenberg&#x3063;&#x3066;&#x4EBA;&#x3002;<a href="http://stallman.org/" target="_blank">&#x4ECA;&#x306E;Emacs&#x4F5C;&#x3063;&#x305F;&#x4EBA;</a>&#x3058;&#x3083;&#x306A;&#x3044;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;Unix&#x304C;&#x4F5C;&#x3089;&#x308C;&#x308B;&#x304D;&#x3063;&#x304B;&#x3051;&#x306B;&#x306A;&#x3063;&#x305F;Multics&#x3063;&#x3066;&#x3044;&#x3046;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306B;&#x305D;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x3092;&#x5B9F;&#x88C5;&#x3057;&#x305F;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x5049;&#x4EBA;&#x3060;&#x306A;&#x300D;&#x300C;&#x3067;&#x3082;Greenberg&#x81EA;&#x8EAB;&#x304C;<a href="https://www.gnu.org/gnu/rms-lisp.ja.html#foot-2" target="_blank">Daniel Weinreb</a>&#x306E;&#x307B;&#x3046;&#x304C;&#x5148;&#x3060;&#x3063;&#x3066;&#x8A00;&#x3063;&#x3066;&#x308B;&#x304B;&#x3089;&#x6700;&#x521D;&#x3063;&#x3066;&#x306E;&#x306F;&#x9593;&#x9055;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x3048;&#x3002;&#x3058;&#x3083;&#x3042;&#x306A;&#x3093;&#x3067;&#x541B;&#x306F;Greenberg&#x306E;&#x8A71;&#x3092;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x306E;&#x597D;&#x304D;&#x306A;<a href="http://www.cypac.co.jp/static/beatword/" target="_blank">BeatWord</a>&#x3063;&#x3066;&#x3044;&#x3046;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x958B;&#x767A;&#x3057;&#x3066;&#x305F;&#x304B;&#x3089;&#x300D;&#x300C;&#x3069;&#x3093;&#x306A;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x306A;&#x3093;&#x3060;&#x300D;&#x300C;&#x4E00;&#x679A;&#x306E;&#x7D19;&#x306B;&#x7E26;&#x66F8;&#x304D;&#x306E;&#x6587;&#x7AE0;&#x3068;&#x6A2A;&#x66F8;&#x304D;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x81EA;&#x7531;&#x306B;&#x914D;&#x7F6E;&#x3067;&#x304D;&#x308B;&#x3093;&#x3060;&#x3088;&#x3002;&#x8A13;&#x7DF4;&#x3055;&#x308C;&#x305F;&#x30A8;&#x30AF;&#x30BB;&#x30EB;&#x8077;&#x4EBA;&#x3058;&#x3083;&#x306A;&#x3044;&#x3068;&#x3067;&#x304D;&#x306A;&#x3044;&#x3084;&#x3064;&#x300D;&#x300C;&#x3042;&#x3042;&#x2026;&#x300D;&#x300C;&#x3053;&#x306E;&#x307E;&#x307E;&#x77E5;&#x3089;&#x308C;&#x306A;&#x304F;&#x306A;&#x3063;&#x3066;&#x3044;&#x304F;&#x306E;&#x306F;&#x30A4;&#x30E4;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x3069;&#x3046;&#x3057;&#x3066;&#x3082;&#x3044;&#x307E;&#x8A00;&#x3044;&#x305F;&#x304B;&#x3063;&#x305F;&#x3093;&#x3060;&#x3002;&#x3054;&#x3081;&#x3093;&#x306D;&#x300D;&#x300C;&#x8B1D;&#x308B;&#x3053;&#x3068;&#x306F;&#x306A;&#x3044;&#x3055;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x5FC3;&#x914D;&#x3057;&#x306A;&#x3044;&#x3067;&#x3002;&#x3053;&#x308C;&#x307E;&#x3067;&#x5B66;&#x3093;&#x3060;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x305F;&#x3044;&#x3057;&#x3066;&#x5909;&#x308F;&#x308A;&#x307E;&#x305B;&#x3093;&#x304B;&#x3089;&#x3002;&#x3060;&#x3051;&#x3069;&#x3001;
M-f &#x3084; M-b &#x304C;&#x30A2;&#x30DD;&#x30B9;&#x30C8;&#x30ED;&#x30D5;&#x30A3; &quot;&apos;&quot; &#x3092;&#x5358;&#x8A9E;&#x306E;&#x4E00;&#x90E8;&#x3060;&#x3068;&#x89E3;&#x91C8;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x305F;&#x306E;
&#x304C;&#x5206;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x4EE5;&#x524D;&#x306E; Fundamental &#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F; M-f &#x3084; M-b &#x306F; &quot;&apos;&quot; &#x3092;&#x5358;&#x8A9E;
&#x306E;&#x533A;&#x5207;&#x308A;&#x3068;&#x898B;&#x306A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;

&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306F;&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x4E9B;&#x7D30;&#x306A;&#x9055;&#x3044;&#x3092;&#x751F;&#x307F;&#x307E;&#x3059;&#x3002;&#x5927;&#x6982;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3069;&#x306E;&#x30E1;
&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x3082;&#x540C;&#x3058;&#x50CD;&#x304D;&#x3092;&#x3057;&#x307E;&#x3059;&#x304C;&#x3001;&#x5B9F;&#x969B;&#x306E;&#x52D5;&#x304D;&#x306F;&#x5C11;&#x3057;&#x3060;&#x3051;&#x3053;&#x3068;&#x306A;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;

&#x73FE;&#x5728;&#x306E;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x8AAC;&#x660E;&#x6587;&#x3092;&#x898B;&#x308B;&#x306B;&#x306F; C-h m &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;
** C-h m has been rebound, but you can use &lt;f1&gt; m instead [More] **
&gt;&gt; C-u C-v &#x3092;&#x4E00;&#x4E8C;&#x5EA6;&#x3084;&#x3063;&#x3066;&#x3053;&#x306E;&#x884C;&#x3092;&#x753B;&#x9762;&#x306E;&#x4E0A;&#x306E;&#x65B9;&#x306B;&#x6301;&#x3063;&#x3066;&#x3044;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
&gt;&gt; C-h m &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3001;Text mode &#x3068; Fundamental mode &#x306E;&#x9055;&#x3044;&#x3092;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
&gt;&gt; C-x 1 &#x3067; Text mode &#x306E;&#x8AAC;&#x660E;&#x6587;&#x3092;&#x753B;&#x9762;&#x304B;&#x3089;&#x6D88;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;
</code></pre><p>&#x300C;C-v&#x3063;&#x3066;&#x4E00;&#x753B;&#x9762;&#x4E0B;&#x306B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3055;&#x305B;&#x308B;&#x3058;&#x3083;&#x3093;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x3069;&#x3046;&#x3057;&#x3066;C-u C-v&#x3067;&#x5C11;&#x3057;&#x305A;&#x3064;&#x3057;&#x304B;&#x30B9;&#x30AF;&#x30ED;&#x30FC;&#x30EB;&#x3057;&#x306A;&#x3044;&#x3093;&#x3060;&#x308D;&#x3046;&#x3068;&#x601D;&#x3063;&#x305F;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;<a href="https://jamcha-aa.github.io/Emacs-tutorial/06.html" target="_blank">&#x524D;&#x306B;&#x3084;&#x3063;&#x3066;&#x305F;</a>&#x300D;&#x300C;&#x306F;&#x3041;&#xFF1F;&#x300D;&#x300C;&#x5FD8;&#x308C;&#x3066;&#x305F;&#x300D;&#x300C;&#x304A;&#x3044;!&#x5FA9;&#x7FD2;&#x5927;&#x4E8B;&#x3063;&#x3066;&#x8A00;&#x3063;&#x305F;&#x306E;&#x306F;&#x541B;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3059;&#x307F;&#x307E;&#x305B;&#x3093;&#x300D;  </p>
<p>&#x300C;&#x307E;&#x305F;&#x59CB;&#x3081;&#x304B;&#x3089;&#x3084;&#x308A;&#x306A;&#x304A;&#x3059;&#x304B;&#x300D;&#x300C;Iyadesu. Zettai, Iyadesu.&#x300D;  </p>
<p><br><br>&#x53C2;&#x8003;: &#x30B8;&#x30E7;&#x30D6;&#x30BA;&#x304C;&#x30C7;&#x30B9;&#x30AF;&#x30A2;&#x30AF;&#x30BB;&#x30B5;&#x30EA;&#x300E;&#x8A08;&#x7B97;&#x6A5F;&#x300F;&#x306E;&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x3092;&#x3057;&#x305F;&#x3068;&#x3044;&#x3046;&#x9038;&#x8A71;&#x306F;&#x300E;<a href="https://www.oreilly.co.jp/books/4873112451/" target="_blank">&#x30EC;&#x30DC;&#x30EA;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x30A4;&#x30F3;&#x30FB;&#x30B6;&#x30FB;&#x30D0;&#x30EC;&#x30FC;</a>&#x300F;&#x300E;<a href="https://www.kadokawa.co.jp/product/200708000476/" target="_blank">Mac&#x518D;&#x767A;&#x898B;&#x306E;&#x65C5;</a>&#x300F;&#x306A;&#x3069;&#x3067;&#x89E6;&#x308C;&#x3089;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="15.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 15 - 癒しの泉">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"16 - メジャーの厚い壁","level":"6.2","depth":1,"previous":{"title":"15 - 癒しの泉","level":"6.1","depth":1,"path":"15.md","ref":"15.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"16.md","mtime":"2018-08-16T08:39:22.213Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-16T08:40:07.592Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

