
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>17 - マイナーも厚い壁 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="18.html" />
    
    
    <link rel="prev" href="16.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >17 - マイナーも厚い壁</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="17---&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x3082;&#x539A;&#x3044;&#x58C1;">17 - &#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x3082;&#x539A;&#x3044;&#x58C1;</h1>
<pre><code>    &#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x304C;&#x300C;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x300D;&#x3068;&#x3044;&#x3046;&#x304B;&#x3089;&#x306B;&#x306F;&#x300C;&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x300D;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
    &#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306F;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B;&#x306A;&#x308B;&#x3082;&#x306E;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x305D;&#x308C;&#x3092;&#x3061;&#x3087;&#x3063;
    &#x3068;&#x3060;&#x3051;&#x4FEE;&#x6B63;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x5404;&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306F;&#x3001;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x3084;&#x4ED6;&#x306E;&#x30DE;&#x30A4;&#x30CA;&#x30FC;
    &#x30E2;&#x30FC;&#x30C9;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x305A;&#x306B;&#x3001;&#x305D;&#x308C;&#x3060;&#x3051;&#x3092;&#x30AA;&#x30F3;&#x30AA;&#x30D5;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3064;&#x307E;&#x308A;&#x3001;&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;
    &#x30C9;&#x3092;&#x5168;&#x304F;&#x4F7F;&#x308F;&#x306A;&#x304B;&#x3063;&#x305F;&#x308A;&#x3001;&#x4E00;&#x500B;&#x3060;&#x3051;&#x4F7F;&#x3063;&#x305F;&#x308A;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x3092;&#x540C;&#x6642;&#x306B;&#x4F7F;&#x3063;&#x305F;&#x308A;&#x3067;&#x304D;
    &#x308B;&#x306E;&#x3067;&#x3059;&#x3002;
</code></pre><p>&#x300C;&#x79C1;&#x306E;&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;&#x30C9;!&#x300D;&#x300C;<a href="https://github.com/jamcha-aa/auto-org-md" target="_blank">auto-org-md</a>&#x3060;&#x306A;&#x300D;&#x300C;&#x79C1;&#x306F;<a href="https://orgmode.org/" target="_blank">org-mode</a>&#x3067;&#x6587;&#x7AE0;&#x66F8;&#x3044;&#x3066;&#x308B;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x5F53;&#x6642;GitHub&#x306F;org&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x306A;&#x304F;&#x3066;&#xFF0C;&#x3044;&#x3061;&#x3044;&#x3061;C-c C-e m m&#x3067;markdown&#x306B;&#x5909;&#x63DB;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x3063;&#x305F;&#x3093;&#x3060;&#x3002;&#x3067;&#x3082;&#x305D;&#x308C;&#x304C;&#x9762;&#x5012;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x30BB;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x3054;&#x3068;&#x306B;&#x51FA;&#x529B;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x3068;&#x3044;&#x3044;&#x306A;&#xFF0C;&#x3068;&#x601D;&#x3063;&#x305F;&#x306E;&#x304C;&#x304D;&#x3063;&#x304B;&#x3051;&#x300D;&#x300C;&#x3042;&#x3042;&#x300D;&#x300C;&#x307B;&#x3068;&#x3093;&#x3069;&#x521D;&#x3081;&#x3066;&#x306E;lisp&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3060;&#x3063;&#x305F;&#x3051;&#x3069;&#xFF0C;melpa&#x306E;&#x30EC;&#x30D3;&#x30E5;&#x30A2;&#x30FC;&#x306E;&#x4EBA;&#x305F;&#x3061;&#x304C;&#x3059;&#x3054;&#x304F;&#x89AA;&#x5207;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x5F62;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;&#x3042;&#x308A;&#x304C;&#x3068;&#x3046;&#x3054;&#x3056;&#x3044;&#x307E;&#x3059;&#x300D;&#x300C;&#x672C;&#x5F53;&#x306B;&#x3042;&#x308A;&#x304C;&#x305F;&#x3044;&#x3053;&#x3068;&#x3060;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x901A;&#x5E38;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x7DE8;&#x96C6;&#x3057;&#x3066;&#x3044;&#x308B;&#x6642;&#x306B;&#x3068;&#x3066;&#x3082;&#x4FBF;&#x5229;&#x306A;&#x30DE;&#x30A4;&#x30CA;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x4E00;&#x3064;&#x306B;&#x30AA;&#x30FC;&#x30C8;&#x30D5;&#x30A3;
&#x30EB;&#xFF08;Auto Fill&#xFF09;&#x30E2;&#x30FC;&#x30C9;&#x3068;&#x3044;&#x3046;&#x306E;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30E2;&#x30FC;&#x30C9;&#x304C;&#x30AA;&#x30F3;&#x306E;&#x6642;&#x306B;&#x6587;&#x7AE0;&#x3092;
&#x5165;&#x529B;&#x3057;&#x3066;&#x3044;&#x3063;&#x3066;&#x884C;&#x3092;&#x9577;&#x304F;&#x3057;&#x3059;&#x304E;&#x305F;&#x5834;&#x5408;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x5358;&#x8A9E;&#x3068;&#x5358;&#x8A9E;&#x306E;&#x9593;&#x3067;&#x884C;&#x304C;&#x5206;&#x5272;&#x3055;
&#x308C;&#x307E;&#x3059;&#xFF08;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x5834;&#x5408;&#x306F;&#x3069;&#x306E;&#x6587;&#x5B57;&#x306E;&#x9593;&#x3067;&#x3082;&#x3002;&#x7981;&#x5247;&#x51E6;&#x7406;&#x3082;&#x306A;&#x3055;&#x308C;&#x307E;&#x3059;&#xFF09;&#x3002;

Auto Fill &#x30E2;&#x30FC;&#x30C9;&#x306F; M-x auto-fill-mode &lt;Return&gt; &#x3068;&#x3084;&#x308C;&#x3070;&#x30AA;&#x30F3;&#x306B;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
&#x305D;&#x308C;&#x304C;&#x30AA;&#x30F3;&#x306E;&#x72B6;&#x614B;&#x3067; M-x auto-fill-mode &lt;Return&gt; &#x3068;&#x3084;&#x308C;&#x304C;&#x30AA;&#x30D5;&#x306B;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;
&#x3053;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x3001;&#x30E2;&#x30FC;&#x30C9;&#x304C;&#x30AA;&#x30D5;&#x306A;&#x3089;&#x30AA;&#x30F3;&#x306B;&#x3001;&#x30AA;&#x30F3;&#x306A;&#x3089;&#x30AA;&#x30D5;&#x306B;&#x3059;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;&#x3053;&#x3046;
&#x3044;&#x3046;&#x306E;&#x3092;&#x300C;&#x30E2;&#x30FC;&#x30C9;&#x3092;&#x30C8;&#x30B0;&#x30EB;&#x3059;&#x308B;&#x300D;&#x3068;&#x8A00;&#x3044;&#x307E;&#x3059;&#x3002;

&gt;&gt; M-x auto-fill-mode &lt;Return&gt; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x3001; &quot;asdf &quot; &#x3067;&#x59CB;&#x307E;&#x308B;&#x884C;&#x3092;&#x5165;&#x529B;
   &#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;&#x884C;&#x304C;&#x5206;&#x5272;&#x3055;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F55;&#x5EA6;&#x3082; &quot;asdf &quot; &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x30B9;
   &#x30DA;&#x30FC;&#x30B9;&#x3092;&#x5FD8;&#x308C;&#x305A;&#x306B;&#x3002;Auto Fill &#x306F;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x304C;&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;&#x6642;&#x306E;&#x307F;&#x50CD;&#x304D;&#x307E;&#x3059;&#x3002;

&#x53F3;&#x30DE;&#x30FC;&#x30B8;&#x30F3;&#x306F;&#x901A;&#x5E38; 70 &#x6587;&#x5B57;&#xFF08;&#x30AB;&#x30E9;&#x30E0;&#xFF09;&#x3067;&#x3059;&#x304C;&#x3001;C-x f &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3053;&#x308C;&#x3092;&#x5909;&#x66F4;&#x3059;
&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x6307;&#x5B9A;&#x306E;&#x6587;&#x5B57;&#x6570;&#x3092;&#x6570;&#x5024;&#x5F15;&#x6570;&#x3068;&#x3057;&#x3066;&#x4E0E;&#x3048;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x6570;&#x5024;&#x5F15;&#x6570; 20 &#x3067; C-x f &#x3092;&#x3084;&#x308A;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002; (C-u 2 0 C-x f)&#x3002;
   &#x305D;&#x308C;&#x304B;&#x3089;&#x9069;&#x5F53;&#x306A;&#x6587;&#x7AE0;&#xFF08;&#x82F1;&#x8A9E;&#xFF09;&#x3092;&#x5165;&#x529B;&#x3057;&#x3001;20 &#x6587;&#x5B57;&#x3067;&#x884C;&#x304C;&#x5206;&#x5272;&#x3055;&#x308C;&#x308B;&#x306E;&#x3092;&#x898B;&#x3066;
   &#x307F;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x308C;&#x304B;&#x3089; C-x f &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x307E;&#x305F;&#x30DE;&#x30FC;&#x30B8;&#x30F3;&#x3092; 70 &#x6587;&#x5B57;&#x306B;&#x623B;&#x3057;&#x3066;
   &#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;&#x30C8;&#x30B0;&#x30EB;&#x306F;Emacs&#x306E;&#x5C02;&#x9580;&#x7528;&#x8A9E;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x30C8;&#x30B0;&#x30EB;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x304B;&#x3089;&#x304D;&#x3066;&#x307E;&#x3059;&#x300D;&#x300C;&#x30C8;&#x30B0;&#x30EB;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x300D;&#x300C;&#x30D6;&#x30EC;&#x30FC;&#x30AB;&#x30FC;&#x306E;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x307F;&#x305F;&#x3044;&#x306B;&#xFF0C;&#x58C1;&#x304B;&#x3089;&#x98DB;&#x3073;&#x51FA;&#x305F;&#x68D2;&#x3092;&#x4E0A;&#x4E0B;&#x3059;&#x308B;&#x3068;&#x96FB;&#x6E90;&#x304C;&#x30AA;&#x30F3;&#x30AA;&#x30D5;&#x3055;&#x308C;&#x308B;&#x4ED5;&#x7D44;&#x307F;&#x306E;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x300D;&#x300C;&#x308F;&#x304B;&#x3063;&#x305F;&#x300D;  </p>
<p>&#x300C;Auto Fill&#x304C;&#x5F79;&#x7ACB;&#x3064;&#x306E;&#x306F;&#x81EA;&#x524D;&#x3067;&#x6587;&#x66F8;&#x3092;&#x516C;&#x958B;&#x3059;&#x308B;&#x3068;&#x304D;&#x3068;&#x304B;&#xFF0C;&#x304B;&#x306A;&#xFF1F;&#x3053;&#x3046;&#x3044;&#x3046;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3082;&#x305D;&#x3046;&#x300D;&#x300C;&#x307B;&#x3046;&#x300D;&#x300C;GitHub&#x3068;&#x304B;GitBook&#x306F;&#x4F55;&#x3082;&#x3057;&#x306A;&#x304F;&#x3066;&#x3082;&#x5927;&#x4F53;&#x306E;&#x9577;&#x3055;&#x3067;&#x6298;&#x308A;&#x8FD4;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x304B;&#x3089;&#x304A;&#x624B;&#x8EFD;&#x3067;&#x3059;&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3080;&#xFF0C;&#x3068;&#x3053;&#x308D;&#x3067;&#x541B;&#x304C;&#x4F1A;&#x8A71;&#x6587;&#x3067;&#x6539;&#x884C;&#x3057;&#x306A;&#x3044;&#x306E;&#x306F;&#x306A;&#x305C;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x3044;&#x3064;&#x304B;&#x805E;&#x304B;&#x308C;&#x308B;&#x3068;&#x601D;&#x3063;&#x305F;&#x3002;&#x7406;&#x7531;&#x306F;&#x4E09;&#x3064;&#x3002;&#x307E;&#x305A;&#x8A71;&#x3059;&#x3054;&#x3068;&#x306B;&#x6539;&#x884C;&#x3057;&#x3066;&#x308B;&#x3068;&#x8AB0;&#x304C;&#x8A00;&#x3063;&#x3066;&#x308B;&#x306E;&#x304B;&#x308F;&#x304B;&#x3089;&#x306A;&#x304F;&#x306A;&#x308B;&#x300D;&#x300C;&#x8AB0;&#x304C;&#x300D;&#x300C;&#x79C1;&#x304C;&#x300D;&#x300C;&#x304A;&#x2026;&#x304A;&#x3046;&#x3002;&#x3058;&#x3083;&#x3042;&#xFF0C;&#x30AB;&#x30C3;&#x30B3;&#x306E;&#x524D;&#x306B;&#x30AD;&#x30E3;&#x30E9;&#x540D;&#x3064;&#x3051;&#x308C;&#x3070;&#x308F;&#x304B;&#x308B;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x811A;&#x672C;&#x307F;&#x305F;&#x3044;&#x306B;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x300D;&#x300C;&#x305D;&#x308C;&#x304C;&#x4E8C;&#x3064;&#x3081;&#x306E;&#x7406;&#x7531;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x811A;&#x672C;&#x3068;&#x304B;TRPG&#x306E;&#x30ED;&#x30B0;&#x307F;&#x305F;&#x3044;&#x3067;&#x7269;&#x8A9E;&#x8AAD;&#x3093;&#x3067;&#x308B;&#x611F;&#x3058;&#x304C;&#x3057;&#x306A;&#x3044;&#x300D;&#x300C;&#x8AB0;&#x304C;&#x300D;&#x300C;&#x79C1;&#x304C;&#x300D;&#x300C;&#x307B;&#x2026;&#x307B;&#x3046;&#x2026;&#x3002;&#x3058;&#x3083;&#x3042;&#x4E09;&#x3064;&#x3081;&#x306F;&#xFF1F;&#x300D;&#x300C;markdown&#x306F;&#x6539;&#x884C;&#x3082;&#x30A4;&#x30F3;&#x30C7;&#x30F3;&#x30C8;&#x3082;&#x53CD;&#x6620;&#x3057;&#x3066;&#x304F;&#x308C;&#x306A;&#x3044;&#x304B;&#x3089;&#x300D;  </p>
<p>&#x300C;&#x30A4;&#x30F3;&#x30C7;&#x30F3;&#x30C8;&#x306F;&#x3057;&#x3066;&#x304F;&#x308C;&#x306A;&#x3044;&#x304C;&#x6539;&#x884C;&#x306F;&#x3057;&#x3066;&#x304F;&#x308C;&#x308B;&#x305E;&#x300D;&#x300C;&#x3048;&#x300D;&#x300C;&#x6539;&#x884C;&#x3057;&#x305F;&#x3042;&#x3068;&#x306B;&#xFF0C;&#x534A;&#x89D2;&#x30B9;&#x30DA;&#x30FC;&#x30B9;2&#x500B;&#x5165;&#x308C;&#x3066;&#x307F;&#x308D;&#x300D;  </p>
<p><br><br>&#x300C;&#x2026;&#x300D;<br>&#x300C;&#x306A;&#xFF1F;&#x300D;<br>&#x300C;&#x2026;&#x3046;&#x3093;&#x300D;<br>&#x300C;&#x307E;&#x3055;&#x304B;&#x77E5;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x306E;&#x304B;&#xFF1F;&#x300D;<br>&#x300C;&#x2026;&#x3046;&#x3093;&#x300D;<br>&#x300C;&#x2026;&#x3059;&#x307E;&#x3093;&#x3002;&#x79C1;&#x304C;&#x3082;&#x3063;&#x3068;&#x65E9;&#x304F;&#x4F1D;&#x3048;&#x3066;&#x304A;&#x304F;&#x3079;&#x304D;&#x3060;&#x3063;&#x305F;&#x3002;&#x541B;&#x306E;&#x72EC;&#x81EA;&#x8868;&#x73FE;&#x3060;&#x3068;&#x601D;&#x3063;&#x3066;&#x2026;&#x300D;<br>&#x300C;&#x541B;&#x306E;&#x305B;&#x3044;&#x3058;&#x3083;&#x306A;&#x3044;&#x3088;&#x3002;&#x79C1;&#x304C;&#x7121;&#x77E5;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x2026;&#x3002;GitHub&#x3067;&#x5C0F;&#x8AAC;&#x306A;&#x3093;&#x3066;&#x306A;&#x307E;&#x3044;&#x304D;&#x306A;&#x3053;&#x3068;&#x3057;&#x3066;&#x3055;&#x2026;&#x300D;<br>&#x300C;&#x2026;&#x3053;&#x308C;&#xFF0C;&#x4ECA;&#x5F8C;&#x3082;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x304F;&#x306E;&#x304B;&#x300D;&#x300C;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3002;&#x3082;&#x3046;&#x5F15;&#x304D;&#x8FD4;&#x305B;&#x306A;&#x3044;&#x3002;&#x3053;&#x308C;&#x304C;&#x79C1;&#x306E;&#x30B9;&#x30BF;&#x30A4;&#x30EB;&#x3060;&#x304B;&#x3089;&#x300D;&#x300C;&#x3042;&#x2026;&#x305D;&#x3046;&#x300D;  </p>
<p><br>  </p>
<pre><code>&#x30D1;&#x30E9;&#x30B0;&#x30E9;&#x30D5;&#x306E;&#x9014;&#x4E2D;&#x3092;&#x5909;&#x66F4;&#x3057;&#x3066;&#x3082; Auto Fill &#x30E2;&#x30FC;&#x30C9;&#x306F;&#x305D;&#x308C;&#x3092;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x30D5;&#x30A3;&#x30EB;&#x3057;
&#x76F4;&#x3057;&#x306F;&#x3057;&#x307E;&#x305B;&#x3093;&#x3002;
&#x30D1;&#x30E9;&#x30B0;&#x30E9;&#x30D5;&#x3092;&#x30D5;&#x30A3;&#x30EB;&#x3057;&#x76F4;&#x3059;&#x306B;&#x306F;&#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x305D;&#x306E;&#x30D1;&#x30E9;&#x30B0;&#x30E9;&#x30D5;&#x306E;&#x4E2D;&#x306B;&#x7F6E;&#x3044;&#x3066;&#x304B;&#x3089;
M-q &#x3092;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;

&gt;&gt; &#x30AB;&#x30FC;&#x30BD;&#x30EB;&#x3092;&#x3053;&#x306E;&#x884C;&#x76F4;&#x524D;&#x306E;&#x30D1;&#x30E9;&#x30B0;&#x30E9;&#x30D5;&#x306B;&#x79FB;&#x52D5;&#x3055;&#x305B; M-q &#x3068;&#x30BF;&#x30A4;&#x30D7;&#x3057;&#x3066;&#x4E0B;&#x3055;&#x3044;&#x3002;
</code></pre><p>&#x300C;TeX&#x3067;&#x306F;&#x304A;&#x4E16;&#x8A71;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x300D;&#x300C;&#x3069;&#x3046;&#x3044;&#x3046;&#x610F;&#x5473;&#x3060;&#x300D;&#x300C;&#x9577;&#x3044;&#x6BB5;&#x843D;&#x306E;&#x6587;&#x7AE0;&#x66F8;&#x3044;&#x3066;&#x3082;&#xFF0C;M-q&#x3067;&#x30AD;&#x30C3;&#x30C1;&#x30EA;&#x63C3;&#x3048;&#x3066;&#x304F;&#x308C;&#x308B;&#x304B;&#x3089;&#x9054;&#x6210;&#x611F;&#x304C;&#x5F97;&#x3089;&#x308C;&#x305F;&#x3002;&#x3067;&#x3082;pdf&#x3068;&#x304B;epub&#x306B;&#x5909;&#x63DB;&#x3057;&#x305F;&#x308A;&#xFF0C;Web&#x306B;&#x51FA;&#x529B;&#x3059;&#x308B;&#x3068;&#x304D;&#x306B;&#x306F;&#x8DB3;&#x304B;&#x305B;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#xFF0C;&#x3054;&#x5229;&#x7528;&#x306F;&#x8A08;&#x753B;&#x7684;&#x306B;&#x300D;&#x300C;&#x305F;&#x3068;&#x3048;&#x3070;&#xFF1F;&#x300D;&#x300C;org-mode&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x4F7F;&#x3063;&#x3066;html&#x306B;&#x5909;&#x63DB;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x6539;&#x884C;&#x3057;&#x305F;&#x90E8;&#x5206;&#x306B;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x304C;&#x5165;&#x3063;&#x3061;&#x3083;&#x3046;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x56F0;&#x308B;&#x306A;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x306E;&#x6A2A;&#x5E45;&#x3092;&#x6C7A;&#x3081;&#x3066;&#x6539;&#x884C;&#x3057;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x300D;  </p>
<p><br><br>&#x300C;&#x7279;&#x5225;&#x4F01;&#x753B;!&#x30EA;&#x30FC;&#x30CA;&#x30B9;&#x306E;&#x8B0E;!&#x300D;&#x300C;&#x2026;&#x305D;&#x3093;&#x306A;&#x4E88;&#x5B9A;&#x3042;&#x3063;&#x305F;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x672C;&#x65E5;&#x306E;&#x8A66;&#x5408;&#x306F;&#x7D42;&#x4E86;&#x3057;&#x305F;&#x305F;&#x3081;&#xFF0C;&#x73FE;&#x5728;&#xFF0C;&#x7279;&#x5225;&#x756A;&#x7D44;&#x3092;&#x3054;&#x89A7;&#x3044;&#x305F;&#x3060;&#x3044;&#x3066;&#x304A;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;Linux&#x3068;Git&#x4F5C;&#x3063;&#x305F;&#x30EA;&#x30FC;&#x30CA;&#x30B9;&#x30FB;&#x30C8;&#x30FC;&#x30D0;&#x30EB;&#x30BA;&#x3063;&#x3066;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x300D;&#x300C;&#x79C1;&#x306B;&#x624B;&#x8DB3;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x3092;&#x6559;&#x3048;&#x305F;&#x4EBA;&#x300D;&#x300C;&#x3059;&#x3054;&#x3044;&#x8868;&#x73FE;&#x3060;&#x306A;&#x300D;&#x300C;&#x30EA;&#x30FC;&#x30CA;&#x30B9;&#x306F;<a href="https://web.archive.org/web/20061124122032/http://www.stifflog.com/2006/10/16/stiff-asks-great-programmers-answer/" target="_blank">uEmacs/PK</a>&#x3063;&#x3066;&#x3044;&#x3046;Emacs&#x3092;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x3089;&#x3057;&#x3044;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x8272;&#x3005;&#x3042;&#x308B;Emacs&#x306E;&#x3072;&#x3068;&#x3064;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x3093;&#x3002;&#x305D;&#x308C;&#x304C;&#x672C;&#x5F53;&#x306A;&#x306E;&#x304B;&#x77E5;&#x308A;&#x305F;&#x304F;&#x3066;&#x300D;&#x300C;&#x672C;&#x4EBA;&#x304C;&#x8A00;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x306B;&#x7591;&#x3046;&#x306E;&#x304B;&#x2026;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x3063;&#x3066;&#x6700;&#x5F8C;&#x306E;&#x66F4;&#x65B0;&#x304C;20&#x5E74;&#x4EE5;&#x4E0A;&#x524D;&#x306A;&#x3093;&#x3060;&#x3082;&#x3093;&#x300D;&#x300C;&#x3075;&#x3080;&#x300D;&#x300C;<a href="https://jp.linux.com/linux-community/30linuxkerneldevelopers/391903-30linuxlinus-torvalds" target="_blank">&#x4ED6;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30D3;&#x30E5;&#x30FC;</a>&#x3060;&#x3068;&#xFF0C;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x306B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3068;Git&#x7AEF;&#x672B;&#x306F;&#x6319;&#x3052;&#x3089;&#x308C;&#x3066;&#x305F;&#x3051;&#x3069;&#xFF0C;uEmacs/PK&#x306F;&#x3042;&#x3052;&#x3089;&#x308C;&#x3066;&#x306A;&#x304B;&#x3063;&#x305F;&#x3057;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x3069;&#x3046;&#x3060;&#x3063;&#x305F;&#x3093;&#x3060;&#x300D;&#x300C;<a href="https://www.youtube.com/watch?v=S5S9LIT-hdc" target="_blank">uEmacs/PK</a>!&#x4F7F;&#x3063;&#x3066;&#x307E;&#x3057;&#x305F;!&#x300D;&#x300C;&#x304A;&#x304A;&#x300D;&#x300C;&#x6620;&#x753B;&#x306B;&#x3042;&#x308A;&#x304C;&#x3061;&#x306A;&#x8D85;&#x9AD8;&#x901F;&#x30BF;&#x30A4;&#x30D4;&#x30F3;&#x30B0;&#x3058;&#x3083;&#x306A;&#x3044;&#x3068;&#x3053;&#x308D;&#x3082;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="16.html" class="navigation navigation-prev " aria-label="Previous page: 16 - メジャーの厚い壁">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="18.html" class="navigation navigation-next " aria-label="Next page: 18 - 心の声">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"17 - マイナーも厚い壁","level":"6.3","depth":1,"next":{"title":"18 - 心の声","level":"6.4","depth":1,"path":"18.md","ref":"18.md","articles":[]},"previous":{"title":"16 - メジャーの厚い壁","level":"6.2","depth":1,"path":"16.md","ref":"16.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"17.md","mtime":"2018-08-16T13:33:06.881Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T09:17:13.044Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

