
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>23 - そして · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="24.html" />
    
    
    <link rel="prev" href="22.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="21.html">
            
                <a href="21.html">
            
                    
                    21 - 答えは目の前にある
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="22.html">
            
                <a href="22.html">
            
                    
                    22 - 旅立ち
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">エピローグ</li>
        
        
    
        <li class="chapter active" data-level="8.1" data-path="23.html">
            
                <a href="23.html">
            
                    
                    23 - そして
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.2" data-path="24.html">
            
                <a href="24.html">
            
                    
                    24 - それから
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >23 - そして</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="23---&#x305D;&#x3057;&#x3066;">23 - &#x305D;&#x3057;&#x3066;</h1>
<p>&#x300C;&#x79C1;&#x304C;&#x3044;&#x306A;&#x304F;&#x3066;&#x3082;&#x3063;&#x3066;&#xFF0C;&#x3069;&#x3046;&#x3044;&#x3046;&#x2026;&#x3002;&#x2026;!!&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x7D76;&#x53E5;&#x3057;&#x305F;&#x3002;EeePC&#x306E;&#x6DB2;&#x6676;&#x306F;&#xFF0C;&#x6C17;&#x3065;&#x304B;&#x306A;&#x3044;&#x3046;&#x3061;&#x306B;&#x534A;&#x5206;&#x4EE5;&#x4E0A;&#x767D;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x300C;&#x541B;&#xFF0C;&#x753B;&#x9762;&#x304C;&#x300D;&#x300C;&#x3042;&#x3042;&#x3002;&#x3082;&#x3046;&#x541B;&#x306E;&#x9854;&#x306F;&#x898B;&#x3048;&#x306A;&#x3044;&#x300D;&#x300C;&#x3059;&#x3050;&#x306B;&#x4EA4;&#x63DB;&#x3057;&#x306A;&#x3044;&#x3068;&#x300D;  </p>
<p>&#x300C;&#x3044;&#x3084;&#xFF0C;&#x3082;&#x3046;&#x624B;&#x9045;&#x308C;&#x3060;&#x3002;&#x8272;&#x3005;&#x30AC;&#x30BF;&#x304C;&#x304D;&#x3066;&#x3044;&#x308B;&#x300D;&#x300C;&#x3048;&#xFF0C;&#x3061;&#x3087;&#x3063;&#x3068;&#x5F85;&#x3063;&#x3066;&#x3088;&#x3002;&#x5618;&#x3067;&#x3057;&#x3087;&#x300D;  </p>
<p>&#x7A81;&#x7136;&#x306E;&#x3053;&#x3068;&#x306B;&#x5446;&#x7136;&#x3068;&#x3059;&#x308B;&#x79C1;&#x3002;  </p>
<p>&#x300C;&#x304A;&#x305D;&#x3089;&#x304F;&#xFF0C;&#x6B21;&#x306B;&#x96FB;&#x6E90;&#x304C;&#x3064;&#x304F;&#x3053;&#x3068;&#x306F;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;&#x58F0;&#x306B;&#x30CE;&#x30A4;&#x30BA;&#x304C;&#x307E;&#x3056;&#x3063;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x9055;&#x548C;&#x611F;&#x3002;&#x79C1;&#x306E;&#x982D;&#x304C;EeePC&#x306E;&#x6DB2;&#x6676;&#x306E;&#x3088;&#x3046;&#x306B;&#x767D;&#x304F;&#x306A;&#x3063;&#x3066;&#x3086;&#x304F;&#x3002;&#x300C;&#x2026;&#x5618;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x541B;&#x304C;&#x30C1;&#x30E5;&#x30FC;&#x30C8;&#x30EA;&#x30A2;&#x30EB;&#x3092;&#x7D42;&#x3048;&#x308B;&#x307E;&#x3067;&#xFF0C;&#x79C1;&#x306E;&#x8EAB;&#x4F53;&#x304C;&#x3082;&#x3063;&#x3066;&#x304F;&#x308C;&#x3066;&#x3088;&#x304B;&#x3063;&#x305F;&#x3002;&#x9014;&#x4E2D;&#x3067;&#x58CA;&#x308C;&#x305F;&#x3089;&#xFF0C;&#x541B;&#x306F;&#x3084;&#x3081;&#x3066;&#x3057;&#x307E;&#x3046;&#x3060;&#x308D;&#x3046;&#x304B;&#x3089;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x3044;&#x3084;&#x3060;&#x3088;!&#x300D;&#x79C1;&#x306F;&#x53EB;&#x3076;&#x3002;&#x300C;&#x3053;&#x306E;&#x524D;SSD&#x306B;&#x4EA4;&#x63DB;&#x3057;&#x305F;&#x3070;&#x3063;&#x304B;&#x3058;&#x3083;&#x3093;!&#x300D;&#x300C;&#x3059;&#x307E;&#x306A;&#x3044;&#x2026;&#x3002;&#x305D;&#x306E;SSD&#x306F;&#x5225;&#x306E;&#x30DE;&#x30B7;&#x30F3;&#x306B;&#x3067;&#x3082;&#x2026;&#x4F7F;&#x3063;&#x3066;&#x304F;&#x308C;&#x300D;&#x58F0;&#x304C;&#x5C0F;&#x3055;&#x304F;&#x306A;&#x3063;&#x3066;&#x3044;&#x304F;&#x3088;&#x3046;&#x306B;&#x611F;&#x3058;&#x308B;&#x3002;&#x300C;&#x3044;&#x3084;&#x3060;&#x3002;&#x7D76;&#x5BFE;&#x4FEE;&#x7406;&#x3059;&#x308B;&#x304B;&#x3089;&#x300D;&#x300C;&#x90E8;&#x54C1;&#x304C;&#x306A;&#x3044;&#x3068;&#x8A00;&#x3063;&#x305F;&#x306E;&#x306F;&#x2026;&#x541B;&#x3060;&#x308D;&#x3046;&#x2026;&#xFF1F;&#x300D;&#x300C;&#x63A2;&#x3057;&#x51FA;&#x3057;&#x3066;&#x4FEE;&#x7406;&#x3059;&#x308B;&#x3002;&#x3044;&#x304F;&#x3089;&#x304B;&#x304B;&#x3063;&#x3066;&#x3082;&#x300D;&#x300C;&#x3060;&#x3081;&#x3060;&#x3002;&#x57FA;&#x677F;&#x3092;&#x4EE3;&#x3048;&#x3066;&#x3082;&#x2026;&#x305D;&#x308C;&#x306F;&#x3082;&#x306F;&#x3084;&#x79C1;&#x3058;&#x3083;&#x306A;&#x2026;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x3058;&#x3083;&#xFF0C;&#x3058;&#x3083;&#x3042;&#xFF0C;&#x541B;&#x306E;&#x57FA;&#x677F;&#x3092;&#x76F4;&#x3059;&#x304B;&#x3089;&#x2026;&#x3060;&#x304B;&#x3089;&#x3060;&#x3081;&#x306A;&#x3093;&#x3066;&#x8A00;&#x308F;&#x306A;&#x3044;&#x3067;&#x2026;&#x300D;  </p>
<p>&#x79C1;&#x306E;&#x76EE;&#x304B;&#x3089;&#x6D99;&#x304C;&#x3042;&#x3075;&#x308C;&#x3060;&#x3057;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x55DA;&#x54BD;&#x306B;&#x5909;&#x308F;&#x3063;&#x305F;&#x3002;&#x305D;&#x306E;&#x58F0;&#x304C;EeePC&#x306B;&#x3082;&#x5C4A;&#x3044;&#x305F;&#x306E;&#x304B;&#xFF0C;&#x306F;&#x3058;&#x3081;&#x3066;&#xFF0C;EeePC&#x304C;&#x7B11;&#x3063;&#x305F;&#x3088;&#x3046;&#x306B;&#x805E;&#x3053;&#x3048;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x2026;&#x79C1;&#x306F;&#xFF0C;&#x541B;&#x306E;&#x3088;&#x3046;&#x306A;&#x6301;&#x3061;&#x4E3B;&#x306B;&#x8CB7;&#x308F;&#x308C;&#x3066;&#x5E78;&#x305B;&#x3060;&#x3063;&#x305F;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3093;&#x306A;&#x2026;&#x304A;&#x308F;&#x304B;&#x308C;&#x307F;&#x305F;&#x3044;&#x306A;&#x3053;&#x3068;&#x2026;&#x8A00;&#x308F;&#x306A;&#x3044;&#x3067;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x30AD;&#x30C3;&#x30C1;&#x30F3;&#x306B;&#x6301;&#x3061;&#x8FBC;&#x3093;&#x3067;&#xFF0C;&#x30AF;&#x30C3;&#x30AF;&#x30D1;&#x30C3;&#x30C9;&#x3092;&#x898B;&#x306A;&#x304C;&#x3089;&#x4F5C;&#x3063;&#x305F;&#x9EBB;&#x5A46;&#x4E3C;&#x2026;&#x304A;&#x3044;&#x3057;&#x305D;&#x3046;&#x3060;&#x3063;&#x305F;&#x300D;&#x300C;&#x3053;&#x308C;&#x304B;&#x3089;&#x3044;&#x3064;&#x3067;&#x3082;&#xFF0C;&#x3082;&#x3063;&#x3068;&#x304A;&#x3044;&#x3057;&#x3044;&#x9EBB;&#x5A46;&#x4E3C;&#xFF0C;&#x4F5C;&#x3063;&#x3066;&#x3042;&#x3052;&#x308B;&#x304B;&#x3089;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x2026;Linux&#x3067;&#x753B;&#x9762;&#x5236;&#x5FA1;&#x3067;&#x304D;&#x305F;&#x3068;&#x304D;&#x306E;&#x2026;&#x541B;&#x306E;&#x559C;&#x3073;&#x3088;&#x3046;&#x2026;&#x5929;&#x4E95;&#x304C;&#x58CA;&#x308C;&#x308B;&#x304B;&#x3068;&#x2026;&#x601D;&#x3063;&#x305F;&#x2026;&#x3088;&#x300D;&#x300C;&#x3046;&#x308C;&#x3057;&#x304F;&#x3066;&#x2026;&#x5199;&#x771F;&#x4F55;&#x679A;&#x3082;&#x64AE;&#x3063;&#x305F;&#x306E;&#x2026;&#x899A;&#x3048;&#x3066;&#x308B;&#x2026;&#x4ECA;&#x3067;&#x3082;&#x898B;&#x308C;&#x308B;&#x3088;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x3044;&#x308D;&#x3093;&#x306A;&#x4EBA;&#x306B;&#x4F1A;&#x3063;&#x305F;&#x2026;&#x300D;&#x300C;&#x541B;&#x3067;&#x4F5C;&#x3063;&#x305F;&#x2026;&#x8CC7;&#x6599;&#x2026;&#x898B;&#x305B;&#x308B;&#x305F;&#x3081;&#x2026;&#x306B;&#x2026;&#x3060;&#x3088;&#x3002;iPad&#x306E;&#x5148;&#x99C6;&#x3051;&#x3060;&#x3088;&#x2026;&#x3059;&#x3054;&#x3044;&#x2026;&#x3067;&#x3057;&#x3087;&#x2026;&#xFF1F;&#x541B;&#x306E;&#x2026;&#x304A;&#x304B;&#x3052;&#x2026;&#x3060;&#x3088;&#x2026;&#x300D;  </p>
<p>&#x4E92;&#x3044;&#x306B;&#x58F0;&#x304C;&#x9014;&#x5207;&#x308C;&#x9014;&#x5207;&#x308C;&#x306B;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x3002;EeePC&#x306E;&#x58F0;&#x306F;&#x3082;&#x3046;&#x307B;&#x3068;&#x3093;&#x3069;&#x805E;&#x3053;&#x3048;&#x306A;&#x3044;&#x3002;&#x79C1;&#x306F;&#x81EA;&#x5206;&#x306E;&#x3057;&#x3083;&#x304F;&#x308A;&#x58F0;&#x306B;&#x90AA;&#x9B54;&#x3055;&#x308C;&#x306A;&#x304C;&#x3089;&#x3082;&#xFF0C;&#x5FC5;&#x6B7B;&#x306B;&#x8033;&#x3092;&#x3059;&#x307E;&#x305B;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x751F;&#x307E;&#x308C;&#x305F;&#x3068;&#x304D;&#x304B;&#x3089;&#x2026;&#x6642;&#x4EE3;&#x9045;&#x308C;&#x3060;&#x3063;&#x305F;&#x2026;&#x79C1;&#x306B;&#x2026;&#x3053;&#x308C;&#x3060;&#x3051;&#x306E;&#x2026;&#x7D20;&#x6674;&#x3089;&#x30B7;&#x30A4;&#x2026;&#x30B1;&#x30A4;&#x30B1;&#x30F3;&#x2026;&#x30F2;&#x2026;&#x30B5;&#x30BB;&#x30C6;&#x30AF;&#x30EC;&#x30C6;&#x2026;&#x30A2;&#x30EA;&#x30AC;&#x2026;&#x30C8;&#x30A6;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x5F85;&#x3063;&#x3066;&#x3002;&#x5F85;&#x3063;&#x3066;&#x3088;&#x3002;&#x3053;&#x308C;&#x304B;&#x3089;&#x3082;&#x697D;&#x3057;&#x3044;&#x3053;&#x3068;&#x2026;&#x3044;&#x3063;&#x3071;&#x3044;&#x3055;&#x305B;&#x3066;&#x2026;&#x3042;&#x3052;&#x308B;&#x2026;&#x304B;&#x3089;&#x3002;&#x2026;&#x3060;&#x304B;&#x3089;&#x300D;  </p>
<p>&#x300C;&#x30AD;&#x30DF;&#x30C8;&#x30CE;&#x2026;&#x5341;&#x2026;&#x5E74;&#x2026;&#x9593;&#x2026;&#x30BF;&#x30CE;&#x30B7;&#x30AB;&#x30C3;&#x2026;&#x30E7;&#x2026;&#x300D;  </p>
<p>&#x30D6;&#x30C4;&#x30F3;&#x3002;EeePC&#x306E;&#x753B;&#x9762;&#x304C;&#x771F;&#x3063;&#x9ED2;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;&#x305D;&#x3053;&#x306B;&#x306F;&#x304F;&#x3057;&#x3083;&#x304F;&#x3057;&#x3083;&#x306B;&#x306A;&#x3063;&#x305F;&#x79C1;&#x306E;&#x9854;&#x304C;&#x3046;&#x3064;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x96FB;&#x6E90;&#x3002;&#x30D0;&#x30C3;&#x30C6;&#x30EA;&#x30FC;&#x3002;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x3002;&#x4F55;&#x5EA6;&#x78BA;&#x8A8D;&#x3057;&#x3066;&#x3082;&#xFF0C;&#x3082;&#x306F;&#x3084;&#x53CD;&#x5FDC;&#x304C;&#x304B;&#x3048;&#x3063;&#x3066;&#x304F;&#x308B;&#x3053;&#x3068;&#x306F;&#x306A;&#x3044;&#x3002;  </p>
<p><br><br>&#x8EAB;&#x4F53;&#x304C;&#x7206;&#x767A;&#x3057;&#x305D;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;&#x79C1;&#x306F;&#x8FD1;&#x6240;&#x8FF7;&#x60D1;&#x306B;&#x306A;&#x308B;&#x307B;&#x3069;&#x306E;&#x58F0;&#x3067;&#x6CE3;&#x3053;&#x3046;&#x3068;&#x601D;&#x3063;&#x305F;&#x3002;&#x3060;&#x304C;&#xFF0C;&#x3042;&#x307E;&#x308A;&#x306B;&#x60B2;&#x3057;&#x3044;&#x3068;&#xFF0C;&#x4EBA;&#x306F;&#x58F0;&#x304C;&#x51FA;&#x305B;&#x306A;&#x304F;&#x306A;&#x308B;&#x306E;&#x3060;&#x3068;&#xFF0C;&#x305D;&#x306E;&#x3068;&#x304D;&#x521D;&#x3081;&#x3066;&#x77E5;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x671D;&#x520A;&#x3092;&#x904B;&#x3076;&#x30D0;&#x30A4;&#x30AF;&#x306E;&#x97F3;&#x3060;&#x3051;&#x304C;&#x90E8;&#x5C4B;&#x306B;&#x97FF;&#x3044;&#x305F;&#x3002;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="22.html" class="navigation navigation-prev " aria-label="Previous page: 22 - 旅立ち">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="24.html" class="navigation navigation-next " aria-label="Next page: 24 - それから">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"23 - そして","level":"8.1","depth":1,"next":{"title":"24 - それから","level":"8.2","depth":1,"path":"24.md","ref":"24.md","articles":[]},"previous":{"title":"22 - 旅立ち","level":"7.4","depth":1,"path":"22.md","ref":"22.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"23.md","mtime":"2018-08-17T16:48:35.525Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T18:06:09.538Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

