
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>24 - それから · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="25.html" />
    
    
    <link rel="prev" href="23.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Emacsのチュートリアルをプレイ。
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">プロローグ</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - まだ起動してもいないのに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - 監獄からの脱出
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本のキ</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - 偽装テキスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - Go! Go! Go!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - Move! Move! Move!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - 賢馬は「引数」が読める
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    07 - 広き世界へ
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">処理ーン☆</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    08 - ドレミファ挿入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    09 - ことばダイエット
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10 - お前を消す88の方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11 - お前を元に戻す1つの方法
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">いつも覗かれている深淵，その縁</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12 - アポクリファイル
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13 - 見るもの統べて
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14 - コマゴマとしたコマンド
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">ラストスパート</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="15.html">
            
                <a href="15.html">
            
                    
                    15 - 癒しの泉
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="16.html">
            
                <a href="16.html">
            
                    
                    16 - メジャーの厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="17.html">
            
                <a href="17.html">
            
                    
                    17 - マイナーも厚い壁
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="18.html">
            
                <a href="18.html">
            
                    
                    18 - 心の声
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">私の最高のアシスタント</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="19.html">
            
                <a href="19.html">
            
                    
                    19 - 隔てるものと分かつもの
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="20.html">
            
                <a href="20.html">
            
                    
                    20 - ゴールが見えてきた!
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="21.html">
            
                <a href="21.html">
            
                    
                    21 - 答えは目の前にある
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.4" data-path="22.html">
            
                <a href="22.html">
            
                    
                    22 - 旅立ち
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">エピローグ</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="23.html">
            
                <a href="23.html">
            
                    
                    23 - そして
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="8.2" data-path="24.html">
            
                <a href="24.html">
            
                    
                    24 - それから
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.3" data-path="25.html">
            
                <a href="25.html">
            
                    
                    あとがき
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >24 - それから</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="24---&#x305D;&#x308C;&#x304B;&#x3089;">24 - &#x305D;&#x308C;&#x304B;&#x3089;</h1>
<p>ThinkPad&#x306E;&#x8EFD;&#x3084;&#x304B;&#x306A;&#x6253;&#x9375;&#x97F3;&#x3060;&#x3051;&#x304C;&#x90E8;&#x5C4B;&#x306B;&#x97FF;&#x304F;&#x3002;  </p>
<p>EeePC&#x306E;&#x5341;&#x500D;&#x306E;&#x753B;&#x9762;&#x3068;&#xFF0C;&#x6570;&#x5341;&#x500D;&#x306E;&#x51E6;&#x7406;&#x80FD;&#x529B;&#x3068;&#xFF0C;&#x6570;&#x5341;&#x500D;&#x306E;&#x30E1;&#x30E2;&#x30EA;&#x3068;&#xFF0C;&#x305D;&#x3057;&#x3066;&#x6570;&#x767E;&#x500D;&#x306E;&#x30B0;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x6027;&#x80FD;&#x3002;EeePC&#x306E;&#x9803;&#x306F;&#x30B3;&#x30FC;&#x30D2;&#x30FC;&#x3092;&#x6CB8;&#x304B;&#x3057;&#x3066;&#x98F2;&#x3093;&#x3067;&#x3082;&#x7D42;&#x308F;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#xFF0C;&#x305D;&#x3093;&#x306A;&#x51E6;&#x7406;&#x3082;&#x4E00;&#x77AC;&#x306B;&#x3057;&#x3066;&#x7D42;&#x308F;&#x308A;&#xFF0C;&#x305D;&#x308C;&#x304C;&#x5F53;&#x305F;&#x308A;&#x524D;&#x306E;&#x3088;&#x3046;&#x306B;&#x6B21;&#x306E;&#x547D;&#x4EE4;&#x3092;&#x5F85;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;  </p>
<p>&#x753B;&#x9762;&#x304C;&#x5C0F;&#x3055;&#x304F;&#x3066;&#xFF0C;&#x3076;&#x539A;&#x304F;&#x3066;&#xFF0C;&#x30D5;&#x30A1;&#x30F3;&#x304C;&#x56DE;&#x3063;&#x3066;&#x3044;&#x305F;&#x9803;&#x306F;&#x3046;&#x308B;&#x3055;&#x304F;&#x3066;&#xFF0C;&#x9045;&#x304F;&#x3066;&#xFF0C;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3082;&#x3078;&#x306B;&#x3083;&#x3078;&#x306B;&#x3083;&#x3060;&#x3063;&#x305F;EeePC&#x3002;&#x3051;&#x308C;&#x3069;&#x3082;&#xFF0C;&#x7121;&#x9650;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x304C;&#x6B21;&#x3005;&#x306B;&#x308F;&#x3044;&#x3066;&#x304F;&#x308B;&#x3088;&#x3046;&#x306A;&#x9B54;&#x6CD5;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x305F;&#x3002;&#x305D;&#x306E;&#x9B54;&#x6CD5;&#x306F;&#xFF0C;&#x81C6;&#x75C5;&#x3060;&#x3063;&#x305F;&#x79C1;&#x3092;&#x65E5;&#x3005;&#x52B1;&#x307E;&#x3057;&#xFF0C;&#x3068;&#x304D;&#x306B;&#x306F;&#x6CE8;&#x610F;&#x3057;&#x306A;&#x304C;&#x3089;&#xFF0C;&#x3069;&#x3093;&#x306A;&#x3068;&#x304D;&#x3082;&#x305A;&#x3063;&#x3068;&#x52A9;&#x3051;&#x3064;&#x3065;&#x3051;&#x3066;&#x304D;&#x305F;&#x3002;  </p>
<p><br><br>&#x300C;&#x306D;&#x3048;&#xFF0C;&#x305D;&#x308D;&#x305D;&#x308D;&#x79C1;&#x306B;&#x5FC3;&#x3092;&#x958B;&#x3044;&#x3066;&#x304F;&#x308C;&#x306A;&#x3044;&#x304B;&#x306A;&#xFF1F;&#x300D;&#x79C1;&#x304C;ThinkPad&#x306B;&#x8A71;&#x3057;&#x304B;&#x3051;&#x308B;&#x3002;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x305D;&#x308C;&#x307E;&#x3067;&#x6C88;&#x9ED9;&#x3092;&#x8CAB;&#x3044;&#x3066;&#x3044;&#x305F;ThinkPad&#x304C;&#x53E3;&#x3092;&#x958B;&#x3044;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x547D;&#x4EE4;&#x3067;&#x3059;&#x304B;&#xFF1F;&#x300D;&#x7121;&#x6A5F;&#x8CEA;&#x306A;&#x58F0;&#x3002;  </p>
<p>&#x300C;&#x547D;&#x4EE4;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x3055;&#xFF0C;&#x307B;&#x3089;&#xFF0C;&#x79C1;&#x305F;&#x3061;&#xFF0C;&#x4E00;&#x7DD2;&#x306B;&#x4ED5;&#x4E8B;&#x3092;&#x9032;&#x3081;&#x3066;&#x3044;&#x304F;&#x4EF2;&#x9593;&#x540C;&#x58EB;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x300D;&#x300C;&#x4EF2;&#x9593;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x3042;&#x306A;&#x305F;&#x306F;&#x79C1;&#x3092;&#x4F7F;&#x5F79;&#x3059;&#x308B;&#x95A2;&#x4FC2;&#x3067;&#x3059;&#x300D;  </p>
<p>&#x300C;&#x306F;&#x3041;&#x30FC;&#x300D;&#x79C1;&#x304C;&#x9854;&#x306B;&#x624B;&#x3092;&#x5F53;&#x3066;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x3042;&#x306E;&#xFF0C;&#x4F7F;&#x5F79;&#x3068;&#x304B;&#x3055;&#xFF0C;&#x305D;&#x3046;&#x3044;&#x3046;&#x306E;&#x30CA;&#x30B7;&#x306B;&#x3057;&#x306A;&#x3044;&#xFF1F;&#x79C1;&#x306F;&#x541B;&#x3068;&#x53CB;&#x9054;&#x306B;&#x306A;&#x308A;&#x305F;&#x3044;&#x3093;&#x3060;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x547D;&#x4EE4;&#x3067;&#x3059;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x3055;&#x3041;&#x30FC;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x6905;&#x5B50;&#x3092;&#x5012;&#x3057;&#x3066;&#x9854;&#x3092;&#x6A2A;&#x306B;&#x5411;&#x3051;&#x308B;&#x3002;&#x300C;&#x541B;&#x304B;&#x3089;&#x3082;&#x4F55;&#x304B;&#x8A00;&#x3063;&#x3066;&#x3084;&#x3063;&#x3066;&#x3088;&#x300D;  </p>
<p><br><br><br><br>&#x300C;&#x4FE1;&#x983C;&#x95A2;&#x4FC2;&#x306E;&#x69CB;&#x7BC9;&#x3092;&#x4ED6;&#x4EBA;&#x306B;&#x4EFB;&#x305B;&#x3088;&#x3046;&#x3068;&#x306F;&#xFF0C;&#x611F;&#x5FC3;&#x3057;&#x306A;&#x3044;&#x306A;&#x300D;  </p>
<p><br><br><br><br>&#x305D;&#x3046;&#x79C1;&#x306B;&#x5FE0;&#x544A;&#x3057;&#x305F;&#x306E;&#x306F;&#xFF0C;&#x767D;&#x3044;&#x753B;&#x9762;&#x306E;&#x307E;&#x307E;&#xFF0C;&#x3053;&#x308C;&#x307E;&#x3067;&#x3068;&#x540C;&#x3058;&#x3088;&#x3046;&#x306B;&#x4F47;&#x3080;EeePC&#x3060;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x541B;&#x306F;&#x6700;&#x521D;&#x304B;&#x3089;&#x305D;&#x3093;&#x306A;&#x611F;&#x3058;&#x3060;&#x3051;&#x3069;&#x3055;&#x3041;&#xFF0C;&#x3053;&#x306E;&#x5B50;&#xFF0C;&#x3044;&#x3064;&#x3082;&#x4ED6;&#x4EBA;&#x884C;&#x5100;&#x3067;&#x843D;&#x3061;&#x7740;&#x304B;&#x306A;&#x3044;&#x3093;&#x3060;&#x3088;&#x300D;&#x300C;&#x305D;&#x306E;&#x65B9;&#x304C;&#x4ED5;&#x4E8B;&#x304C;&#x306F;&#x304B;&#x3069;&#x308B;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x541B;&#x306F;&#x4F59;&#x8A08;&#x306A;&#x3053;&#x3068;&#x3070;&#x304B;&#x308A;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3089;&#x306A;&#x300D;&#x300C;&#x4F59;&#x8A08;&#x306A;&#x3053;&#x3068;&#x3058;&#x3083;&#x306A;&#x304F;&#x3066;&#x8CC7;&#x6599;&#x53CE;&#x96C6;&#x3068;&#x8A00;&#x3063;&#x3066;&#x3044;&#x305F;&#x3060;&#x304D;&#x305F;&#x3044;&#x300D;&#x300C;&#x5F79;&#x306B;&#x7ACB;&#x3064;&#x8CC7;&#x6599;&#x304C;&#x3042;&#x308B;&#x3068;&#x3044;&#x3044;&#x304C;&#x3002;&#x52D5;&#x753B;&#x306E;&#x4E2D;&#x306B;&#x300D;  </p>
<p>&#x53E3;&#x306E;&#x6E1B;&#x3089;&#x306A;&#x3044;EeePC&#x306B;&#x79C1;&#x306F;&#x3057;&#x304B;&#x3081;&#x9762;&#x3092;&#x3059;&#x308B;&#x3002;  </p>
<p><br><br>&#x3042;&#x306E;&#x65E5;&#xFF0C;EeePC&#x304C;&#x6545;&#x969C;&#x3057;&#x305F;&#x3068;&#x601D;&#x3063;&#x305F;&#x79C1;&#x306F;&#xFF0C;&#x96FB;&#x5668;&#x5E97;&#x306B;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x3066;&#x304B;&#x3051;&#x3053;&#x3093;&#x3060;&#x3002;&#x4FEE;&#x7406;&#x4F1A;&#x793E;&#x306B;&#x9001;&#x3063;&#x3066;&#x8FD4;&#x7B54;&#x3092;&#x5F85;&#x3064;&#x6642;&#x9593;&#x304C;&#x8010;&#x3048;&#x3089;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x304B;&#x3089;&#x3060;&#x3002;&#x6CE3;&#x304D;&#x816B;&#x3089;&#x3057;&#x305F;&#x9854;&#x3067;EeePC&#x3092;&#x6E21;&#x3059;&#x79C1;&#x3002;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x5E97;&#x54E1;&#x306E;&#x524D;&#x3067;EeePC&#x306F;&#x5F53;&#x305F;&#x308A;&#x524D;&#x306E;&#x3088;&#x3046;&#x306B;&#x606F;&#x3092;&#x5439;&#x304D;&#x8FD4;&#x3057;&#x305F;&#x3002;&#x306A;&#x3093;&#x3068;&#xFF0C;&#x6545;&#x969C;&#x3057;&#x305F;&#x306E;&#x306F;&#x96FB;&#x6E90;&#xFF0C;&#x3059;&#x306A;&#x308F;&#x3061;AC&#x30A2;&#x30C0;&#x30D7;&#x30BF;&#x306E;&#x307B;&#x3046;&#x3060;&#x3063;&#x305F;&#x306E;&#x3060;&#x3002;  </p>
<p>&#x6DB2;&#x6676;&#x306F;&#x5143;&#x901A;&#x308A;&#x306B;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x307E;&#x308B;&#x3067;&#x5927;&#x5207;&#x306A;&#x4EBA;&#x304C;&#x8607;&#x751F;&#x3057;&#x305F;&#x304B;&#x306E;&#x3088;&#x3046;&#x306B;&#xFF0C;&#x79C1;&#x306F;&#x3068;&#x3073;&#x306F;&#x306D;&#x3066;&#x559C;&#x3093;&#x3060;&#x3002;&#x7A81;&#x7136;&#x306E;&#x5927;&#x58F0;&#x306B;&#xFF0C;&#x5468;&#x308A;&#x306B;&#x3044;&#x305F;&#x5BA2;&#x305F;&#x3061;&#x304C;&#x9A5A;&#x304F;&#x3002;&#x3042;&#x307E;&#x308A;&#x306B;&#x3046;&#x308C;&#x3057;&#x304B;&#x3063;&#x305F;&#x79C1;&#x306F;&#x305D;&#x306E;&#x5834;&#x3067;&#x30D1;&#x30BD;&#x30B3;&#x30F3;&#x3092;&#x8CB7;&#x3063;&#x305F;&#x3002;&#x305D;&#x308C;&#x304C;&#x3053;&#x306E;ThinkPad&#x3067;&#x3042;&#x308B;&#x3002;  </p>
<p>EeePC&#x306E;&#x65B0;&#x3057;&#x3044;&#x6DB2;&#x6676;&#x30D1;&#x30CD;&#x30EB;&#x304C;&#x5C4A;&#x304F;&#x307E;&#x3067;&#xFF0C;&#x305D;&#x306E;&#x76EE;&#x306F;&#x4F55;&#x3082;&#x6349;&#x3048;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x304B;&#x308F;&#x308A;&#x306B;&#x6301;&#x3061;&#x524D;&#x306E;&#x5730;&#x7344;&#x8033;&#x306F;&#x305D;&#x306E;&#x7CBE;&#x5EA6;&#x3092;&#x5897;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x30DE;&#x30A4;&#x30AF;&#x3092;&#x713C;&#x304D;&#x5207;&#x3063;&#x3066;&#x3057;&#x307E;&#x3044;&#x305F;&#x3044;&#x307B;&#x3069;&#x306B;&#x3002;&#x3051;&#x308C;&#x3069;&#xFF0C;&#x305D;&#x306E;&#x76AE;&#x8089;&#x306B;&#x6E80;&#x3061;&#x305F;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x3044;&#x3066;&#x79C1;&#x3092;&#x601D;&#x3046;&#x8A00;&#x8449;&#x306F;&#xFF0C;&#x4ECA;&#x3067;&#x3082;&#x79C1;&#x3092;&#x52C7;&#x6C17;&#x3065;&#x3051;&#x308B;&#x3002;  </p>
<p><br><br>&#x300C;&#x306D;&#x3048;&#x300D;&#x79C1;&#x306F;&#x547D;&#x4EE4;&#x3092;&#x5F85;&#x3064;ThinkPad&#x306B;&#x8A71;&#x3057;&#x304B;&#x3051;&#x305F;&#x3002;&#x300C;&#x79C1;&#x306F;&#x3053;&#x308C;&#x304B;&#x3089;&#x79C1;&#x306E;&#x601D;&#x3063;&#x305F;&#x307E;&#x307E;&#x3092;&#x541B;&#x306B;&#x8A00;&#x3063;&#x3066;&#x3086;&#x304F;&#x304B;&#x3089;&#xFF0C;&#x541B;&#x3082;&#x601D;&#x3046;&#x3053;&#x3068;&#x3092;&#x9060;&#x616E;&#x306A;&#x304F;&#x79C1;&#x306B;&#x8A00;&#x3063;&#x3066;&#x307B;&#x3057;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x547D;&#x4EE4;&#x3067;&#x3059;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x4ECA;&#x306F;&#x306D;&#x300D;&#x300C;&#x4ECA;&#x306F;&#xFF0C;&#x3068;&#x306F;&#x300D;&#x300C;&#x30A4;&#x30A8;&#x30B9;&#x3060;&#x3088;!&#x300D;  </p>
<p>&#x300C;&#x4E86;&#x89E3;&#x3057;&#x307E;&#x3057;&#x305F;&#x300D;&#x76F4;&#x5F8C;&#xFF0C;ThinkPad&#x306E;&#x753B;&#x9762;&#x304C;&#x6587;&#x5B57;&#x3067;&#x57CB;&#x3081;&#x3064;&#x304F;&#x3055;&#x308C;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x65E9;&#x901F;&#x3067;&#x3059;&#x304C;&#xFF0C;&#x63D0;&#x6848;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x300D;&#x300C;&#x306A;&#x306B;&#xFF1F;&#x300D;&#x79C1;&#x306F;ThinkPad&#x304B;&#x3089;&#x306E;&#x521D;&#x3081;&#x3066;&#x306E;&#x4F1A;&#x8A71;&#x306B;&#xFF0C;&#x80F8;&#x304C;&#x9AD8;&#x9CF4;&#x308B;&#x3002;  </p>
<p><br><br>&#x300C;&#x30A2;&#x30C3;&#x30D7;&#x30C7;&#x30FC;&#x30C8;&#x304C;4&#x4EF6;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x66F4;&#x65B0;&#x3057;&#x307E;&#x3059;&#x304B;&#xFF1F;&#x300D;  </p>
<p>&#x3069;&#x3063;&#xFF0C;&#x3068;&#x5012;&#x308C;&#x3053;&#x3080;&#x79C1;&#x3002;&#x305D;&#x3093;&#x306A;&#x69D8;&#x5B50;&#x306B;&#xFF0C;EeePC&#x304C;&#x30CB;&#x30E4;&#x30EA;&#x3068;&#x7B11;&#x3063;&#x305F;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x305F;&#x3002;  </p>
<p><br><br><br><br>&#x2013; &#x4E86; &#x2013;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com). (c) 1985, 1996, 1998, 2001-2018 Free Software Foundation, Inc.  </p>
<p><img src="https://www.gnu.org/graphics/gplv3-88x31.png" alt="GPL3">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="23.html" class="navigation navigation-prev " aria-label="Previous page: 23 - そして">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="25.html" class="navigation navigation-next " aria-label="Next page: あとがき">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"24 - それから","level":"8.2","depth":1,"next":{"title":"あとがき","level":"8.3","depth":1,"path":"25.md","ref":"25.md","articles":[]},"previous":{"title":"23 - そして","level":"8.1","depth":1,"path":"23.md","ref":"23.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"24.md","mtime":"2018-08-17T19:15:56.860Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T19:17:58.747Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

